/* automatically generated by rust-bindgen */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage, Align>
where
  Storage: AsRef<[u8]> + AsMut<[u8]>,
{
  storage: Storage,
  align: [Align; 0],
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align>
where
  Storage: AsRef<[u8]> + AsMut<[u8]>,
{
  #[inline]
  pub fn new(storage: Storage) -> Self {
    Self { storage, align: [] }
  }
  #[inline]
  pub fn get_bit(&self, index: usize) -> bool {
    debug_assert!(index / 8 < self.storage.as_ref().len());
    let byte_index = index / 8;
    let byte = self.storage.as_ref()[byte_index];
    let bit_index = if cfg!(target_endian = "big") {
      7 - (index % 8)
    } else {
      index % 8
    };
    let mask = 1 << bit_index;
    byte & mask == mask
  }
  #[inline]
  pub fn set_bit(&mut self, index: usize, val: bool) {
    debug_assert!(index / 8 < self.storage.as_ref().len());
    let byte_index = index / 8;
    let byte = &mut self.storage.as_mut()[byte_index];
    let bit_index = if cfg!(target_endian = "big") {
      7 - (index % 8)
    } else {
      index % 8
    };
    let mask = 1 << bit_index;
    if val {
      *byte |= mask;
    } else {
      *byte &= !mask;
    }
  }
  #[inline]
  pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
    debug_assert!(bit_width <= 64);
    debug_assert!(bit_offset / 8 < self.storage.as_ref().len());

pub const SDL_HINT_IME_INTERNAL_EDITING: &'static [u8; 25usize] = b"SDL_IME_INTERNAL_EDITING\0";
pub const SDL_HINT_ANDROID_SEPARATE_MOUSE_AND_TOUCH: &'static [u8; 37usize] =
  b"SDL_ANDROID_SEPARATE_MOUSE_AND_TOUCH\0";
pub const SDL_HINT_ANDROID_TRAP_BACK_BUTTON: &'static [u8; 29usize] =
  b"SDL_ANDROID_TRAP_BACK_BUTTON\0";
pub const SDL_HINT_RETURN_KEY_HIDES_IME: &'static [u8; 25usize] = b"SDL_RETURN_KEY_HIDES_IME\0";
pub const SDL_HINT_EMSCRIPTEN_KEYBOARD_ELEMENT: &'static [u8; 32usize] =
  b"SDL_EMSCRIPTEN_KEYBOARD_ELEMENT\0";
pub const SDL_HINT_NO_SIGNAL_HANDLERS: &'static [u8; 23usize] = b"SDL_NO_SIGNAL_HANDLERS\0";
pub const SDL_HINT_WINDOWS_NO_CLOSE_ON_ALT_F4: &'static [u8; 31usize] =
  b"SDL_WINDOWS_NO_CLOSE_ON_ALT_F4\0";
pub const SDL_HINT_BMP_SAVE_LEGACY_FORMAT: &'static [u8; 27usize] = b"SDL_BMP_SAVE_LEGACY_FORMAT\0";
pub const SDL_HINT_WINDOWS_DISABLE_THREAD_NAMING: &'static [u8; 34usize] =
  b"SDL_WINDOWS_DISABLE_THREAD_NAMING\0";
pub const SDL_HINT_RPI_VIDEO_LAYER: &'static [u8; 20usize] = b"SDL_RPI_VIDEO_LAYER\0";
pub const SDL_HINT_VIDEO_DOUBLE_BUFFER: &'static [u8; 24usize] = b"SDL_VIDEO_DOUBLE_BUFFER\0";
pub const SDL_HINT_OPENGL_ES_DRIVER: &'static [u8; 21usize] = b"SDL_OPENGL_ES_DRIVER\0";
pub const SDL_HINT_AUDIO_RESAMPLING_MODE: &'static [u8; 26usize] = b"SDL_AUDIO_RESAMPLING_MODE\0";
pub const SDL_HINT_AUDIO_CATEGORY: &'static [u8; 19usize] = b"SDL_AUDIO_CATEGORY\0";
pub const SDL_MAX_LOG_MESSAGE: u32 = 4096;
pub const SDL_STANDARD_GRAVITY: f64 = 9.80665;
pub const SDL_NONSHAPEABLE_WINDOW: i32 = -1;
pub const SDL_INVALID_SHAPE_ARGUMENT: i32 = -2;
pub const SDL_WINDOW_LACKS_SHAPE: i32 = -3;
pub const SDL_MAJOR_VERSION: u32 = 2;
pub const SDL_MINOR_VERSION: u32 = 0;
pub const SDL_PATCHLEVEL: u32 = 9;
pub const SDL_INIT_TIMER: u32 = 1;
pub const SDL_INIT_AUDIO: u32 = 16;
pub const SDL_INIT_VIDEO: u32 = 32;
pub const SDL_INIT_JOYSTICK: u32 = 512;
pub const SDL_INIT_HAPTIC: u32 = 4096;
pub const SDL_INIT_GAMECONTROLLER: u32 = 8192;
pub const SDL_INIT_EVENTS: u32 = 16384;
pub const SDL_INIT_SENSOR: u32 = 32768;
pub const SDL_INIT_NOPARACHUTE: u32 = 1048576;
pub const SDL_INIT_EVERYTHING: u32 = 62001;
extern "C" {
  #[doc = "  \\brief Gets the name of the platform."]
  #[link_name = "\u{1}_SDL_GetPlatform"]
  pub fn SDL_GetPlatform() -> *const libc::c_char;
}
pub type __int8_t = libc::c_schar;
pub type __uint8_t = libc::c_uchar;
pub type __int16_t = libc::c_short;
pub type __uint16_t = libc::c_ushort;
pub type __int32_t = libc::c_int;
pub type __uint32_t = libc::c_uint;
pub type __int64_t = libc::c_longlong;
pub type __uint64_t = libc::c_ulonglong;
pub type __darwin_intptr_t = libc::c_long;
pub type __darwin_natural_t = libc::c_uint;
pub type __darwin_ct_rune_t = libc::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t {
  pub __mbstate8: [libc::c_char; 128usize],
  pub _mbstateL: libc::c_longlong,
  _bindgen_union_align: [u64; 16usize],
}
#[test]
fn bindgen_test_layout___mbstate_t() {
  assert_eq!(
    ::core::mem::size_of::<__mbstate_t>(),
    128usize,
    concat!("Size of: ", stringify!(__mbstate_t))
  );
  assert_eq!(
    ::core::mem::align_of::<__mbstate_t>(),
    8usize,
    concat!("Alignment of ", stringify!(__mbstate_t))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__mbstate_t>())).__mbstate8 as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__mbstate_t),
      "::",
      stringify!(__mbstate8)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__mbstate_t>()))._mbstateL as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__mbstate_t),
      "::",
      stringify!(_mbstateL)
    )
  );
}
impl Default for __mbstate_t {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
impl ::core::fmt::Debug for __mbstate_t {
  fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
    write!(f, "__mbstate_t {{ union }}")
  }
}
pub type __darwin_mbstate_t = __mbstate_t;
pub type __darwin_ptrdiff_t = libc::c_long;
pub type __darwin_size_t = libc::c_ulong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_wchar_t = libc::c_int;
pub type __darwin_rune_t = __darwin_wchar_t;
pub type __darwin_wint_t = libc::c_int;
pub type __darwin_clock_t = libc::c_ulong;
pub type __darwin_socklen_t = __uint32_t;
pub type __darwin_ssize_t = libc::c_long;
pub type __darwin_time_t = libc::c_long;
pub type u_int8_t = libc::c_uchar;
pub type u_int16_t = libc::c_ushort;
pub type u_int32_t = libc::c_uint;
pub type u_int64_t = libc::c_ulonglong;
pub type register_t = i64;
pub type user_addr_t = u_int64_t;
pub type user_size_t = u_int64_t;
pub type user_ssize_t = i64;
pub type user_long_t = i64;
pub type user_ulong_t = u_int64_t;
pub type user_time_t = i64;
pub type user_off_t = i64;
pub type syscall_arg_t = u_int64_t;
pub type __darwin_blkcnt_t = __int64_t;
pub type __darwin_blksize_t = __int32_t;
pub type __darwin_dev_t = __int32_t;
pub type __darwin_fsblkcnt_t = libc::c_uint;
pub type __darwin_fsfilcnt_t = libc::c_uint;
pub type __darwin_gid_t = __uint32_t;
pub type __darwin_id_t = __uint32_t;
pub type __darwin_ino64_t = __uint64_t;
pub type __darwin_ino_t = __uint32_t;
pub type __darwin_mach_port_name_t = __darwin_natural_t;
pub type __darwin_mach_port_t = __darwin_mach_port_name_t;
pub type __darwin_mode_t = __uint16_t;
pub type __darwin_off_t = __int64_t;
pub type __darwin_pid_t = __int32_t;
pub type __darwin_sigset_t = __uint32_t;
pub type __darwin_suseconds_t = __int32_t;
pub type __darwin_uid_t = __uint32_t;
pub type __darwin_useconds_t = __uint32_t;
pub type __darwin_uuid_t = [libc::c_uchar; 16usize];
pub type __darwin_uuid_string_t = [libc::c_char; 37usize];
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct __darwin_pthread_handler_rec {
  pub __routine: ::core::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void)>,
  pub __arg: *mut libc::c_void,
  pub __next: *mut __darwin_pthread_handler_rec,
}
#[test]
fn bindgen_test_layout___darwin_pthread_handler_rec() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_pthread_handler_rec>(),
    24usize,
    concat!("Size of: ", stringify!(__darwin_pthread_handler_rec))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_pthread_handler_rec>(),
    8usize,
    concat!("Alignment of ", stringify!(__darwin_pthread_handler_rec))
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_pthread_handler_rec>())).__routine as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_pthread_handler_rec),
      "::",
      stringify!(__routine)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_pthread_handler_rec>())).__arg as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_pthread_handler_rec),
      "::",
      stringify!(__arg)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_pthread_handler_rec>())).__next as *const _ as usize
    },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_pthread_handler_rec),
      "::",
      stringify!(__next)
    )
  );
}
impl Default for __darwin_pthread_handler_rec {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _opaque_pthread_attr_t {
  pub __sig: libc::c_long,
  pub __opaque: [libc::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_attr_t() {
  assert_eq!(
    ::core::mem::size_of::<_opaque_pthread_attr_t>(),
    64usize,
    concat!("Size of: ", stringify!(_opaque_pthread_attr_t))
  );
  assert_eq!(
    ::core::mem::align_of::<_opaque_pthread_attr_t>(),
    8usize,
    concat!("Alignment of ", stringify!(_opaque_pthread_attr_t))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<_opaque_pthread_attr_t>())).__sig as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_opaque_pthread_attr_t),
      "::",
      stringify!(__sig)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<_opaque_pthread_attr_t>())).__opaque as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_opaque_pthread_attr_t),
      "::",
      stringify!(__opaque)
    )
  );
}
impl Default for _opaque_pthread_attr_t {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
impl ::core::fmt::Debug for _opaque_pthread_attr_t {
  fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
    write!(
      f,
      "_opaque_pthread_attr_t {{ __sig: {:?}, __opaque: [...] }}",
      self.__sig
    )
  }
}
impl ::core::cmp::PartialEq for _opaque_pthread_attr_t {
  fn eq(&self, other: &_opaque_pthread_attr_t) -> bool {
    self.__sig == other.__sig && &self.__opaque[..] == &other.__opaque[..]
  }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _opaque_pthread_cond_t {
  pub __sig: libc::c_long,
  pub __opaque: [libc::c_char; 40usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_cond_t() {
  assert_eq!(
    ::core::mem::size_of::<_opaque_pthread_cond_t>(),
    48usize,
    concat!("Size of: ", stringify!(_opaque_pthread_cond_t))
  );
  assert_eq!(
    ::core::mem::align_of::<_opaque_pthread_cond_t>(),
    8usize,
    concat!("Alignment of ", stringify!(_opaque_pthread_cond_t))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<_opaque_pthread_cond_t>())).__sig as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_opaque_pthread_cond_t),
      "::",
      stringify!(__sig)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<_opaque_pthread_cond_t>())).__opaque as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_opaque_pthread_cond_t),
      "::",
      stringify!(__opaque)
    )
  );
}
impl Default for _opaque_pthread_cond_t {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
impl ::core::fmt::Debug for _opaque_pthread_cond_t {
  fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
    write!(
      f,
      "_opaque_pthread_cond_t {{ __sig: {:?}, __opaque: [...] }}",
      self.__sig
    )
  }
}
impl ::core::cmp::PartialEq for _opaque_pthread_cond_t {
  fn eq(&self, other: &_opaque_pthread_cond_t) -> bool {
    self.__sig == other.__sig && &self.__opaque[..] == &other.__opaque[..]
  }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct _opaque_pthread_condattr_t {
  pub __sig: libc::c_long,
  pub __opaque: [libc::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_condattr_t() {
  assert_eq!(
    ::core::mem::size_of::<_opaque_pthread_condattr_t>(),
    16usize,
    concat!("Size of: ", stringify!(_opaque_pthread_condattr_t))
  );
  assert_eq!(
    ::core::mem::align_of::<_opaque_pthread_condattr_t>(),
    8usize,
    concat!("Alignment of ", stringify!(_opaque_pthread_condattr_t))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<_opaque_pthread_condattr_t>())).__sig as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_opaque_pthread_condattr_t),
      "::",
      stringify!(__sig)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<_opaque_pthread_condattr_t>())).__opaque as *const _ as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_opaque_pthread_condattr_t),
      "::",
      stringify!(__opaque)
    )
  );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _opaque_pthread_mutex_t {
  pub __sig: libc::c_long,
  pub __opaque: [libc::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutex_t() {
  assert_eq!(
    ::core::mem::size_of::<_opaque_pthread_mutex_t>(),
    64usize,
    concat!("Size of: ", stringify!(_opaque_pthread_mutex_t))
  );
  assert_eq!(
    ::core::mem::align_of::<_opaque_pthread_mutex_t>(),
    8usize,
    concat!("Alignment of ", stringify!(_opaque_pthread_mutex_t))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<_opaque_pthread_mutex_t>())).__sig as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_opaque_pthread_mutex_t),
      "::",
      stringify!(__sig)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<_opaque_pthread_mutex_t>())).__opaque as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_opaque_pthread_mutex_t),
      "::",
      stringify!(__opaque)
    )
  );
}
impl Default for _opaque_pthread_mutex_t {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
impl ::core::fmt::Debug for _opaque_pthread_mutex_t {
  fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
    write!(
      f,
      "_opaque_pthread_mutex_t {{ __sig: {:?}, __opaque: [...] }}",
      self.__sig
    )
  }
}
impl ::core::cmp::PartialEq for _opaque_pthread_mutex_t {
  fn eq(&self, other: &_opaque_pthread_mutex_t) -> bool {
    self.__sig == other.__sig && &self.__opaque[..] == &other.__opaque[..]
  }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct _opaque_pthread_mutexattr_t {
  pub __sig: libc::c_long,
  pub __opaque: [libc::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutexattr_t() {
  assert_eq!(
    ::core::mem::size_of::<_opaque_pthread_mutexattr_t>(),
    16usize,
    concat!("Size of: ", stringify!(_opaque_pthread_mutexattr_t))
  );
  assert_eq!(
    ::core::mem::align_of::<_opaque_pthread_mutexattr_t>(),
    8usize,
    concat!("Alignment of ", stringify!(_opaque_pthread_mutexattr_t))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<_opaque_pthread_mutexattr_t>())).__sig as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_opaque_pthread_mutexattr_t),
      "::",
      stringify!(__sig)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<_opaque_pthread_mutexattr_t>())).__opaque as *const _ as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_opaque_pthread_mutexattr_t),
      "::",
      stringify!(__opaque)
    )
  );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct _opaque_pthread_once_t {
  pub __sig: libc::c_long,
  pub __opaque: [libc::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_once_t() {
  assert_eq!(
    ::core::mem::size_of::<_opaque_pthread_once_t>(),
    16usize,
    concat!("Size of: ", stringify!(_opaque_pthread_once_t))
  );
  assert_eq!(
    ::core::mem::align_of::<_opaque_pthread_once_t>(),
    8usize,
    concat!("Alignment of ", stringify!(_opaque_pthread_once_t))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<_opaque_pthread_once_t>())).__sig as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_opaque_pthread_once_t),
      "::",
      stringify!(__sig)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<_opaque_pthread_once_t>())).__opaque as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_opaque_pthread_once_t),
      "::",
      stringify!(__opaque)
    )
  );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _opaque_pthread_rwlock_t {
  pub __sig: libc::c_long,
  pub __opaque: [libc::c_char; 192usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_rwlock_t() {
  assert_eq!(
    ::core::mem::size_of::<_opaque_pthread_rwlock_t>(),
    200usize,
    concat!("Size of: ", stringify!(_opaque_pthread_rwlock_t))
  );
  assert_eq!(
    ::core::mem::align_of::<_opaque_pthread_rwlock_t>(),
    8usize,
    concat!("Alignment of ", stringify!(_opaque_pthread_rwlock_t))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<_opaque_pthread_rwlock_t>())).__sig as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_opaque_pthread_rwlock_t),
      "::",
      stringify!(__sig)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<_opaque_pthread_rwlock_t>())).__opaque as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_opaque_pthread_rwlock_t),
      "::",
      stringify!(__opaque)
    )
  );
}
impl Default for _opaque_pthread_rwlock_t {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
impl ::core::fmt::Debug for _opaque_pthread_rwlock_t {
  fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
    write!(
      f,
      "_opaque_pthread_rwlock_t {{ __sig: {:?}, __opaque: [...] }}",
      self.__sig
    )
  }
}
impl ::core::cmp::PartialEq for _opaque_pthread_rwlock_t {
  fn eq(&self, other: &_opaque_pthread_rwlock_t) -> bool {
    self.__sig == other.__sig && &self.__opaque[..] == &other.__opaque[..]
  }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct _opaque_pthread_rwlockattr_t {
  pub __sig: libc::c_long,
  pub __opaque: [libc::c_char; 16usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_rwlockattr_t() {
  assert_eq!(
    ::core::mem::size_of::<_opaque_pthread_rwlockattr_t>(),
    24usize,
    concat!("Size of: ", stringify!(_opaque_pthread_rwlockattr_t))
  );
  assert_eq!(
    ::core::mem::align_of::<_opaque_pthread_rwlockattr_t>(),
    8usize,
    concat!("Alignment of ", stringify!(_opaque_pthread_rwlockattr_t))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<_opaque_pthread_rwlockattr_t>())).__sig as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_opaque_pthread_rwlockattr_t),
      "::",
      stringify!(__sig)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<_opaque_pthread_rwlockattr_t>())).__opaque as *const _ as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_opaque_pthread_rwlockattr_t),
      "::",
      stringify!(__opaque)
    )
  );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _opaque_pthread_t {
  pub __sig: libc::c_long,
  pub __cleanup_stack: *mut __darwin_pthread_handler_rec,
  pub __opaque: [libc::c_char; 8176usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_t() {
  assert_eq!(
    ::core::mem::size_of::<_opaque_pthread_t>(),
    8192usize,
    concat!("Size of: ", stringify!(_opaque_pthread_t))
  );
  assert_eq!(
    ::core::mem::align_of::<_opaque_pthread_t>(),
    8usize,
    concat!("Alignment of ", stringify!(_opaque_pthread_t))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<_opaque_pthread_t>())).__sig as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_opaque_pthread_t),
      "::",
      stringify!(__sig)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<_opaque_pthread_t>())).__cleanup_stack as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_opaque_pthread_t),
      "::",
      stringify!(__cleanup_stack)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<_opaque_pthread_t>())).__opaque as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_opaque_pthread_t),
      "::",
      stringify!(__opaque)
    )
  );
}
impl Default for _opaque_pthread_t {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
impl ::core::fmt::Debug for _opaque_pthread_t {
  fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
    write!(
      f,
      "_opaque_pthread_t {{ __sig: {:?}, __cleanup_stack: {:?}, __opaque: [...] }}",
      self.__sig, self.__cleanup_stack
    )
  }
}
impl ::core::cmp::PartialEq for _opaque_pthread_t {
  fn eq(&self, other: &_opaque_pthread_t) -> bool {
    self.__sig == other.__sig
      && self.__cleanup_stack == other.__cleanup_stack
      && &self.__opaque[..] == &other.__opaque[..]
  }
}
pub type __darwin_pthread_attr_t = _opaque_pthread_attr_t;
pub type __darwin_pthread_cond_t = _opaque_pthread_cond_t;
pub type __darwin_pthread_condattr_t = _opaque_pthread_condattr_t;
pub type __darwin_pthread_key_t = libc::c_ulong;
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type __darwin_pthread_mutexattr_t = _opaque_pthread_mutexattr_t;
pub type __darwin_pthread_once_t = _opaque_pthread_once_t;
pub type __darwin_pthread_rwlock_t = _opaque_pthread_rwlock_t;
pub type __darwin_pthread_rwlockattr_t = _opaque_pthread_rwlockattr_t;
pub type __darwin_pthread_t = *mut _opaque_pthread_t;
pub type u_char = libc::c_uchar;
pub type u_short = libc::c_ushort;
pub type u_int = libc::c_uint;
pub type u_long = libc::c_ulong;
pub type ushort = libc::c_ushort;
pub type uint = libc::c_uint;
pub type u_quad_t = u_int64_t;
pub type quad_t = i64;
pub type qaddr_t = *mut quad_t;
pub type caddr_t = *mut libc::c_char;
pub type daddr_t = i32;
pub type dev_t = __darwin_dev_t;
pub type fixpt_t = u_int32_t;
pub type blkcnt_t = __darwin_blkcnt_t;
pub type blksize_t = __darwin_blksize_t;
pub type gid_t = __darwin_gid_t;
pub type in_addr_t = __uint32_t;
pub type in_port_t = __uint16_t;
pub type ino_t = __darwin_ino_t;
pub type ino64_t = __darwin_ino64_t;
pub type key_t = __int32_t;
pub type mode_t = __darwin_mode_t;
pub type nlink_t = __uint16_t;
pub type id_t = __darwin_id_t;
pub type pid_t = __darwin_pid_t;
pub type off_t = __darwin_off_t;
pub type segsz_t = i32;
pub type swblk_t = i32;
pub type uid_t = __darwin_uid_t;
pub type clock_t = __darwin_clock_t;
pub type time_t = __darwin_time_t;
pub type useconds_t = __darwin_useconds_t;
pub type suseconds_t = __darwin_suseconds_t;
pub type rsize_t = __darwin_size_t;
pub type errno_t = libc::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct fd_set {
  pub fds_bits: [__int32_t; 32usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
  assert_eq!(
    ::core::mem::size_of::<fd_set>(),
    128usize,
    concat!("Size of: ", stringify!(fd_set))
  );
  assert_eq!(
    ::core::mem::align_of::<fd_set>(),
    4usize,
    concat!("Alignment of ", stringify!(fd_set))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<fd_set>())).fds_bits as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(fd_set),
      "::",
      stringify!(fds_bits)
    )
  );
}
pub type fd_mask = __int32_t;
pub type pthread_attr_t = __darwin_pthread_attr_t;
pub type pthread_cond_t = __darwin_pthread_cond_t;
pub type pthread_condattr_t = __darwin_pthread_condattr_t;
pub type pthread_mutex_t = __darwin_pthread_mutex_t;
pub type pthread_mutexattr_t = __darwin_pthread_mutexattr_t;
pub type pthread_once_t = __darwin_pthread_once_t;
pub type pthread_rwlock_t = __darwin_pthread_rwlock_t;
pub type pthread_rwlockattr_t = __darwin_pthread_rwlockattr_t;
pub type pthread_t = __darwin_pthread_t;
pub type pthread_key_t = __darwin_pthread_key_t;
pub type fsblkcnt_t = __darwin_fsblkcnt_t;
pub type fsfilcnt_t = __darwin_fsfilcnt_t;
pub type __darwin_nl_item = libc::c_int;
pub type __darwin_wctrans_t = libc::c_int;
pub type __darwin_wctype_t = __uint32_t;
pub type va_list = __darwin_va_list;
extern "C" {
  #[link_name = "\u{1}_renameat"]
  pub fn renameat(
    arg1: libc::c_int,
    arg2: *const libc::c_char,
    arg3: libc::c_int,
    arg4: *const libc::c_char,
  ) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_renamex_np"]
  pub fn renamex_np(
    arg1: *const libc::c_char,
    arg2: *const libc::c_char,
    arg3: libc::c_uint,
  ) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_renameatx_np"]
  pub fn renameatx_np(
    arg1: libc::c_int,
    arg2: *const libc::c_char,
    arg3: libc::c_int,
    arg4: *const libc::c_char,
    arg5: libc::c_uint,
  ) -> libc::c_int;
}
pub type fpos_t = __darwin_off_t;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct __sbuf {
  pub _base: *mut libc::c_uchar,
  pub _size: libc::c_int,
}
#[test]
fn bindgen_test_layout___sbuf() {
  assert_eq!(
    ::core::mem::size_of::<__sbuf>(),
    16usize,
    concat!("Size of: ", stringify!(__sbuf))
  );
  assert_eq!(
    ::core::mem::align_of::<__sbuf>(),
    8usize,
    concat!("Alignment of ", stringify!(__sbuf))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__sbuf>()))._base as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__sbuf),
      "::",
      stringify!(_base)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__sbuf>()))._size as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(__sbuf),
      "::",
      stringify!(_size)
    )
  );
}
impl Default for __sbuf {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILEX {
  _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct __sFILE {
  pub _p: *mut libc::c_uchar,
  pub _r: libc::c_int,
  pub _w: libc::c_int,
  pub _flags: libc::c_short,
  pub _file: libc::c_short,
  pub _bf: __sbuf,
  pub _lbfsize: libc::c_int,
  pub _cookie: *mut libc::c_void,
  pub _close: ::core::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void) -> libc::c_int>,
  pub _read: ::core::option::Option<
    unsafe extern "C" fn(
      arg1: *mut libc::c_void,
      arg2: *mut libc::c_char,
      arg3: libc::c_int,
    ) -> libc::c_int,
  >,
  pub _seek: ::core::option::Option<
    unsafe extern "C" fn(arg1: *mut libc::c_void, arg2: fpos_t, arg3: libc::c_int) -> fpos_t,
  >,
  pub _write: ::core::option::Option<
    unsafe extern "C" fn(
      arg1: *mut libc::c_void,
      arg2: *const libc::c_char,
      arg3: libc::c_int,
    ) -> libc::c_int,
  >,
  pub _ub: __sbuf,
  pub _extra: *mut __sFILEX,
  pub _ur: libc::c_int,
  pub _ubuf: [libc::c_uchar; 3usize],
  pub _nbuf: [libc::c_uchar; 1usize],
  pub _lb: __sbuf,
  pub _blksize: libc::c_int,
  pub _offset: fpos_t,
}
#[test]
fn bindgen_test_layout___sFILE() {
  assert_eq!(
    ::core::mem::size_of::<__sFILE>(),
    152usize,
    concat!("Size of: ", stringify!(__sFILE))
  );
  assert_eq!(
    ::core::mem::align_of::<__sFILE>(),
    8usize,
    concat!("Alignment of ", stringify!(__sFILE))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__sFILE>()))._p as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__sFILE),
      "::",
      stringify!(_p)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__sFILE>()))._r as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(__sFILE),
      "::",
      stringify!(_r)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__sFILE>()))._w as *const _ as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(__sFILE),
      "::",
      stringify!(_w)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__sFILE>()))._flags as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(__sFILE),
      "::",
      stringify!(_flags)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__sFILE>()))._file as *const _ as usize },
    18usize,
    concat!(
      "Offset of field: ",
      stringify!(__sFILE),
      "::",
      stringify!(_file)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__sFILE>()))._bf as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(__sFILE),
      "::",
      stringify!(_bf)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__sFILE>()))._lbfsize as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(__sFILE),
      "::",
      stringify!(_lbfsize)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__sFILE>()))._cookie as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(__sFILE),
      "::",
      stringify!(_cookie)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__sFILE>()))._close as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(__sFILE),
      "::",
      stringify!(_close)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__sFILE>()))._read as *const _ as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(__sFILE),
      "::",
      stringify!(_read)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__sFILE>()))._seek as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(__sFILE),
      "::",
      stringify!(_seek)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__sFILE>()))._write as *const _ as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(__sFILE),
      "::",
      stringify!(_write)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__sFILE>()))._ub as *const _ as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(__sFILE),
      "::",
      stringify!(_ub)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__sFILE>()))._extra as *const _ as usize },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(__sFILE),
      "::",
      stringify!(_extra)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__sFILE>()))._ur as *const _ as usize },
    112usize,
    concat!(
      "Offset of field: ",
      stringify!(__sFILE),
      "::",
      stringify!(_ur)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__sFILE>()))._ubuf as *const _ as usize },
    116usize,
    concat!(
      "Offset of field: ",
      stringify!(__sFILE),
      "::",
      stringify!(_ubuf)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__sFILE>()))._nbuf as *const _ as usize },
    119usize,
    concat!(
      "Offset of field: ",
      stringify!(__sFILE),
      "::",
      stringify!(_nbuf)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__sFILE>()))._lb as *const _ as usize },
    120usize,
    concat!(
      "Offset of field: ",
      stringify!(__sFILE),
      "::",
      stringify!(_lb)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__sFILE>()))._blksize as *const _ as usize },
    136usize,
    concat!(
      "Offset of field: ",
      stringify!(__sFILE),
      "::",
      stringify!(_blksize)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__sFILE>()))._offset as *const _ as usize },
    144usize,
    concat!(
      "Offset of field: ",
      stringify!(__sFILE),
      "::",
      stringify!(_offset)
    )
  );
}
impl Default for __sFILE {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
pub type FILE = __sFILE;
extern "C" {
  #[link_name = "\u{1}___stdinp"]
  pub static mut __stdinp: *mut FILE;
}
extern "C" {
  #[link_name = "\u{1}___stdoutp"]
  pub static mut __stdoutp: *mut FILE;
}
extern "C" {
  #[link_name = "\u{1}___stderrp"]
  pub static mut __stderrp: *mut FILE;
}
extern "C" {
  #[link_name = "\u{1}_clearerr"]
  pub fn clearerr(arg1: *mut FILE);
}
extern "C" {
  #[link_name = "\u{1}_fclose"]
  pub fn fclose(arg1: *mut FILE) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_feof"]
  pub fn feof(arg1: *mut FILE) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_ferror"]
  pub fn ferror(arg1: *mut FILE) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_fflush"]
  pub fn fflush(arg1: *mut FILE) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_fgetc"]
  pub fn fgetc(arg1: *mut FILE) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_fgetpos"]
  pub fn fgetpos(arg1: *mut FILE, arg2: *mut fpos_t) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_fgets"]
  pub fn fgets(arg1: *mut libc::c_char, arg2: libc::c_int, arg3: *mut FILE) -> *mut libc::c_char;
}
extern "C" {
  #[link_name = "\u{1}_fopen"]
  pub fn fopen(__filename: *const libc::c_char, __mode: *const libc::c_char) -> *mut FILE;
}
extern "C" {
  #[link_name = "\u{1}_fprintf"]
  pub fn fprintf(arg1: *mut FILE, arg2: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_fputc"]
  pub fn fputc(arg1: libc::c_int, arg2: *mut FILE) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_fputs"]
  pub fn fputs(arg1: *const libc::c_char, arg2: *mut FILE) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_fread"]
  pub fn fread(
    __ptr: *mut libc::c_void,
    __size: usize,
    __nitems: usize,
    __stream: *mut FILE,
  ) -> usize;
}
extern "C" {
  #[link_name = "\u{1}_freopen"]
  pub fn freopen(
    arg1: *const libc::c_char,
    arg2: *const libc::c_char,
    arg3: *mut FILE,
  ) -> *mut FILE;
}
extern "C" {
  #[link_name = "\u{1}_fscanf"]
  pub fn fscanf(arg1: *mut FILE, arg2: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_fseek"]
  pub fn fseek(arg1: *mut FILE, arg2: libc::c_long, arg3: libc::c_int) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_fsetpos"]
  pub fn fsetpos(arg1: *mut FILE, arg2: *const fpos_t) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_ftell"]
  pub fn ftell(arg1: *mut FILE) -> libc::c_long;
}
extern "C" {
  #[link_name = "\u{1}_fwrite"]
  pub fn fwrite(
    __ptr: *const libc::c_void,
    __size: usize,
    __nitems: usize,
    __stream: *mut FILE,
  ) -> usize;
}
extern "C" {
  #[link_name = "\u{1}_getc"]
  pub fn getc(arg1: *mut FILE) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_getchar"]
  pub fn getchar() -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_gets"]
  pub fn gets(arg1: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
  #[link_name = "\u{1}_perror"]
  pub fn perror(arg1: *const libc::c_char);
}
extern "C" {
  #[link_name = "\u{1}_printf"]
  pub fn printf(arg1: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_putc"]
  pub fn putc(arg1: libc::c_int, arg2: *mut FILE) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_putchar"]
  pub fn putchar(arg1: libc::c_int) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_puts"]
  pub fn puts(arg1: *const libc::c_char) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_remove"]
  pub fn remove(arg1: *const libc::c_char) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_rename"]
  pub fn rename(__old: *const libc::c_char, __new: *const libc::c_char) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_rewind"]
  pub fn rewind(arg1: *mut FILE);
}
extern "C" {
  #[link_name = "\u{1}_scanf"]
  pub fn scanf(arg1: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_setbuf"]
  pub fn setbuf(arg1: *mut FILE, arg2: *mut libc::c_char);
}
extern "C" {
  #[link_name = "\u{1}_setvbuf"]
  pub fn setvbuf(
    arg1: *mut FILE,
    arg2: *mut libc::c_char,
    arg3: libc::c_int,
    arg4: usize,
  ) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_sprintf"]
  pub fn sprintf(arg1: *mut libc::c_char, arg2: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_sscanf"]
  pub fn sscanf(arg1: *const libc::c_char, arg2: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_tmpfile"]
  pub fn tmpfile() -> *mut FILE;
}
extern "C" {
  #[link_name = "\u{1}_tmpnam"]
  pub fn tmpnam(arg1: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
  #[link_name = "\u{1}_ungetc"]
  pub fn ungetc(arg1: libc::c_int, arg2: *mut FILE) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_vfprintf"]
  pub fn vfprintf(
    arg1: *mut FILE,
    arg2: *const libc::c_char,
    arg3: *mut __va_list_tag,
  ) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_vprintf"]
  pub fn vprintf(arg1: *const libc::c_char, arg2: *mut __va_list_tag) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_vsprintf"]
  pub fn vsprintf(
    arg1: *mut libc::c_char,
    arg2: *const libc::c_char,
    arg3: *mut __va_list_tag,
  ) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_ctermid"]
  pub fn ctermid(arg1: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
  #[link_name = "\u{1}_fdopen"]
  pub fn fdopen(arg1: libc::c_int, arg2: *const libc::c_char) -> *mut FILE;
}
extern "C" {
  #[link_name = "\u{1}_fileno"]
  pub fn fileno(arg1: *mut FILE) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_pclose"]
  pub fn pclose(arg1: *mut FILE) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_popen"]
  pub fn popen(arg1: *const libc::c_char, arg2: *const libc::c_char) -> *mut FILE;
}
extern "C" {
  #[link_name = "\u{1}___srget"]
  pub fn __srget(arg1: *mut FILE) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}___svfscanf"]
  pub fn __svfscanf(
    arg1: *mut FILE,
    arg2: *const libc::c_char,
    arg3: *mut __va_list_tag,
  ) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}___swbuf"]
  pub fn __swbuf(arg1: libc::c_int, arg2: *mut FILE) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_flockfile"]
  pub fn flockfile(arg1: *mut FILE);
}
extern "C" {
  #[link_name = "\u{1}_ftrylockfile"]
  pub fn ftrylockfile(arg1: *mut FILE) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_funlockfile"]
  pub fn funlockfile(arg1: *mut FILE);
}
extern "C" {
  #[link_name = "\u{1}_getc_unlocked"]
  pub fn getc_unlocked(arg1: *mut FILE) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_getchar_unlocked"]
  pub fn getchar_unlocked() -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_putc_unlocked"]
  pub fn putc_unlocked(arg1: libc::c_int, arg2: *mut FILE) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_putchar_unlocked"]
  pub fn putchar_unlocked(arg1: libc::c_int) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_getw"]
  pub fn getw(arg1: *mut FILE) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_putw"]
  pub fn putw(arg1: libc::c_int, arg2: *mut FILE) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_tempnam"]
  pub fn tempnam(__dir: *const libc::c_char, __prefix: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
  #[link_name = "\u{1}_fseeko"]
  pub fn fseeko(__stream: *mut FILE, __offset: off_t, __whence: libc::c_int) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_ftello"]
  pub fn ftello(__stream: *mut FILE) -> off_t;
}
extern "C" {
  #[link_name = "\u{1}_snprintf"]
  pub fn snprintf(
    __str: *mut libc::c_char,
    __size: libc::c_ulong,
    __format: *const libc::c_char,
    ...
  ) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_vfscanf"]
  pub fn vfscanf(
    __stream: *mut FILE,
    __format: *const libc::c_char,
    arg1: *mut __va_list_tag,
  ) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_vscanf"]
  pub fn vscanf(__format: *const libc::c_char, arg1: *mut __va_list_tag) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_vsnprintf"]
  pub fn vsnprintf(
    __str: *mut libc::c_char,
    __size: libc::c_ulong,
    __format: *const libc::c_char,
    arg1: *mut __va_list_tag,
  ) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_vsscanf"]
  pub fn vsscanf(
    __str: *const libc::c_char,
    __format: *const libc::c_char,
    arg1: *mut __va_list_tag,
  ) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_dprintf"]
  pub fn dprintf(arg1: libc::c_int, arg2: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_vdprintf"]
  pub fn vdprintf(
    arg1: libc::c_int,
    arg2: *const libc::c_char,
    arg3: *mut __va_list_tag,
  ) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_getdelim"]
  pub fn getdelim(
    __linep: *mut *mut libc::c_char,
    __linecapp: *mut usize,
    __delimiter: libc::c_int,
    __stream: *mut FILE,
  ) -> isize;
}
extern "C" {
  #[link_name = "\u{1}_getline"]
  pub fn getline(
    __linep: *mut *mut libc::c_char,
    __linecapp: *mut usize,
    __stream: *mut FILE,
  ) -> isize;
}
extern "C" {
  #[link_name = "\u{1}_fmemopen"]
  pub fn fmemopen(
    __buf: *mut libc::c_void,
    __size: usize,
    __mode: *const libc::c_char,
  ) -> *mut FILE;
}
extern "C" {
  #[link_name = "\u{1}_open_memstream"]
  pub fn open_memstream(__bufp: *mut *mut libc::c_char, __sizep: *mut usize) -> *mut FILE;
}
extern "C" {
  #[link_name = "\u{1}_sys_nerr"]
  pub static sys_nerr: libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_sys_errlist"]
  pub static mut sys_errlist: [*const libc::c_char; 0usize];
}
extern "C" {
  #[link_name = "\u{1}_asprintf"]
  pub fn asprintf(arg1: *mut *mut libc::c_char, arg2: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_ctermid_r"]
  pub fn ctermid_r(arg1: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
  #[link_name = "\u{1}_fgetln"]
  pub fn fgetln(arg1: *mut FILE, arg2: *mut usize) -> *mut libc::c_char;
}
extern "C" {
  #[link_name = "\u{1}_fmtcheck"]
  pub fn fmtcheck(arg1: *const libc::c_char, arg2: *const libc::c_char) -> *const libc::c_char;
}
extern "C" {
  #[link_name = "\u{1}_fpurge"]
  pub fn fpurge(arg1: *mut FILE) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_setbuffer"]
  pub fn setbuffer(arg1: *mut FILE, arg2: *mut libc::c_char, arg3: libc::c_int);
}
extern "C" {
  #[link_name = "\u{1}_setlinebuf"]
  pub fn setlinebuf(arg1: *mut FILE) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_vasprintf"]
  pub fn vasprintf(
    arg1: *mut *mut libc::c_char,
    arg2: *const libc::c_char,
    arg3: *mut __va_list_tag,
  ) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_zopen"]
  pub fn zopen(
    arg1: *const libc::c_char,
    arg2: *const libc::c_char,
    arg3: libc::c_int,
  ) -> *mut FILE;
}
extern "C" {
  #[link_name = "\u{1}_funopen"]
  pub fn funopen(
    arg1: *const libc::c_void,
    arg2: ::core::option::Option<
      unsafe extern "C" fn(
        arg1: *mut libc::c_void,
        arg2: *mut libc::c_char,
        arg3: libc::c_int,
      ) -> libc::c_int,
    >,
    arg3: ::core::option::Option<
      unsafe extern "C" fn(
        arg1: *mut libc::c_void,
        arg2: *const libc::c_char,
        arg3: libc::c_int,
      ) -> libc::c_int,
    >,
    arg4: ::core::option::Option<
      unsafe extern "C" fn(arg1: *mut libc::c_void, arg2: fpos_t, arg3: libc::c_int) -> fpos_t,
    >,
    arg5: ::core::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void) -> libc::c_int>,
  ) -> *mut FILE;
}
pub mod idtype_t {
  pub type Type = u32;
  pub const P_ALL: Type = 0;
  pub const P_PID: Type = 1;
  pub const P_PGID: Type = 2;
}
pub type sig_atomic_t = libc::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct __darwin_i386_thread_state {
  pub __eax: libc::c_uint,
  pub __ebx: libc::c_uint,
  pub __ecx: libc::c_uint,
  pub __edx: libc::c_uint,
  pub __edi: libc::c_uint,
  pub __esi: libc::c_uint,
  pub __ebp: libc::c_uint,
  pub __esp: libc::c_uint,
  pub __ss: libc::c_uint,
  pub __eflags: libc::c_uint,
  pub __eip: libc::c_uint,
  pub __cs: libc::c_uint,
  pub __ds: libc::c_uint,
  pub __es: libc::c_uint,
  pub __fs: libc::c_uint,
  pub __gs: libc::c_uint,
}
#[test]
fn bindgen_test_layout___darwin_i386_thread_state() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_i386_thread_state>(),
    64usize,
    concat!("Size of: ", stringify!(__darwin_i386_thread_state))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_i386_thread_state>(),
    4usize,
    concat!("Alignment of ", stringify!(__darwin_i386_thread_state))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_thread_state>())).__eax as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_thread_state),
      "::",
      stringify!(__eax)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_thread_state>())).__ebx as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_thread_state),
      "::",
      stringify!(__ebx)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_thread_state>())).__ecx as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_thread_state),
      "::",
      stringify!(__ecx)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_thread_state>())).__edx as *const _ as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_thread_state),
      "::",
      stringify!(__edx)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_thread_state>())).__edi as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_thread_state),
      "::",
      stringify!(__edi)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_thread_state>())).__esi as *const _ as usize },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_thread_state),
      "::",
      stringify!(__esi)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_thread_state>())).__ebp as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_thread_state),
      "::",
      stringify!(__ebp)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_thread_state>())).__esp as *const _ as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_thread_state),
      "::",
      stringify!(__esp)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_thread_state>())).__ss as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_thread_state),
      "::",
      stringify!(__ss)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_thread_state>())).__eflags as *const _ as usize
    },
    36usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_thread_state),
      "::",
      stringify!(__eflags)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_thread_state>())).__eip as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_thread_state),
      "::",
      stringify!(__eip)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_thread_state>())).__cs as *const _ as usize },
    44usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_thread_state),
      "::",
      stringify!(__cs)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_thread_state>())).__ds as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_thread_state),
      "::",
      stringify!(__ds)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_thread_state>())).__es as *const _ as usize },
    52usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_thread_state),
      "::",
      stringify!(__es)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_thread_state>())).__fs as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_thread_state),
      "::",
      stringify!(__fs)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_thread_state>())).__gs as *const _ as usize },
    60usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_thread_state),
      "::",
      stringify!(__gs)
    )
  );
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct __darwin_fp_control {
  pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u8>,
}
#[test]
fn bindgen_test_layout___darwin_fp_control() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_fp_control>(),
    2usize,
    concat!("Size of: ", stringify!(__darwin_fp_control))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_fp_control>(),
    2usize,
    concat!("Alignment of ", stringify!(__darwin_fp_control))
  );
}
impl __darwin_fp_control {
  #[inline]
  pub fn __invalid(&self) -> libc::c_ushort {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
  }
  #[inline]
  pub fn set___invalid(&mut self, val: libc::c_ushort) {
    unsafe {
      let val: u16 = ::core::mem::transmute(val);
      self._bitfield_1.set(0usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn __denorm(&self) -> libc::c_ushort {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u16) }
  }
  #[inline]
  pub fn set___denorm(&mut self, val: libc::c_ushort) {
    unsafe {
      let val: u16 = ::core::mem::transmute(val);
      self._bitfield_1.set(1usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn __zdiv(&self) -> libc::c_ushort {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u16) }
  }
  #[inline]
  pub fn set___zdiv(&mut self, val: libc::c_ushort) {
    unsafe {
      let val: u16 = ::core::mem::transmute(val);
      self._bitfield_1.set(2usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn __ovrfl(&self) -> libc::c_ushort {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u16) }
  }
  #[inline]
  pub fn set___ovrfl(&mut self, val: libc::c_ushort) {
    unsafe {
      let val: u16 = ::core::mem::transmute(val);
      self._bitfield_1.set(3usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn __undfl(&self) -> libc::c_ushort {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u16) }
  }
  #[inline]
  pub fn set___undfl(&mut self, val: libc::c_ushort) {
    unsafe {
      let val: u16 = ::core::mem::transmute(val);
      self._bitfield_1.set(4usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn __precis(&self) -> libc::c_ushort {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u16) }
  }
  #[inline]
  pub fn set___precis(&mut self, val: libc::c_ushort) {
    unsafe {
      let val: u16 = ::core::mem::transmute(val);
      self._bitfield_1.set(5usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn __pc(&self) -> libc::c_ushort {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 2u8) as u16) }
  }
  #[inline]
  pub fn set___pc(&mut self, val: libc::c_ushort) {
    unsafe {
      let val: u16 = ::core::mem::transmute(val);
      self._bitfield_1.set(8usize, 2u8, val as u64)
    }
  }
  #[inline]
  pub fn __rc(&self) -> libc::c_ushort {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 2u8) as u16) }
  }
  #[inline]
  pub fn set___rc(&mut self, val: libc::c_ushort) {
    unsafe {
      let val: u16 = ::core::mem::transmute(val);
      self._bitfield_1.set(10usize, 2u8, val as u64)
    }
  }
  #[inline]
  pub fn new_bitfield_1(
    __invalid: libc::c_ushort,
    __denorm: libc::c_ushort,
    __zdiv: libc::c_ushort,
    __ovrfl: libc::c_ushort,
    __undfl: libc::c_ushort,
    __precis: libc::c_ushort,
    __pc: libc::c_ushort,
    __rc: libc::c_ushort,
  ) -> __BindgenBitfieldUnit<[u8; 2usize], u8> {
    let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u8> = Default::default();
    __bindgen_bitfield_unit.set(0usize, 1u8, {
      let __invalid: u16 = unsafe { ::core::mem::transmute(__invalid) };
      __invalid as u64
    });
    __bindgen_bitfield_unit.set(1usize, 1u8, {
      let __denorm: u16 = unsafe { ::core::mem::transmute(__denorm) };
      __denorm as u64
    });
    __bindgen_bitfield_unit.set(2usize, 1u8, {
      let __zdiv: u16 = unsafe { ::core::mem::transmute(__zdiv) };
      __zdiv as u64
    });
    __bindgen_bitfield_unit.set(3usize, 1u8, {
      let __ovrfl: u16 = unsafe { ::core::mem::transmute(__ovrfl) };
      __ovrfl as u64
    });
    __bindgen_bitfield_unit.set(4usize, 1u8, {
      let __undfl: u16 = unsafe { ::core::mem::transmute(__undfl) };
      __undfl as u64
    });
    __bindgen_bitfield_unit.set(5usize, 1u8, {
      let __precis: u16 = unsafe { ::core::mem::transmute(__precis) };
      __precis as u64
    });
    __bindgen_bitfield_unit.set(8usize, 2u8, {
      let __pc: u16 = unsafe { ::core::mem::transmute(__pc) };
      __pc as u64
    });
    __bindgen_bitfield_unit.set(10usize, 2u8, {
      let __rc: u16 = unsafe { ::core::mem::transmute(__rc) };
      __rc as u64
    });
    __bindgen_bitfield_unit
  }
}
pub type __darwin_fp_control_t = __darwin_fp_control;
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct __darwin_fp_status {
  pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u8>,
}
#[test]
fn bindgen_test_layout___darwin_fp_status() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_fp_status>(),
    2usize,
    concat!("Size of: ", stringify!(__darwin_fp_status))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_fp_status>(),
    2usize,
    concat!("Alignment of ", stringify!(__darwin_fp_status))
  );
}
impl __darwin_fp_status {
  #[inline]
  pub fn __invalid(&self) -> libc::c_ushort {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
  }
  #[inline]
  pub fn set___invalid(&mut self, val: libc::c_ushort) {
    unsafe {
      let val: u16 = ::core::mem::transmute(val);
      self._bitfield_1.set(0usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn __denorm(&self) -> libc::c_ushort {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u16) }
  }
  #[inline]
  pub fn set___denorm(&mut self, val: libc::c_ushort) {
    unsafe {
      let val: u16 = ::core::mem::transmute(val);
      self._bitfield_1.set(1usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn __zdiv(&self) -> libc::c_ushort {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u16) }
  }
  #[inline]
  pub fn set___zdiv(&mut self, val: libc::c_ushort) {
    unsafe {
      let val: u16 = ::core::mem::transmute(val);
      self._bitfield_1.set(2usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn __ovrfl(&self) -> libc::c_ushort {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u16) }
  }
  #[inline]
  pub fn set___ovrfl(&mut self, val: libc::c_ushort) {
    unsafe {
      let val: u16 = ::core::mem::transmute(val);
      self._bitfield_1.set(3usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn __undfl(&self) -> libc::c_ushort {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u16) }
  }
  #[inline]
  pub fn set___undfl(&mut self, val: libc::c_ushort) {
    unsafe {
      let val: u16 = ::core::mem::transmute(val);
      self._bitfield_1.set(4usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn __precis(&self) -> libc::c_ushort {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u16) }
  }
  #[inline]
  pub fn set___precis(&mut self, val: libc::c_ushort) {
    unsafe {
      let val: u16 = ::core::mem::transmute(val);
      self._bitfield_1.set(5usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn __stkflt(&self) -> libc::c_ushort {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u16) }
  }
  #[inline]
  pub fn set___stkflt(&mut self, val: libc::c_ushort) {
    unsafe {
      let val: u16 = ::core::mem::transmute(val);
      self._bitfield_1.set(6usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn __errsumm(&self) -> libc::c_ushort {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u16) }
  }
  #[inline]
  pub fn set___errsumm(&mut self, val: libc::c_ushort) {
    unsafe {
      let val: u16 = ::core::mem::transmute(val);
      self._bitfield_1.set(7usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn __c0(&self) -> libc::c_ushort {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u16) }
  }
  #[inline]
  pub fn set___c0(&mut self, val: libc::c_ushort) {
    unsafe {
      let val: u16 = ::core::mem::transmute(val);
      self._bitfield_1.set(8usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn __c1(&self) -> libc::c_ushort {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u16) }
  }
  #[inline]
  pub fn set___c1(&mut self, val: libc::c_ushort) {
    unsafe {
      let val: u16 = ::core::mem::transmute(val);
      self._bitfield_1.set(9usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn __c2(&self) -> libc::c_ushort {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u16) }
  }
  #[inline]
  pub fn set___c2(&mut self, val: libc::c_ushort) {
    unsafe {
      let val: u16 = ::core::mem::transmute(val);
      self._bitfield_1.set(10usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn __tos(&self) -> libc::c_ushort {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 3u8) as u16) }
  }
  #[inline]
  pub fn set___tos(&mut self, val: libc::c_ushort) {
    unsafe {
      let val: u16 = ::core::mem::transmute(val);
      self._bitfield_1.set(11usize, 3u8, val as u64)
    }
  }
  #[inline]
  pub fn __c3(&self) -> libc::c_ushort {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u16) }
  }
  #[inline]
  pub fn set___c3(&mut self, val: libc::c_ushort) {
    unsafe {
      let val: u16 = ::core::mem::transmute(val);
      self._bitfield_1.set(14usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn __busy(&self) -> libc::c_ushort {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
  }
  #[inline]
  pub fn set___busy(&mut self, val: libc::c_ushort) {
    unsafe {
      let val: u16 = ::core::mem::transmute(val);
      self._bitfield_1.set(15usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn new_bitfield_1(
    __invalid: libc::c_ushort,
    __denorm: libc::c_ushort,
    __zdiv: libc::c_ushort,
    __ovrfl: libc::c_ushort,
    __undfl: libc::c_ushort,
    __precis: libc::c_ushort,
    __stkflt: libc::c_ushort,
    __errsumm: libc::c_ushort,
    __c0: libc::c_ushort,
    __c1: libc::c_ushort,
    __c2: libc::c_ushort,
    __tos: libc::c_ushort,
    __c3: libc::c_ushort,
    __busy: libc::c_ushort,
  ) -> __BindgenBitfieldUnit<[u8; 2usize], u8> {
    let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u8> = Default::default();
    __bindgen_bitfield_unit.set(0usize, 1u8, {
      let __invalid: u16 = unsafe { ::core::mem::transmute(__invalid) };
      __invalid as u64
    });
    __bindgen_bitfield_unit.set(1usize, 1u8, {
      let __denorm: u16 = unsafe { ::core::mem::transmute(__denorm) };
      __denorm as u64
    });
    __bindgen_bitfield_unit.set(2usize, 1u8, {
      let __zdiv: u16 = unsafe { ::core::mem::transmute(__zdiv) };
      __zdiv as u64
    });
    __bindgen_bitfield_unit.set(3usize, 1u8, {
      let __ovrfl: u16 = unsafe { ::core::mem::transmute(__ovrfl) };
      __ovrfl as u64
    });
    __bindgen_bitfield_unit.set(4usize, 1u8, {
      let __undfl: u16 = unsafe { ::core::mem::transmute(__undfl) };
      __undfl as u64
    });
    __bindgen_bitfield_unit.set(5usize, 1u8, {
      let __precis: u16 = unsafe { ::core::mem::transmute(__precis) };
      __precis as u64
    });
    __bindgen_bitfield_unit.set(6usize, 1u8, {
      let __stkflt: u16 = unsafe { ::core::mem::transmute(__stkflt) };
      __stkflt as u64
    });
    __bindgen_bitfield_unit.set(7usize, 1u8, {
      let __errsumm: u16 = unsafe { ::core::mem::transmute(__errsumm) };
      __errsumm as u64
    });
    __bindgen_bitfield_unit.set(8usize, 1u8, {
      let __c0: u16 = unsafe { ::core::mem::transmute(__c0) };
      __c0 as u64
    });
    __bindgen_bitfield_unit.set(9usize, 1u8, {
      let __c1: u16 = unsafe { ::core::mem::transmute(__c1) };
      __c1 as u64
    });
    __bindgen_bitfield_unit.set(10usize, 1u8, {
      let __c2: u16 = unsafe { ::core::mem::transmute(__c2) };
      __c2 as u64
    });
    __bindgen_bitfield_unit.set(11usize, 3u8, {
      let __tos: u16 = unsafe { ::core::mem::transmute(__tos) };
      __tos as u64
    });
    __bindgen_bitfield_unit.set(14usize, 1u8, {
      let __c3: u16 = unsafe { ::core::mem::transmute(__c3) };
      __c3 as u64
    });
    __bindgen_bitfield_unit.set(15usize, 1u8, {
      let __busy: u16 = unsafe { ::core::mem::transmute(__busy) };
      __busy as u64
    });
    __bindgen_bitfield_unit
  }
}
pub type __darwin_fp_status_t = __darwin_fp_status;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct __darwin_mmst_reg {
  pub __mmst_reg: [libc::c_char; 10usize],
  pub __mmst_rsrv: [libc::c_char; 6usize],
}
#[test]
fn bindgen_test_layout___darwin_mmst_reg() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_mmst_reg>(),
    16usize,
    concat!("Size of: ", stringify!(__darwin_mmst_reg))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_mmst_reg>(),
    1usize,
    concat!("Alignment of ", stringify!(__darwin_mmst_reg))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_mmst_reg>())).__mmst_reg as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_mmst_reg),
      "::",
      stringify!(__mmst_reg)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_mmst_reg>())).__mmst_rsrv as *const _ as usize },
    10usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_mmst_reg),
      "::",
      stringify!(__mmst_rsrv)
    )
  );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct __darwin_xmm_reg {
  pub __xmm_reg: [libc::c_char; 16usize],
}
#[test]
fn bindgen_test_layout___darwin_xmm_reg() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_xmm_reg>(),
    16usize,
    concat!("Size of: ", stringify!(__darwin_xmm_reg))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_xmm_reg>(),
    1usize,
    concat!("Alignment of ", stringify!(__darwin_xmm_reg))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_xmm_reg>())).__xmm_reg as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_xmm_reg),
      "::",
      stringify!(__xmm_reg)
    )
  );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct __darwin_ymm_reg {
  pub __ymm_reg: [libc::c_char; 32usize],
}
#[test]
fn bindgen_test_layout___darwin_ymm_reg() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_ymm_reg>(),
    32usize,
    concat!("Size of: ", stringify!(__darwin_ymm_reg))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_ymm_reg>(),
    1usize,
    concat!("Alignment of ", stringify!(__darwin_ymm_reg))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_ymm_reg>())).__ymm_reg as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_ymm_reg),
      "::",
      stringify!(__ymm_reg)
    )
  );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __darwin_zmm_reg {
  pub __zmm_reg: [libc::c_char; 64usize],
}
#[test]
fn bindgen_test_layout___darwin_zmm_reg() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_zmm_reg>(),
    64usize,
    concat!("Size of: ", stringify!(__darwin_zmm_reg))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_zmm_reg>(),
    1usize,
    concat!("Alignment of ", stringify!(__darwin_zmm_reg))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_zmm_reg>())).__zmm_reg as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_zmm_reg),
      "::",
      stringify!(__zmm_reg)
    )
  );
}
impl Default for __darwin_zmm_reg {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
impl ::core::fmt::Debug for __darwin_zmm_reg {
  fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
    write!(f, "__darwin_zmm_reg {{ __zmm_reg: [...] }}")
  }
}
impl ::core::cmp::PartialEq for __darwin_zmm_reg {
  fn eq(&self, other: &__darwin_zmm_reg) -> bool {
    &self.__zmm_reg[..] == &other.__zmm_reg[..]
  }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct __darwin_opmask_reg {
  pub __opmask_reg: [libc::c_char; 8usize],
}
#[test]
fn bindgen_test_layout___darwin_opmask_reg() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_opmask_reg>(),
    8usize,
    concat!("Size of: ", stringify!(__darwin_opmask_reg))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_opmask_reg>(),
    1usize,
    concat!("Alignment of ", stringify!(__darwin_opmask_reg))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_opmask_reg>())).__opmask_reg as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_opmask_reg),
      "::",
      stringify!(__opmask_reg)
    )
  );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __darwin_i386_float_state {
  pub __fpu_reserved: [libc::c_int; 2usize],
  pub __fpu_fcw: __darwin_fp_control,
  pub __fpu_fsw: __darwin_fp_status,
  pub __fpu_ftw: __uint8_t,
  pub __fpu_rsrv1: __uint8_t,
  pub __fpu_fop: __uint16_t,
  pub __fpu_ip: __uint32_t,
  pub __fpu_cs: __uint16_t,
  pub __fpu_rsrv2: __uint16_t,
  pub __fpu_dp: __uint32_t,
  pub __fpu_ds: __uint16_t,
  pub __fpu_rsrv3: __uint16_t,
  pub __fpu_mxcsr: __uint32_t,
  pub __fpu_mxcsrmask: __uint32_t,
  pub __fpu_stmm0: __darwin_mmst_reg,
  pub __fpu_stmm1: __darwin_mmst_reg,
  pub __fpu_stmm2: __darwin_mmst_reg,
  pub __fpu_stmm3: __darwin_mmst_reg,
  pub __fpu_stmm4: __darwin_mmst_reg,
  pub __fpu_stmm5: __darwin_mmst_reg,
  pub __fpu_stmm6: __darwin_mmst_reg,
  pub __fpu_stmm7: __darwin_mmst_reg,
  pub __fpu_xmm0: __darwin_xmm_reg,
  pub __fpu_xmm1: __darwin_xmm_reg,
  pub __fpu_xmm2: __darwin_xmm_reg,
  pub __fpu_xmm3: __darwin_xmm_reg,
  pub __fpu_xmm4: __darwin_xmm_reg,
  pub __fpu_xmm5: __darwin_xmm_reg,
  pub __fpu_xmm6: __darwin_xmm_reg,
  pub __fpu_xmm7: __darwin_xmm_reg,
  pub __fpu_rsrv4: [libc::c_char; 224usize],
  pub __fpu_reserved1: libc::c_int,
}
#[test]
fn bindgen_test_layout___darwin_i386_float_state() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_i386_float_state>(),
    524usize,
    concat!("Size of: ", stringify!(__darwin_i386_float_state))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_i386_float_state>(),
    4usize,
    concat!("Alignment of ", stringify!(__darwin_i386_float_state))
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_reserved as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_reserved)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_fcw as *const _ as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_fcw)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_fsw as *const _ as usize
    },
    10usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_fsw)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_ftw as *const _ as usize
    },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_ftw)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_rsrv1 as *const _ as usize
    },
    13usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_rsrv1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_fop as *const _ as usize
    },
    14usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_fop)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_ip as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_ip)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_cs as *const _ as usize },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_cs)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_rsrv2 as *const _ as usize
    },
    22usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_rsrv2)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_dp as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_dp)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_ds as *const _ as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_ds)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_rsrv3 as *const _ as usize
    },
    30usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_rsrv3)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_mxcsr as *const _ as usize
    },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_mxcsr)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_mxcsrmask as *const _ as usize
    },
    36usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_mxcsrmask)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_stmm0 as *const _ as usize
    },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_stmm0)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_stmm1 as *const _ as usize
    },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_stmm1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_stmm2 as *const _ as usize
    },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_stmm2)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_stmm3 as *const _ as usize
    },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_stmm3)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_stmm4 as *const _ as usize
    },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_stmm4)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_stmm5 as *const _ as usize
    },
    120usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_stmm5)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_stmm6 as *const _ as usize
    },
    136usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_stmm6)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_stmm7 as *const _ as usize
    },
    152usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_stmm7)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_xmm0 as *const _ as usize
    },
    168usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_xmm0)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_xmm1 as *const _ as usize
    },
    184usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_xmm1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_xmm2 as *const _ as usize
    },
    200usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_xmm2)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_xmm3 as *const _ as usize
    },
    216usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_xmm3)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_xmm4 as *const _ as usize
    },
    232usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_xmm4)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_xmm5 as *const _ as usize
    },
    248usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_xmm5)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_xmm6 as *const _ as usize
    },
    264usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_xmm6)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_xmm7 as *const _ as usize
    },
    280usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_xmm7)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_rsrv4 as *const _ as usize
    },
    296usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_rsrv4)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_float_state>())).__fpu_reserved1 as *const _ as usize
    },
    520usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_float_state),
      "::",
      stringify!(__fpu_reserved1)
    )
  );
}
impl Default for __darwin_i386_float_state {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
impl ::core::fmt::Debug for __darwin_i386_float_state {
  fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
    write ! ( f , "__darwin_i386_float_state {{ __fpu_reserved: {:?}, __fpu_fcw: {:?}, __fpu_fsw: {:?}, __fpu_ftw: {:?}, __fpu_rsrv1: {:?}, __fpu_fop: {:?}, __fpu_ip: {:?}, __fpu_cs: {:?}, __fpu_rsrv2: {:?}, __fpu_dp: {:?}, __fpu_ds: {:?}, __fpu_rsrv3: {:?}, __fpu_mxcsr: {:?}, __fpu_mxcsrmask: {:?}, __fpu_stmm0: {:?}, __fpu_stmm1: {:?}, __fpu_stmm2: {:?}, __fpu_stmm3: {:?}, __fpu_stmm4: {:?}, __fpu_stmm5: {:?}, __fpu_stmm6: {:?}, __fpu_stmm7: {:?}, __fpu_xmm0: {:?}, __fpu_xmm1: {:?}, __fpu_xmm2: {:?}, __fpu_xmm3: {:?}, __fpu_xmm4: {:?}, __fpu_xmm5: {:?}, __fpu_xmm6: {:?}, __fpu_xmm7: {:?}, __fpu_rsrv4: [...], __fpu_reserved1: {:?} }}" , self . __fpu_reserved , self . __fpu_fcw , self . __fpu_fsw , self . __fpu_ftw , self . __fpu_rsrv1 , self . __fpu_fop , self . __fpu_ip , self . __fpu_cs , self . __fpu_rsrv2 , self . __fpu_dp , self . __fpu_ds , self . __fpu_rsrv3 , self . __fpu_mxcsr , self . __fpu_mxcsrmask , self . __fpu_stmm0 , self . __fpu_stmm1 , self . __fpu_stmm2 , self . __fpu_stmm3 , self . __fpu_stmm4 , self . __fpu_stmm5 , self . __fpu_stmm6 , self . __fpu_stmm7 , self . __fpu_xmm0 , self . __fpu_xmm1 , self . __fpu_xmm2 , self . __fpu_xmm3 , self . __fpu_xmm4 , self . __fpu_xmm5 , self . __fpu_xmm6 , self . __fpu_xmm7 , self . __fpu_reserved1 )
  }
}
impl ::core::cmp::PartialEq for __darwin_i386_float_state {
  fn eq(&self, other: &__darwin_i386_float_state) -> bool {
    self.__fpu_reserved == other.__fpu_reserved
      && self.__fpu_fcw == other.__fpu_fcw
      && self.__fpu_fsw == other.__fpu_fsw
      && self.__fpu_ftw == other.__fpu_ftw
      && self.__fpu_rsrv1 == other.__fpu_rsrv1
      && self.__fpu_fop == other.__fpu_fop
      && self.__fpu_ip == other.__fpu_ip
      && self.__fpu_cs == other.__fpu_cs
      && self.__fpu_rsrv2 == other.__fpu_rsrv2
      && self.__fpu_dp == other.__fpu_dp
      && self.__fpu_ds == other.__fpu_ds
      && self.__fpu_rsrv3 == other.__fpu_rsrv3
      && self.__fpu_mxcsr == other.__fpu_mxcsr
      && self.__fpu_mxcsrmask == other.__fpu_mxcsrmask
      && self.__fpu_stmm0 == other.__fpu_stmm0
      && self.__fpu_stmm1 == other.__fpu_stmm1
      && self.__fpu_stmm2 == other.__fpu_stmm2
      && self.__fpu_stmm3 == other.__fpu_stmm3
      && self.__fpu_stmm4 == other.__fpu_stmm4
      && self.__fpu_stmm5 == other.__fpu_stmm5
      && self.__fpu_stmm6 == other.__fpu_stmm6
      && self.__fpu_stmm7 == other.__fpu_stmm7
      && self.__fpu_xmm0 == other.__fpu_xmm0
      && self.__fpu_xmm1 == other.__fpu_xmm1
      && self.__fpu_xmm2 == other.__fpu_xmm2
      && self.__fpu_xmm3 == other.__fpu_xmm3
      && self.__fpu_xmm4 == other.__fpu_xmm4
      && self.__fpu_xmm5 == other.__fpu_xmm5
      && self.__fpu_xmm6 == other.__fpu_xmm6
      && self.__fpu_xmm7 == other.__fpu_xmm7
      && &self.__fpu_rsrv4[..] == &other.__fpu_rsrv4[..]
      && self.__fpu_reserved1 == other.__fpu_reserved1
  }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __darwin_i386_avx_state {
  pub __fpu_reserved: [libc::c_int; 2usize],
  pub __fpu_fcw: __darwin_fp_control,
  pub __fpu_fsw: __darwin_fp_status,
  pub __fpu_ftw: __uint8_t,
  pub __fpu_rsrv1: __uint8_t,
  pub __fpu_fop: __uint16_t,
  pub __fpu_ip: __uint32_t,
  pub __fpu_cs: __uint16_t,
  pub __fpu_rsrv2: __uint16_t,
  pub __fpu_dp: __uint32_t,
  pub __fpu_ds: __uint16_t,
  pub __fpu_rsrv3: __uint16_t,
  pub __fpu_mxcsr: __uint32_t,
  pub __fpu_mxcsrmask: __uint32_t,
  pub __fpu_stmm0: __darwin_mmst_reg,
  pub __fpu_stmm1: __darwin_mmst_reg,
  pub __fpu_stmm2: __darwin_mmst_reg,
  pub __fpu_stmm3: __darwin_mmst_reg,
  pub __fpu_stmm4: __darwin_mmst_reg,
  pub __fpu_stmm5: __darwin_mmst_reg,
  pub __fpu_stmm6: __darwin_mmst_reg,
  pub __fpu_stmm7: __darwin_mmst_reg,
  pub __fpu_xmm0: __darwin_xmm_reg,
  pub __fpu_xmm1: __darwin_xmm_reg,
  pub __fpu_xmm2: __darwin_xmm_reg,
  pub __fpu_xmm3: __darwin_xmm_reg,
  pub __fpu_xmm4: __darwin_xmm_reg,
  pub __fpu_xmm5: __darwin_xmm_reg,
  pub __fpu_xmm6: __darwin_xmm_reg,
  pub __fpu_xmm7: __darwin_xmm_reg,
  pub __fpu_rsrv4: [libc::c_char; 224usize],
  pub __fpu_reserved1: libc::c_int,
  pub __avx_reserved1: [libc::c_char; 64usize],
  pub __fpu_ymmh0: __darwin_xmm_reg,
  pub __fpu_ymmh1: __darwin_xmm_reg,
  pub __fpu_ymmh2: __darwin_xmm_reg,
  pub __fpu_ymmh3: __darwin_xmm_reg,
  pub __fpu_ymmh4: __darwin_xmm_reg,
  pub __fpu_ymmh5: __darwin_xmm_reg,
  pub __fpu_ymmh6: __darwin_xmm_reg,
  pub __fpu_ymmh7: __darwin_xmm_reg,
}
#[test]
fn bindgen_test_layout___darwin_i386_avx_state() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_i386_avx_state>(),
    716usize,
    concat!("Size of: ", stringify!(__darwin_i386_avx_state))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_i386_avx_state>(),
    4usize,
    concat!("Alignment of ", stringify!(__darwin_i386_avx_state))
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_reserved as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_reserved)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_fcw as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_fcw)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_fsw as *const _ as usize },
    10usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_fsw)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_ftw as *const _ as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_ftw)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_rsrv1 as *const _ as usize
    },
    13usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_rsrv1)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_fop as *const _ as usize },
    14usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_fop)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_ip as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_ip)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_cs as *const _ as usize },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_cs)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_rsrv2 as *const _ as usize
    },
    22usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_rsrv2)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_dp as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_dp)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_ds as *const _ as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_ds)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_rsrv3 as *const _ as usize
    },
    30usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_rsrv3)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_mxcsr as *const _ as usize
    },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_mxcsr)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_mxcsrmask as *const _ as usize
    },
    36usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_mxcsrmask)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_stmm0 as *const _ as usize
    },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_stmm0)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_stmm1 as *const _ as usize
    },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_stmm1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_stmm2 as *const _ as usize
    },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_stmm2)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_stmm3 as *const _ as usize
    },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_stmm3)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_stmm4 as *const _ as usize
    },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_stmm4)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_stmm5 as *const _ as usize
    },
    120usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_stmm5)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_stmm6 as *const _ as usize
    },
    136usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_stmm6)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_stmm7 as *const _ as usize
    },
    152usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_stmm7)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_xmm0 as *const _ as usize },
    168usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_xmm0)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_xmm1 as *const _ as usize },
    184usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_xmm1)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_xmm2 as *const _ as usize },
    200usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_xmm2)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_xmm3 as *const _ as usize },
    216usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_xmm3)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_xmm4 as *const _ as usize },
    232usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_xmm4)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_xmm5 as *const _ as usize },
    248usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_xmm5)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_xmm6 as *const _ as usize },
    264usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_xmm6)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_xmm7 as *const _ as usize },
    280usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_xmm7)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_rsrv4 as *const _ as usize
    },
    296usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_rsrv4)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_reserved1 as *const _ as usize
    },
    520usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_reserved1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__avx_reserved1 as *const _ as usize
    },
    524usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__avx_reserved1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_ymmh0 as *const _ as usize
    },
    588usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_ymmh0)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_ymmh1 as *const _ as usize
    },
    604usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_ymmh1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_ymmh2 as *const _ as usize
    },
    620usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_ymmh2)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_ymmh3 as *const _ as usize
    },
    636usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_ymmh3)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_ymmh4 as *const _ as usize
    },
    652usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_ymmh4)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_ymmh5 as *const _ as usize
    },
    668usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_ymmh5)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_ymmh6 as *const _ as usize
    },
    684usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_ymmh6)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx_state>())).__fpu_ymmh7 as *const _ as usize
    },
    700usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx_state),
      "::",
      stringify!(__fpu_ymmh7)
    )
  );
}
impl Default for __darwin_i386_avx_state {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
impl ::core::fmt::Debug for __darwin_i386_avx_state {
  fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
    write ! ( f , "__darwin_i386_avx_state {{ __fpu_reserved: {:?}, __fpu_fcw: {:?}, __fpu_fsw: {:?}, __fpu_ftw: {:?}, __fpu_rsrv1: {:?}, __fpu_fop: {:?}, __fpu_ip: {:?}, __fpu_cs: {:?}, __fpu_rsrv2: {:?}, __fpu_dp: {:?}, __fpu_ds: {:?}, __fpu_rsrv3: {:?}, __fpu_mxcsr: {:?}, __fpu_mxcsrmask: {:?}, __fpu_stmm0: {:?}, __fpu_stmm1: {:?}, __fpu_stmm2: {:?}, __fpu_stmm3: {:?}, __fpu_stmm4: {:?}, __fpu_stmm5: {:?}, __fpu_stmm6: {:?}, __fpu_stmm7: {:?}, __fpu_xmm0: {:?}, __fpu_xmm1: {:?}, __fpu_xmm2: {:?}, __fpu_xmm3: {:?}, __fpu_xmm4: {:?}, __fpu_xmm5: {:?}, __fpu_xmm6: {:?}, __fpu_xmm7: {:?}, __fpu_rsrv4: [...], __fpu_reserved1: {:?}, __avx_reserved1: [...], __fpu_ymmh0: {:?}, __fpu_ymmh1: {:?}, __fpu_ymmh2: {:?}, __fpu_ymmh3: {:?}, __fpu_ymmh4: {:?}, __fpu_ymmh5: {:?}, __fpu_ymmh6: {:?}, __fpu_ymmh7: {:?} }}" , self . __fpu_reserved , self . __fpu_fcw , self . __fpu_fsw , self . __fpu_ftw , self . __fpu_rsrv1 , self . __fpu_fop , self . __fpu_ip , self . __fpu_cs , self . __fpu_rsrv2 , self . __fpu_dp , self . __fpu_ds , self . __fpu_rsrv3 , self . __fpu_mxcsr , self . __fpu_mxcsrmask , self . __fpu_stmm0 , self . __fpu_stmm1 , self . __fpu_stmm2 , self . __fpu_stmm3 , self . __fpu_stmm4 , self . __fpu_stmm5 , self . __fpu_stmm6 , self . __fpu_stmm7 , self . __fpu_xmm0 , self . __fpu_xmm1 , self . __fpu_xmm2 , self . __fpu_xmm3 , self . __fpu_xmm4 , self . __fpu_xmm5 , self . __fpu_xmm6 , self . __fpu_xmm7 , self . __fpu_reserved1 , self . __fpu_ymmh0 , self . __fpu_ymmh1 , self . __fpu_ymmh2 , self . __fpu_ymmh3 , self . __fpu_ymmh4 , self . __fpu_ymmh5 , self . __fpu_ymmh6 , self . __fpu_ymmh7 )
  }
}
impl ::core::cmp::PartialEq for __darwin_i386_avx_state {
  fn eq(&self, other: &__darwin_i386_avx_state) -> bool {
    self.__fpu_reserved == other.__fpu_reserved
      && self.__fpu_fcw == other.__fpu_fcw
      && self.__fpu_fsw == other.__fpu_fsw
      && self.__fpu_ftw == other.__fpu_ftw
      && self.__fpu_rsrv1 == other.__fpu_rsrv1
      && self.__fpu_fop == other.__fpu_fop
      && self.__fpu_ip == other.__fpu_ip
      && self.__fpu_cs == other.__fpu_cs
      && self.__fpu_rsrv2 == other.__fpu_rsrv2
      && self.__fpu_dp == other.__fpu_dp
      && self.__fpu_ds == other.__fpu_ds
      && self.__fpu_rsrv3 == other.__fpu_rsrv3
      && self.__fpu_mxcsr == other.__fpu_mxcsr
      && self.__fpu_mxcsrmask == other.__fpu_mxcsrmask
      && self.__fpu_stmm0 == other.__fpu_stmm0
      && self.__fpu_stmm1 == other.__fpu_stmm1
      && self.__fpu_stmm2 == other.__fpu_stmm2
      && self.__fpu_stmm3 == other.__fpu_stmm3
      && self.__fpu_stmm4 == other.__fpu_stmm4
      && self.__fpu_stmm5 == other.__fpu_stmm5
      && self.__fpu_stmm6 == other.__fpu_stmm6
      && self.__fpu_stmm7 == other.__fpu_stmm7
      && self.__fpu_xmm0 == other.__fpu_xmm0
      && self.__fpu_xmm1 == other.__fpu_xmm1
      && self.__fpu_xmm2 == other.__fpu_xmm2
      && self.__fpu_xmm3 == other.__fpu_xmm3
      && self.__fpu_xmm4 == other.__fpu_xmm4
      && self.__fpu_xmm5 == other.__fpu_xmm5
      && self.__fpu_xmm6 == other.__fpu_xmm6
      && self.__fpu_xmm7 == other.__fpu_xmm7
      && &self.__fpu_rsrv4[..] == &other.__fpu_rsrv4[..]
      && self.__fpu_reserved1 == other.__fpu_reserved1
      && &self.__avx_reserved1[..] == &other.__avx_reserved1[..]
      && self.__fpu_ymmh0 == other.__fpu_ymmh0
      && self.__fpu_ymmh1 == other.__fpu_ymmh1
      && self.__fpu_ymmh2 == other.__fpu_ymmh2
      && self.__fpu_ymmh3 == other.__fpu_ymmh3
      && self.__fpu_ymmh4 == other.__fpu_ymmh4
      && self.__fpu_ymmh5 == other.__fpu_ymmh5
      && self.__fpu_ymmh6 == other.__fpu_ymmh6
      && self.__fpu_ymmh7 == other.__fpu_ymmh7
  }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __darwin_i386_avx512_state {
  pub __fpu_reserved: [libc::c_int; 2usize],
  pub __fpu_fcw: __darwin_fp_control,
  pub __fpu_fsw: __darwin_fp_status,
  pub __fpu_ftw: __uint8_t,
  pub __fpu_rsrv1: __uint8_t,
  pub __fpu_fop: __uint16_t,
  pub __fpu_ip: __uint32_t,
  pub __fpu_cs: __uint16_t,
  pub __fpu_rsrv2: __uint16_t,
  pub __fpu_dp: __uint32_t,
  pub __fpu_ds: __uint16_t,
  pub __fpu_rsrv3: __uint16_t,
  pub __fpu_mxcsr: __uint32_t,
  pub __fpu_mxcsrmask: __uint32_t,
  pub __fpu_stmm0: __darwin_mmst_reg,
  pub __fpu_stmm1: __darwin_mmst_reg,
  pub __fpu_stmm2: __darwin_mmst_reg,
  pub __fpu_stmm3: __darwin_mmst_reg,
  pub __fpu_stmm4: __darwin_mmst_reg,
  pub __fpu_stmm5: __darwin_mmst_reg,
  pub __fpu_stmm6: __darwin_mmst_reg,
  pub __fpu_stmm7: __darwin_mmst_reg,
  pub __fpu_xmm0: __darwin_xmm_reg,
  pub __fpu_xmm1: __darwin_xmm_reg,
  pub __fpu_xmm2: __darwin_xmm_reg,
  pub __fpu_xmm3: __darwin_xmm_reg,
  pub __fpu_xmm4: __darwin_xmm_reg,
  pub __fpu_xmm5: __darwin_xmm_reg,
  pub __fpu_xmm6: __darwin_xmm_reg,
  pub __fpu_xmm7: __darwin_xmm_reg,
  pub __fpu_rsrv4: [libc::c_char; 224usize],
  pub __fpu_reserved1: libc::c_int,
  pub __avx_reserved1: [libc::c_char; 64usize],
  pub __fpu_ymmh0: __darwin_xmm_reg,
  pub __fpu_ymmh1: __darwin_xmm_reg,
  pub __fpu_ymmh2: __darwin_xmm_reg,
  pub __fpu_ymmh3: __darwin_xmm_reg,
  pub __fpu_ymmh4: __darwin_xmm_reg,
  pub __fpu_ymmh5: __darwin_xmm_reg,
  pub __fpu_ymmh6: __darwin_xmm_reg,
  pub __fpu_ymmh7: __darwin_xmm_reg,
  pub __fpu_k0: __darwin_opmask_reg,
  pub __fpu_k1: __darwin_opmask_reg,
  pub __fpu_k2: __darwin_opmask_reg,
  pub __fpu_k3: __darwin_opmask_reg,
  pub __fpu_k4: __darwin_opmask_reg,
  pub __fpu_k5: __darwin_opmask_reg,
  pub __fpu_k6: __darwin_opmask_reg,
  pub __fpu_k7: __darwin_opmask_reg,
  pub __fpu_zmmh0: __darwin_ymm_reg,
  pub __fpu_zmmh1: __darwin_ymm_reg,
  pub __fpu_zmmh2: __darwin_ymm_reg,
  pub __fpu_zmmh3: __darwin_ymm_reg,
  pub __fpu_zmmh4: __darwin_ymm_reg,
  pub __fpu_zmmh5: __darwin_ymm_reg,
  pub __fpu_zmmh6: __darwin_ymm_reg,
  pub __fpu_zmmh7: __darwin_ymm_reg,
}
#[test]
fn bindgen_test_layout___darwin_i386_avx512_state() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_i386_avx512_state>(),
    1036usize,
    concat!("Size of: ", stringify!(__darwin_i386_avx512_state))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_i386_avx512_state>(),
    4usize,
    concat!("Alignment of ", stringify!(__darwin_i386_avx512_state))
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_reserved as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_reserved)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_fcw as *const _ as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_fcw)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_fsw as *const _ as usize
    },
    10usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_fsw)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_ftw as *const _ as usize
    },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_ftw)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_rsrv1 as *const _ as usize
    },
    13usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_rsrv1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_fop as *const _ as usize
    },
    14usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_fop)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_ip as *const _ as usize
    },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_ip)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_cs as *const _ as usize
    },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_cs)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_rsrv2 as *const _ as usize
    },
    22usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_rsrv2)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_dp as *const _ as usize
    },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_dp)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_ds as *const _ as usize
    },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_ds)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_rsrv3 as *const _ as usize
    },
    30usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_rsrv3)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_mxcsr as *const _ as usize
    },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_mxcsr)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_mxcsrmask as *const _ as usize
    },
    36usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_mxcsrmask)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_stmm0 as *const _ as usize
    },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_stmm0)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_stmm1 as *const _ as usize
    },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_stmm1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_stmm2 as *const _ as usize
    },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_stmm2)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_stmm3 as *const _ as usize
    },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_stmm3)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_stmm4 as *const _ as usize
    },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_stmm4)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_stmm5 as *const _ as usize
    },
    120usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_stmm5)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_stmm6 as *const _ as usize
    },
    136usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_stmm6)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_stmm7 as *const _ as usize
    },
    152usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_stmm7)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_xmm0 as *const _ as usize
    },
    168usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_xmm0)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_xmm1 as *const _ as usize
    },
    184usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_xmm1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_xmm2 as *const _ as usize
    },
    200usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_xmm2)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_xmm3 as *const _ as usize
    },
    216usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_xmm3)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_xmm4 as *const _ as usize
    },
    232usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_xmm4)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_xmm5 as *const _ as usize
    },
    248usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_xmm5)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_xmm6 as *const _ as usize
    },
    264usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_xmm6)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_xmm7 as *const _ as usize
    },
    280usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_xmm7)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_rsrv4 as *const _ as usize
    },
    296usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_rsrv4)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_reserved1 as *const _ as usize
    },
    520usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_reserved1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__avx_reserved1 as *const _ as usize
    },
    524usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__avx_reserved1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_ymmh0 as *const _ as usize
    },
    588usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_ymmh0)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_ymmh1 as *const _ as usize
    },
    604usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_ymmh1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_ymmh2 as *const _ as usize
    },
    620usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_ymmh2)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_ymmh3 as *const _ as usize
    },
    636usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_ymmh3)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_ymmh4 as *const _ as usize
    },
    652usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_ymmh4)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_ymmh5 as *const _ as usize
    },
    668usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_ymmh5)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_ymmh6 as *const _ as usize
    },
    684usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_ymmh6)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_ymmh7 as *const _ as usize
    },
    700usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_ymmh7)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_k0 as *const _ as usize
    },
    716usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_k0)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_k1 as *const _ as usize
    },
    724usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_k1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_k2 as *const _ as usize
    },
    732usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_k2)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_k3 as *const _ as usize
    },
    740usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_k3)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_k4 as *const _ as usize
    },
    748usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_k4)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_k5 as *const _ as usize
    },
    756usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_k5)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_k6 as *const _ as usize
    },
    764usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_k6)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_k7 as *const _ as usize
    },
    772usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_k7)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_zmmh0 as *const _ as usize
    },
    780usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_zmmh0)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_zmmh1 as *const _ as usize
    },
    812usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_zmmh1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_zmmh2 as *const _ as usize
    },
    844usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_zmmh2)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_zmmh3 as *const _ as usize
    },
    876usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_zmmh3)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_zmmh4 as *const _ as usize
    },
    908usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_zmmh4)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_zmmh5 as *const _ as usize
    },
    940usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_zmmh5)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_zmmh6 as *const _ as usize
    },
    972usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_zmmh6)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_avx512_state>())).__fpu_zmmh7 as *const _ as usize
    },
    1004usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_avx512_state),
      "::",
      stringify!(__fpu_zmmh7)
    )
  );
}
impl Default for __darwin_i386_avx512_state {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
impl ::core::fmt::Debug for __darwin_i386_avx512_state {
  fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
    write ! ( f , "__darwin_i386_avx512_state {{ __fpu_reserved: {:?}, __fpu_fcw: {:?}, __fpu_fsw: {:?}, __fpu_ftw: {:?}, __fpu_rsrv1: {:?}, __fpu_fop: {:?}, __fpu_ip: {:?}, __fpu_cs: {:?}, __fpu_rsrv2: {:?}, __fpu_dp: {:?}, __fpu_ds: {:?}, __fpu_rsrv3: {:?}, __fpu_mxcsr: {:?}, __fpu_mxcsrmask: {:?}, __fpu_stmm0: {:?}, __fpu_stmm1: {:?}, __fpu_stmm2: {:?}, __fpu_stmm3: {:?}, __fpu_stmm4: {:?}, __fpu_stmm5: {:?}, __fpu_stmm6: {:?}, __fpu_stmm7: {:?}, __fpu_xmm0: {:?}, __fpu_xmm1: {:?}, __fpu_xmm2: {:?}, __fpu_xmm3: {:?}, __fpu_xmm4: {:?}, __fpu_xmm5: {:?}, __fpu_xmm6: {:?}, __fpu_xmm7: {:?}, __fpu_rsrv4: [...], __fpu_reserved1: {:?}, __avx_reserved1: [...], __fpu_ymmh0: {:?}, __fpu_ymmh1: {:?}, __fpu_ymmh2: {:?}, __fpu_ymmh3: {:?}, __fpu_ymmh4: {:?}, __fpu_ymmh5: {:?}, __fpu_ymmh6: {:?}, __fpu_ymmh7: {:?}, __fpu_k0: {:?}, __fpu_k1: {:?}, __fpu_k2: {:?}, __fpu_k3: {:?}, __fpu_k4: {:?}, __fpu_k5: {:?}, __fpu_k6: {:?}, __fpu_k7: {:?}, __fpu_zmmh0: {:?}, __fpu_zmmh1: {:?}, __fpu_zmmh2: {:?}, __fpu_zmmh3: {:?}, __fpu_zmmh4: {:?}, __fpu_zmmh5: {:?}, __fpu_zmmh6: {:?}, __fpu_zmmh7: {:?} }}" , self . __fpu_reserved , self . __fpu_fcw , self . __fpu_fsw , self . __fpu_ftw , self . __fpu_rsrv1 , self . __fpu_fop , self . __fpu_ip , self . __fpu_cs , self . __fpu_rsrv2 , self . __fpu_dp , self . __fpu_ds , self . __fpu_rsrv3 , self . __fpu_mxcsr , self . __fpu_mxcsrmask , self . __fpu_stmm0 , self . __fpu_stmm1 , self . __fpu_stmm2 , self . __fpu_stmm3 , self . __fpu_stmm4 , self . __fpu_stmm5 , self . __fpu_stmm6 , self . __fpu_stmm7 , self . __fpu_xmm0 , self . __fpu_xmm1 , self . __fpu_xmm2 , self . __fpu_xmm3 , self . __fpu_xmm4 , self . __fpu_xmm5 , self . __fpu_xmm6 , self . __fpu_xmm7 , self . __fpu_reserved1 , self . __fpu_ymmh0 , self . __fpu_ymmh1 , self . __fpu_ymmh2 , self . __fpu_ymmh3 , self . __fpu_ymmh4 , self . __fpu_ymmh5 , self . __fpu_ymmh6 , self . __fpu_ymmh7 , self . __fpu_k0 , self . __fpu_k1 , self . __fpu_k2 , self . __fpu_k3 , self . __fpu_k4 , self . __fpu_k5 , self . __fpu_k6 , self . __fpu_k7 , self . __fpu_zmmh0 , self . __fpu_zmmh1 , self . __fpu_zmmh2 , self . __fpu_zmmh3 , self . __fpu_zmmh4 , self . __fpu_zmmh5 , self . __fpu_zmmh6 , self . __fpu_zmmh7 )
  }
}
impl ::core::cmp::PartialEq for __darwin_i386_avx512_state {
  fn eq(&self, other: &__darwin_i386_avx512_state) -> bool {
    self.__fpu_reserved == other.__fpu_reserved
      && self.__fpu_fcw == other.__fpu_fcw
      && self.__fpu_fsw == other.__fpu_fsw
      && self.__fpu_ftw == other.__fpu_ftw
      && self.__fpu_rsrv1 == other.__fpu_rsrv1
      && self.__fpu_fop == other.__fpu_fop
      && self.__fpu_ip == other.__fpu_ip
      && self.__fpu_cs == other.__fpu_cs
      && self.__fpu_rsrv2 == other.__fpu_rsrv2
      && self.__fpu_dp == other.__fpu_dp
      && self.__fpu_ds == other.__fpu_ds
      && self.__fpu_rsrv3 == other.__fpu_rsrv3
      && self.__fpu_mxcsr == other.__fpu_mxcsr
      && self.__fpu_mxcsrmask == other.__fpu_mxcsrmask
      && self.__fpu_stmm0 == other.__fpu_stmm0
      && self.__fpu_stmm1 == other.__fpu_stmm1
      && self.__fpu_stmm2 == other.__fpu_stmm2
      && self.__fpu_stmm3 == other.__fpu_stmm3
      && self.__fpu_stmm4 == other.__fpu_stmm4
      && self.__fpu_stmm5 == other.__fpu_stmm5
      && self.__fpu_stmm6 == other.__fpu_stmm6
      && self.__fpu_stmm7 == other.__fpu_stmm7
      && self.__fpu_xmm0 == other.__fpu_xmm0
      && self.__fpu_xmm1 == other.__fpu_xmm1
      && self.__fpu_xmm2 == other.__fpu_xmm2
      && self.__fpu_xmm3 == other.__fpu_xmm3
      && self.__fpu_xmm4 == other.__fpu_xmm4
      && self.__fpu_xmm5 == other.__fpu_xmm5
      && self.__fpu_xmm6 == other.__fpu_xmm6
      && self.__fpu_xmm7 == other.__fpu_xmm7
      && &self.__fpu_rsrv4[..] == &other.__fpu_rsrv4[..]
      && self.__fpu_reserved1 == other.__fpu_reserved1
      && &self.__avx_reserved1[..] == &other.__avx_reserved1[..]
      && self.__fpu_ymmh0 == other.__fpu_ymmh0
      && self.__fpu_ymmh1 == other.__fpu_ymmh1
      && self.__fpu_ymmh2 == other.__fpu_ymmh2
      && self.__fpu_ymmh3 == other.__fpu_ymmh3
      && self.__fpu_ymmh4 == other.__fpu_ymmh4
      && self.__fpu_ymmh5 == other.__fpu_ymmh5
      && self.__fpu_ymmh6 == other.__fpu_ymmh6
      && self.__fpu_ymmh7 == other.__fpu_ymmh7
      && self.__fpu_k0 == other.__fpu_k0
      && self.__fpu_k1 == other.__fpu_k1
      && self.__fpu_k2 == other.__fpu_k2
      && self.__fpu_k3 == other.__fpu_k3
      && self.__fpu_k4 == other.__fpu_k4
      && self.__fpu_k5 == other.__fpu_k5
      && self.__fpu_k6 == other.__fpu_k6
      && self.__fpu_k7 == other.__fpu_k7
      && self.__fpu_zmmh0 == other.__fpu_zmmh0
      && self.__fpu_zmmh1 == other.__fpu_zmmh1
      && self.__fpu_zmmh2 == other.__fpu_zmmh2
      && self.__fpu_zmmh3 == other.__fpu_zmmh3
      && self.__fpu_zmmh4 == other.__fpu_zmmh4
      && self.__fpu_zmmh5 == other.__fpu_zmmh5
      && self.__fpu_zmmh6 == other.__fpu_zmmh6
      && self.__fpu_zmmh7 == other.__fpu_zmmh7
  }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct __darwin_i386_exception_state {
  pub __trapno: __uint16_t,
  pub __cpu: __uint16_t,
  pub __err: __uint32_t,
  pub __faultvaddr: __uint32_t,
}
#[test]
fn bindgen_test_layout___darwin_i386_exception_state() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_i386_exception_state>(),
    12usize,
    concat!("Size of: ", stringify!(__darwin_i386_exception_state))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_i386_exception_state>(),
    4usize,
    concat!("Alignment of ", stringify!(__darwin_i386_exception_state))
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_exception_state>())).__trapno as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_exception_state),
      "::",
      stringify!(__trapno)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_exception_state>())).__cpu as *const _ as usize
    },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_exception_state),
      "::",
      stringify!(__cpu)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_exception_state>())).__err as *const _ as usize
    },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_exception_state),
      "::",
      stringify!(__err)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_i386_exception_state>())).__faultvaddr as *const _ as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_i386_exception_state),
      "::",
      stringify!(__faultvaddr)
    )
  );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct __darwin_x86_debug_state32 {
  pub __dr0: libc::c_uint,
  pub __dr1: libc::c_uint,
  pub __dr2: libc::c_uint,
  pub __dr3: libc::c_uint,
  pub __dr4: libc::c_uint,
  pub __dr5: libc::c_uint,
  pub __dr6: libc::c_uint,
  pub __dr7: libc::c_uint,
}
#[test]
fn bindgen_test_layout___darwin_x86_debug_state32() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_x86_debug_state32>(),
    32usize,
    concat!("Size of: ", stringify!(__darwin_x86_debug_state32))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_x86_debug_state32>(),
    4usize,
    concat!("Alignment of ", stringify!(__darwin_x86_debug_state32))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_debug_state32>())).__dr0 as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_debug_state32),
      "::",
      stringify!(__dr0)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_debug_state32>())).__dr1 as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_debug_state32),
      "::",
      stringify!(__dr1)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_debug_state32>())).__dr2 as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_debug_state32),
      "::",
      stringify!(__dr2)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_debug_state32>())).__dr3 as *const _ as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_debug_state32),
      "::",
      stringify!(__dr3)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_debug_state32>())).__dr4 as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_debug_state32),
      "::",
      stringify!(__dr4)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_debug_state32>())).__dr5 as *const _ as usize },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_debug_state32),
      "::",
      stringify!(__dr5)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_debug_state32>())).__dr6 as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_debug_state32),
      "::",
      stringify!(__dr6)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_debug_state32>())).__dr7 as *const _ as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_debug_state32),
      "::",
      stringify!(__dr7)
    )
  );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct __darwin_x86_thread_state64 {
  pub __rax: __uint64_t,
  pub __rbx: __uint64_t,
  pub __rcx: __uint64_t,
  pub __rdx: __uint64_t,
  pub __rdi: __uint64_t,
  pub __rsi: __uint64_t,
  pub __rbp: __uint64_t,
  pub __rsp: __uint64_t,
  pub __r8: __uint64_t,
  pub __r9: __uint64_t,
  pub __r10: __uint64_t,
  pub __r11: __uint64_t,
  pub __r12: __uint64_t,
  pub __r13: __uint64_t,
  pub __r14: __uint64_t,
  pub __r15: __uint64_t,
  pub __rip: __uint64_t,
  pub __rflags: __uint64_t,
  pub __cs: __uint64_t,
  pub __fs: __uint64_t,
  pub __gs: __uint64_t,
}
#[test]
fn bindgen_test_layout___darwin_x86_thread_state64() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_x86_thread_state64>(),
    168usize,
    concat!("Size of: ", stringify!(__darwin_x86_thread_state64))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_x86_thread_state64>(),
    8usize,
    concat!("Alignment of ", stringify!(__darwin_x86_thread_state64))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_thread_state64>())).__rax as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_thread_state64),
      "::",
      stringify!(__rax)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_thread_state64>())).__rbx as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_thread_state64),
      "::",
      stringify!(__rbx)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_thread_state64>())).__rcx as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_thread_state64),
      "::",
      stringify!(__rcx)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_thread_state64>())).__rdx as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_thread_state64),
      "::",
      stringify!(__rdx)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_thread_state64>())).__rdi as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_thread_state64),
      "::",
      stringify!(__rdi)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_thread_state64>())).__rsi as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_thread_state64),
      "::",
      stringify!(__rsi)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_thread_state64>())).__rbp as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_thread_state64),
      "::",
      stringify!(__rbp)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_thread_state64>())).__rsp as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_thread_state64),
      "::",
      stringify!(__rsp)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_thread_state64>())).__r8 as *const _ as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_thread_state64),
      "::",
      stringify!(__r8)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_thread_state64>())).__r9 as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_thread_state64),
      "::",
      stringify!(__r9)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_thread_state64>())).__r10 as *const _ as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_thread_state64),
      "::",
      stringify!(__r10)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_thread_state64>())).__r11 as *const _ as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_thread_state64),
      "::",
      stringify!(__r11)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_thread_state64>())).__r12 as *const _ as usize },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_thread_state64),
      "::",
      stringify!(__r12)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_thread_state64>())).__r13 as *const _ as usize },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_thread_state64),
      "::",
      stringify!(__r13)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_thread_state64>())).__r14 as *const _ as usize },
    112usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_thread_state64),
      "::",
      stringify!(__r14)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_thread_state64>())).__r15 as *const _ as usize },
    120usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_thread_state64),
      "::",
      stringify!(__r15)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_thread_state64>())).__rip as *const _ as usize },
    128usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_thread_state64),
      "::",
      stringify!(__rip)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_thread_state64>())).__rflags as *const _ as usize
    },
    136usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_thread_state64),
      "::",
      stringify!(__rflags)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_thread_state64>())).__cs as *const _ as usize },
    144usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_thread_state64),
      "::",
      stringify!(__cs)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_thread_state64>())).__fs as *const _ as usize },
    152usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_thread_state64),
      "::",
      stringify!(__fs)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_thread_state64>())).__gs as *const _ as usize },
    160usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_thread_state64),
      "::",
      stringify!(__gs)
    )
  );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __darwin_x86_float_state64 {
  pub __fpu_reserved: [libc::c_int; 2usize],
  pub __fpu_fcw: __darwin_fp_control,
  pub __fpu_fsw: __darwin_fp_status,
  pub __fpu_ftw: __uint8_t,
  pub __fpu_rsrv1: __uint8_t,
  pub __fpu_fop: __uint16_t,
  pub __fpu_ip: __uint32_t,
  pub __fpu_cs: __uint16_t,
  pub __fpu_rsrv2: __uint16_t,
  pub __fpu_dp: __uint32_t,
  pub __fpu_ds: __uint16_t,
  pub __fpu_rsrv3: __uint16_t,
  pub __fpu_mxcsr: __uint32_t,
  pub __fpu_mxcsrmask: __uint32_t,
  pub __fpu_stmm0: __darwin_mmst_reg,
  pub __fpu_stmm1: __darwin_mmst_reg,
  pub __fpu_stmm2: __darwin_mmst_reg,
  pub __fpu_stmm3: __darwin_mmst_reg,
  pub __fpu_stmm4: __darwin_mmst_reg,
  pub __fpu_stmm5: __darwin_mmst_reg,
  pub __fpu_stmm6: __darwin_mmst_reg,
  pub __fpu_stmm7: __darwin_mmst_reg,
  pub __fpu_xmm0: __darwin_xmm_reg,
  pub __fpu_xmm1: __darwin_xmm_reg,
  pub __fpu_xmm2: __darwin_xmm_reg,
  pub __fpu_xmm3: __darwin_xmm_reg,
  pub __fpu_xmm4: __darwin_xmm_reg,
  pub __fpu_xmm5: __darwin_xmm_reg,
  pub __fpu_xmm6: __darwin_xmm_reg,
  pub __fpu_xmm7: __darwin_xmm_reg,
  pub __fpu_xmm8: __darwin_xmm_reg,
  pub __fpu_xmm9: __darwin_xmm_reg,
  pub __fpu_xmm10: __darwin_xmm_reg,
  pub __fpu_xmm11: __darwin_xmm_reg,
  pub __fpu_xmm12: __darwin_xmm_reg,
  pub __fpu_xmm13: __darwin_xmm_reg,
  pub __fpu_xmm14: __darwin_xmm_reg,
  pub __fpu_xmm15: __darwin_xmm_reg,
  pub __fpu_rsrv4: [libc::c_char; 96usize],
  pub __fpu_reserved1: libc::c_int,
}
#[test]
fn bindgen_test_layout___darwin_x86_float_state64() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_x86_float_state64>(),
    524usize,
    concat!("Size of: ", stringify!(__darwin_x86_float_state64))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_x86_float_state64>(),
    4usize,
    concat!("Alignment of ", stringify!(__darwin_x86_float_state64))
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_reserved as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_reserved)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_fcw as *const _ as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_fcw)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_fsw as *const _ as usize
    },
    10usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_fsw)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_ftw as *const _ as usize
    },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_ftw)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_rsrv1 as *const _ as usize
    },
    13usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_rsrv1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_fop as *const _ as usize
    },
    14usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_fop)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_ip as *const _ as usize
    },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_ip)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_cs as *const _ as usize
    },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_cs)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_rsrv2 as *const _ as usize
    },
    22usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_rsrv2)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_dp as *const _ as usize
    },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_dp)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_ds as *const _ as usize
    },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_ds)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_rsrv3 as *const _ as usize
    },
    30usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_rsrv3)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_mxcsr as *const _ as usize
    },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_mxcsr)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_mxcsrmask as *const _ as usize
    },
    36usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_mxcsrmask)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_stmm0 as *const _ as usize
    },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_stmm0)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_stmm1 as *const _ as usize
    },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_stmm1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_stmm2 as *const _ as usize
    },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_stmm2)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_stmm3 as *const _ as usize
    },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_stmm3)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_stmm4 as *const _ as usize
    },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_stmm4)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_stmm5 as *const _ as usize
    },
    120usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_stmm5)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_stmm6 as *const _ as usize
    },
    136usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_stmm6)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_stmm7 as *const _ as usize
    },
    152usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_stmm7)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_xmm0 as *const _ as usize
    },
    168usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_xmm0)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_xmm1 as *const _ as usize
    },
    184usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_xmm1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_xmm2 as *const _ as usize
    },
    200usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_xmm2)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_xmm3 as *const _ as usize
    },
    216usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_xmm3)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_xmm4 as *const _ as usize
    },
    232usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_xmm4)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_xmm5 as *const _ as usize
    },
    248usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_xmm5)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_xmm6 as *const _ as usize
    },
    264usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_xmm6)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_xmm7 as *const _ as usize
    },
    280usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_xmm7)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_xmm8 as *const _ as usize
    },
    296usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_xmm8)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_xmm9 as *const _ as usize
    },
    312usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_xmm9)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_xmm10 as *const _ as usize
    },
    328usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_xmm10)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_xmm11 as *const _ as usize
    },
    344usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_xmm11)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_xmm12 as *const _ as usize
    },
    360usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_xmm12)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_xmm13 as *const _ as usize
    },
    376usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_xmm13)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_xmm14 as *const _ as usize
    },
    392usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_xmm14)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_xmm15 as *const _ as usize
    },
    408usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_xmm15)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_rsrv4 as *const _ as usize
    },
    424usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_rsrv4)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_float_state64>())).__fpu_reserved1 as *const _ as usize
    },
    520usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_float_state64),
      "::",
      stringify!(__fpu_reserved1)
    )
  );
}
impl Default for __darwin_x86_float_state64 {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
impl ::core::fmt::Debug for __darwin_x86_float_state64 {
  fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
    write ! ( f , "__darwin_x86_float_state64 {{ __fpu_reserved: {:?}, __fpu_fcw: {:?}, __fpu_fsw: {:?}, __fpu_ftw: {:?}, __fpu_rsrv1: {:?}, __fpu_fop: {:?}, __fpu_ip: {:?}, __fpu_cs: {:?}, __fpu_rsrv2: {:?}, __fpu_dp: {:?}, __fpu_ds: {:?}, __fpu_rsrv3: {:?}, __fpu_mxcsr: {:?}, __fpu_mxcsrmask: {:?}, __fpu_stmm0: {:?}, __fpu_stmm1: {:?}, __fpu_stmm2: {:?}, __fpu_stmm3: {:?}, __fpu_stmm4: {:?}, __fpu_stmm5: {:?}, __fpu_stmm6: {:?}, __fpu_stmm7: {:?}, __fpu_xmm0: {:?}, __fpu_xmm1: {:?}, __fpu_xmm2: {:?}, __fpu_xmm3: {:?}, __fpu_xmm4: {:?}, __fpu_xmm5: {:?}, __fpu_xmm6: {:?}, __fpu_xmm7: {:?}, __fpu_xmm8: {:?}, __fpu_xmm9: {:?}, __fpu_xmm10: {:?}, __fpu_xmm11: {:?}, __fpu_xmm12: {:?}, __fpu_xmm13: {:?}, __fpu_xmm14: {:?}, __fpu_xmm15: {:?}, __fpu_rsrv4: [...], __fpu_reserved1: {:?} }}" , self . __fpu_reserved , self . __fpu_fcw , self . __fpu_fsw , self . __fpu_ftw , self . __fpu_rsrv1 , self . __fpu_fop , self . __fpu_ip , self . __fpu_cs , self . __fpu_rsrv2 , self . __fpu_dp , self . __fpu_ds , self . __fpu_rsrv3 , self . __fpu_mxcsr , self . __fpu_mxcsrmask , self . __fpu_stmm0 , self . __fpu_stmm1 , self . __fpu_stmm2 , self . __fpu_stmm3 , self . __fpu_stmm4 , self . __fpu_stmm5 , self . __fpu_stmm6 , self . __fpu_stmm7 , self . __fpu_xmm0 , self . __fpu_xmm1 , self . __fpu_xmm2 , self . __fpu_xmm3 , self . __fpu_xmm4 , self . __fpu_xmm5 , self . __fpu_xmm6 , self . __fpu_xmm7 , self . __fpu_xmm8 , self . __fpu_xmm9 , self . __fpu_xmm10 , self . __fpu_xmm11 , self . __fpu_xmm12 , self . __fpu_xmm13 , self . __fpu_xmm14 , self . __fpu_xmm15 , self . __fpu_reserved1 )
  }
}
impl ::core::cmp::PartialEq for __darwin_x86_float_state64 {
  fn eq(&self, other: &__darwin_x86_float_state64) -> bool {
    self.__fpu_reserved == other.__fpu_reserved
      && self.__fpu_fcw == other.__fpu_fcw
      && self.__fpu_fsw == other.__fpu_fsw
      && self.__fpu_ftw == other.__fpu_ftw
      && self.__fpu_rsrv1 == other.__fpu_rsrv1
      && self.__fpu_fop == other.__fpu_fop
      && self.__fpu_ip == other.__fpu_ip
      && self.__fpu_cs == other.__fpu_cs
      && self.__fpu_rsrv2 == other.__fpu_rsrv2
      && self.__fpu_dp == other.__fpu_dp
      && self.__fpu_ds == other.__fpu_ds
      && self.__fpu_rsrv3 == other.__fpu_rsrv3
      && self.__fpu_mxcsr == other.__fpu_mxcsr
      && self.__fpu_mxcsrmask == other.__fpu_mxcsrmask
      && self.__fpu_stmm0 == other.__fpu_stmm0
      && self.__fpu_stmm1 == other.__fpu_stmm1
      && self.__fpu_stmm2 == other.__fpu_stmm2
      && self.__fpu_stmm3 == other.__fpu_stmm3
      && self.__fpu_stmm4 == other.__fpu_stmm4
      && self.__fpu_stmm5 == other.__fpu_stmm5
      && self.__fpu_stmm6 == other.__fpu_stmm6
      && self.__fpu_stmm7 == other.__fpu_stmm7
      && self.__fpu_xmm0 == other.__fpu_xmm0
      && self.__fpu_xmm1 == other.__fpu_xmm1
      && self.__fpu_xmm2 == other.__fpu_xmm2
      && self.__fpu_xmm3 == other.__fpu_xmm3
      && self.__fpu_xmm4 == other.__fpu_xmm4
      && self.__fpu_xmm5 == other.__fpu_xmm5
      && self.__fpu_xmm6 == other.__fpu_xmm6
      && self.__fpu_xmm7 == other.__fpu_xmm7
      && self.__fpu_xmm8 == other.__fpu_xmm8
      && self.__fpu_xmm9 == other.__fpu_xmm9
      && self.__fpu_xmm10 == other.__fpu_xmm10
      && self.__fpu_xmm11 == other.__fpu_xmm11
      && self.__fpu_xmm12 == other.__fpu_xmm12
      && self.__fpu_xmm13 == other.__fpu_xmm13
      && self.__fpu_xmm14 == other.__fpu_xmm14
      && self.__fpu_xmm15 == other.__fpu_xmm15
      && &self.__fpu_rsrv4[..] == &other.__fpu_rsrv4[..]
      && self.__fpu_reserved1 == other.__fpu_reserved1
  }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __darwin_x86_avx_state64 {
  pub __fpu_reserved: [libc::c_int; 2usize],
  pub __fpu_fcw: __darwin_fp_control,
  pub __fpu_fsw: __darwin_fp_status,
  pub __fpu_ftw: __uint8_t,
  pub __fpu_rsrv1: __uint8_t,
  pub __fpu_fop: __uint16_t,
  pub __fpu_ip: __uint32_t,
  pub __fpu_cs: __uint16_t,
  pub __fpu_rsrv2: __uint16_t,
  pub __fpu_dp: __uint32_t,
  pub __fpu_ds: __uint16_t,
  pub __fpu_rsrv3: __uint16_t,
  pub __fpu_mxcsr: __uint32_t,
  pub __fpu_mxcsrmask: __uint32_t,
  pub __fpu_stmm0: __darwin_mmst_reg,
  pub __fpu_stmm1: __darwin_mmst_reg,
  pub __fpu_stmm2: __darwin_mmst_reg,
  pub __fpu_stmm3: __darwin_mmst_reg,
  pub __fpu_stmm4: __darwin_mmst_reg,
  pub __fpu_stmm5: __darwin_mmst_reg,
  pub __fpu_stmm6: __darwin_mmst_reg,
  pub __fpu_stmm7: __darwin_mmst_reg,
  pub __fpu_xmm0: __darwin_xmm_reg,
  pub __fpu_xmm1: __darwin_xmm_reg,
  pub __fpu_xmm2: __darwin_xmm_reg,
  pub __fpu_xmm3: __darwin_xmm_reg,
  pub __fpu_xmm4: __darwin_xmm_reg,
  pub __fpu_xmm5: __darwin_xmm_reg,
  pub __fpu_xmm6: __darwin_xmm_reg,
  pub __fpu_xmm7: __darwin_xmm_reg,
  pub __fpu_xmm8: __darwin_xmm_reg,
  pub __fpu_xmm9: __darwin_xmm_reg,
  pub __fpu_xmm10: __darwin_xmm_reg,
  pub __fpu_xmm11: __darwin_xmm_reg,
  pub __fpu_xmm12: __darwin_xmm_reg,
  pub __fpu_xmm13: __darwin_xmm_reg,
  pub __fpu_xmm14: __darwin_xmm_reg,
  pub __fpu_xmm15: __darwin_xmm_reg,
  pub __fpu_rsrv4: [libc::c_char; 96usize],
  pub __fpu_reserved1: libc::c_int,
  pub __avx_reserved1: [libc::c_char; 64usize],
  pub __fpu_ymmh0: __darwin_xmm_reg,
  pub __fpu_ymmh1: __darwin_xmm_reg,
  pub __fpu_ymmh2: __darwin_xmm_reg,
  pub __fpu_ymmh3: __darwin_xmm_reg,
  pub __fpu_ymmh4: __darwin_xmm_reg,
  pub __fpu_ymmh5: __darwin_xmm_reg,
  pub __fpu_ymmh6: __darwin_xmm_reg,
  pub __fpu_ymmh7: __darwin_xmm_reg,
  pub __fpu_ymmh8: __darwin_xmm_reg,
  pub __fpu_ymmh9: __darwin_xmm_reg,
  pub __fpu_ymmh10: __darwin_xmm_reg,
  pub __fpu_ymmh11: __darwin_xmm_reg,
  pub __fpu_ymmh12: __darwin_xmm_reg,
  pub __fpu_ymmh13: __darwin_xmm_reg,
  pub __fpu_ymmh14: __darwin_xmm_reg,
  pub __fpu_ymmh15: __darwin_xmm_reg,
}
#[test]
fn bindgen_test_layout___darwin_x86_avx_state64() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_x86_avx_state64>(),
    844usize,
    concat!("Size of: ", stringify!(__darwin_x86_avx_state64))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_x86_avx_state64>(),
    4usize,
    concat!("Alignment of ", stringify!(__darwin_x86_avx_state64))
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_reserved as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_reserved)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_fcw as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_fcw)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_fsw as *const _ as usize },
    10usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_fsw)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_ftw as *const _ as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_ftw)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_rsrv1 as *const _ as usize
    },
    13usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_rsrv1)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_fop as *const _ as usize },
    14usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_fop)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_ip as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_ip)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_cs as *const _ as usize },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_cs)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_rsrv2 as *const _ as usize
    },
    22usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_rsrv2)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_dp as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_dp)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_ds as *const _ as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_ds)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_rsrv3 as *const _ as usize
    },
    30usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_rsrv3)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_mxcsr as *const _ as usize
    },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_mxcsr)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_mxcsrmask as *const _ as usize
    },
    36usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_mxcsrmask)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_stmm0 as *const _ as usize
    },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_stmm0)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_stmm1 as *const _ as usize
    },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_stmm1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_stmm2 as *const _ as usize
    },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_stmm2)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_stmm3 as *const _ as usize
    },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_stmm3)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_stmm4 as *const _ as usize
    },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_stmm4)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_stmm5 as *const _ as usize
    },
    120usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_stmm5)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_stmm6 as *const _ as usize
    },
    136usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_stmm6)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_stmm7 as *const _ as usize
    },
    152usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_stmm7)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_xmm0 as *const _ as usize
    },
    168usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_xmm0)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_xmm1 as *const _ as usize
    },
    184usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_xmm1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_xmm2 as *const _ as usize
    },
    200usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_xmm2)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_xmm3 as *const _ as usize
    },
    216usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_xmm3)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_xmm4 as *const _ as usize
    },
    232usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_xmm4)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_xmm5 as *const _ as usize
    },
    248usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_xmm5)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_xmm6 as *const _ as usize
    },
    264usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_xmm6)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_xmm7 as *const _ as usize
    },
    280usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_xmm7)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_xmm8 as *const _ as usize
    },
    296usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_xmm8)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_xmm9 as *const _ as usize
    },
    312usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_xmm9)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_xmm10 as *const _ as usize
    },
    328usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_xmm10)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_xmm11 as *const _ as usize
    },
    344usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_xmm11)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_xmm12 as *const _ as usize
    },
    360usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_xmm12)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_xmm13 as *const _ as usize
    },
    376usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_xmm13)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_xmm14 as *const _ as usize
    },
    392usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_xmm14)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_xmm15 as *const _ as usize
    },
    408usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_xmm15)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_rsrv4 as *const _ as usize
    },
    424usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_rsrv4)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_reserved1 as *const _ as usize
    },
    520usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_reserved1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__avx_reserved1 as *const _ as usize
    },
    524usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__avx_reserved1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_ymmh0 as *const _ as usize
    },
    588usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_ymmh0)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_ymmh1 as *const _ as usize
    },
    604usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_ymmh1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_ymmh2 as *const _ as usize
    },
    620usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_ymmh2)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_ymmh3 as *const _ as usize
    },
    636usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_ymmh3)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_ymmh4 as *const _ as usize
    },
    652usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_ymmh4)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_ymmh5 as *const _ as usize
    },
    668usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_ymmh5)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_ymmh6 as *const _ as usize
    },
    684usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_ymmh6)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_ymmh7 as *const _ as usize
    },
    700usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_ymmh7)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_ymmh8 as *const _ as usize
    },
    716usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_ymmh8)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_ymmh9 as *const _ as usize
    },
    732usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_ymmh9)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_ymmh10 as *const _ as usize
    },
    748usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_ymmh10)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_ymmh11 as *const _ as usize
    },
    764usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_ymmh11)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_ymmh12 as *const _ as usize
    },
    780usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_ymmh12)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_ymmh13 as *const _ as usize
    },
    796usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_ymmh13)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_ymmh14 as *const _ as usize
    },
    812usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_ymmh14)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx_state64>())).__fpu_ymmh15 as *const _ as usize
    },
    828usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx_state64),
      "::",
      stringify!(__fpu_ymmh15)
    )
  );
}
impl Default for __darwin_x86_avx_state64 {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
impl ::core::fmt::Debug for __darwin_x86_avx_state64 {
  fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
    write ! ( f , "__darwin_x86_avx_state64 {{ __fpu_reserved: {:?}, __fpu_fcw: {:?}, __fpu_fsw: {:?}, __fpu_ftw: {:?}, __fpu_rsrv1: {:?}, __fpu_fop: {:?}, __fpu_ip: {:?}, __fpu_cs: {:?}, __fpu_rsrv2: {:?}, __fpu_dp: {:?}, __fpu_ds: {:?}, __fpu_rsrv3: {:?}, __fpu_mxcsr: {:?}, __fpu_mxcsrmask: {:?}, __fpu_stmm0: {:?}, __fpu_stmm1: {:?}, __fpu_stmm2: {:?}, __fpu_stmm3: {:?}, __fpu_stmm4: {:?}, __fpu_stmm5: {:?}, __fpu_stmm6: {:?}, __fpu_stmm7: {:?}, __fpu_xmm0: {:?}, __fpu_xmm1: {:?}, __fpu_xmm2: {:?}, __fpu_xmm3: {:?}, __fpu_xmm4: {:?}, __fpu_xmm5: {:?}, __fpu_xmm6: {:?}, __fpu_xmm7: {:?}, __fpu_xmm8: {:?}, __fpu_xmm9: {:?}, __fpu_xmm10: {:?}, __fpu_xmm11: {:?}, __fpu_xmm12: {:?}, __fpu_xmm13: {:?}, __fpu_xmm14: {:?}, __fpu_xmm15: {:?}, __fpu_rsrv4: [...], __fpu_reserved1: {:?}, __avx_reserved1: [...], __fpu_ymmh0: {:?}, __fpu_ymmh1: {:?}, __fpu_ymmh2: {:?}, __fpu_ymmh3: {:?}, __fpu_ymmh4: {:?}, __fpu_ymmh5: {:?}, __fpu_ymmh6: {:?}, __fpu_ymmh7: {:?}, __fpu_ymmh8: {:?}, __fpu_ymmh9: {:?}, __fpu_ymmh10: {:?}, __fpu_ymmh11: {:?}, __fpu_ymmh12: {:?}, __fpu_ymmh13: {:?}, __fpu_ymmh14: {:?}, __fpu_ymmh15: {:?} }}" , self . __fpu_reserved , self . __fpu_fcw , self . __fpu_fsw , self . __fpu_ftw , self . __fpu_rsrv1 , self . __fpu_fop , self . __fpu_ip , self . __fpu_cs , self . __fpu_rsrv2 , self . __fpu_dp , self . __fpu_ds , self . __fpu_rsrv3 , self . __fpu_mxcsr , self . __fpu_mxcsrmask , self . __fpu_stmm0 , self . __fpu_stmm1 , self . __fpu_stmm2 , self . __fpu_stmm3 , self . __fpu_stmm4 , self . __fpu_stmm5 , self . __fpu_stmm6 , self . __fpu_stmm7 , self . __fpu_xmm0 , self . __fpu_xmm1 , self . __fpu_xmm2 , self . __fpu_xmm3 , self . __fpu_xmm4 , self . __fpu_xmm5 , self . __fpu_xmm6 , self . __fpu_xmm7 , self . __fpu_xmm8 , self . __fpu_xmm9 , self . __fpu_xmm10 , self . __fpu_xmm11 , self . __fpu_xmm12 , self . __fpu_xmm13 , self . __fpu_xmm14 , self . __fpu_xmm15 , self . __fpu_reserved1 , self . __fpu_ymmh0 , self . __fpu_ymmh1 , self . __fpu_ymmh2 , self . __fpu_ymmh3 , self . __fpu_ymmh4 , self . __fpu_ymmh5 , self . __fpu_ymmh6 , self . __fpu_ymmh7 , self . __fpu_ymmh8 , self . __fpu_ymmh9 , self . __fpu_ymmh10 , self . __fpu_ymmh11 , self . __fpu_ymmh12 , self . __fpu_ymmh13 , self . __fpu_ymmh14 , self . __fpu_ymmh15 )
  }
}
impl ::core::cmp::PartialEq for __darwin_x86_avx_state64 {
  fn eq(&self, other: &__darwin_x86_avx_state64) -> bool {
    self.__fpu_reserved == other.__fpu_reserved
      && self.__fpu_fcw == other.__fpu_fcw
      && self.__fpu_fsw == other.__fpu_fsw
      && self.__fpu_ftw == other.__fpu_ftw
      && self.__fpu_rsrv1 == other.__fpu_rsrv1
      && self.__fpu_fop == other.__fpu_fop
      && self.__fpu_ip == other.__fpu_ip
      && self.__fpu_cs == other.__fpu_cs
      && self.__fpu_rsrv2 == other.__fpu_rsrv2
      && self.__fpu_dp == other.__fpu_dp
      && self.__fpu_ds == other.__fpu_ds
      && self.__fpu_rsrv3 == other.__fpu_rsrv3
      && self.__fpu_mxcsr == other.__fpu_mxcsr
      && self.__fpu_mxcsrmask == other.__fpu_mxcsrmask
      && self.__fpu_stmm0 == other.__fpu_stmm0
      && self.__fpu_stmm1 == other.__fpu_stmm1
      && self.__fpu_stmm2 == other.__fpu_stmm2
      && self.__fpu_stmm3 == other.__fpu_stmm3
      && self.__fpu_stmm4 == other.__fpu_stmm4
      && self.__fpu_stmm5 == other.__fpu_stmm5
      && self.__fpu_stmm6 == other.__fpu_stmm6
      && self.__fpu_stmm7 == other.__fpu_stmm7
      && self.__fpu_xmm0 == other.__fpu_xmm0
      && self.__fpu_xmm1 == other.__fpu_xmm1
      && self.__fpu_xmm2 == other.__fpu_xmm2
      && self.__fpu_xmm3 == other.__fpu_xmm3
      && self.__fpu_xmm4 == other.__fpu_xmm4
      && self.__fpu_xmm5 == other.__fpu_xmm5
      && self.__fpu_xmm6 == other.__fpu_xmm6
      && self.__fpu_xmm7 == other.__fpu_xmm7
      && self.__fpu_xmm8 == other.__fpu_xmm8
      && self.__fpu_xmm9 == other.__fpu_xmm9
      && self.__fpu_xmm10 == other.__fpu_xmm10
      && self.__fpu_xmm11 == other.__fpu_xmm11
      && self.__fpu_xmm12 == other.__fpu_xmm12
      && self.__fpu_xmm13 == other.__fpu_xmm13
      && self.__fpu_xmm14 == other.__fpu_xmm14
      && self.__fpu_xmm15 == other.__fpu_xmm15
      && &self.__fpu_rsrv4[..] == &other.__fpu_rsrv4[..]
      && self.__fpu_reserved1 == other.__fpu_reserved1
      && &self.__avx_reserved1[..] == &other.__avx_reserved1[..]
      && self.__fpu_ymmh0 == other.__fpu_ymmh0
      && self.__fpu_ymmh1 == other.__fpu_ymmh1
      && self.__fpu_ymmh2 == other.__fpu_ymmh2
      && self.__fpu_ymmh3 == other.__fpu_ymmh3
      && self.__fpu_ymmh4 == other.__fpu_ymmh4
      && self.__fpu_ymmh5 == other.__fpu_ymmh5
      && self.__fpu_ymmh6 == other.__fpu_ymmh6
      && self.__fpu_ymmh7 == other.__fpu_ymmh7
      && self.__fpu_ymmh8 == other.__fpu_ymmh8
      && self.__fpu_ymmh9 == other.__fpu_ymmh9
      && self.__fpu_ymmh10 == other.__fpu_ymmh10
      && self.__fpu_ymmh11 == other.__fpu_ymmh11
      && self.__fpu_ymmh12 == other.__fpu_ymmh12
      && self.__fpu_ymmh13 == other.__fpu_ymmh13
      && self.__fpu_ymmh14 == other.__fpu_ymmh14
      && self.__fpu_ymmh15 == other.__fpu_ymmh15
  }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __darwin_x86_avx512_state64 {
  pub __fpu_reserved: [libc::c_int; 2usize],
  pub __fpu_fcw: __darwin_fp_control,
  pub __fpu_fsw: __darwin_fp_status,
  pub __fpu_ftw: __uint8_t,
  pub __fpu_rsrv1: __uint8_t,
  pub __fpu_fop: __uint16_t,
  pub __fpu_ip: __uint32_t,
  pub __fpu_cs: __uint16_t,
  pub __fpu_rsrv2: __uint16_t,
  pub __fpu_dp: __uint32_t,
  pub __fpu_ds: __uint16_t,
  pub __fpu_rsrv3: __uint16_t,
  pub __fpu_mxcsr: __uint32_t,
  pub __fpu_mxcsrmask: __uint32_t,
  pub __fpu_stmm0: __darwin_mmst_reg,
  pub __fpu_stmm1: __darwin_mmst_reg,
  pub __fpu_stmm2: __darwin_mmst_reg,
  pub __fpu_stmm3: __darwin_mmst_reg,
  pub __fpu_stmm4: __darwin_mmst_reg,
  pub __fpu_stmm5: __darwin_mmst_reg,
  pub __fpu_stmm6: __darwin_mmst_reg,
  pub __fpu_stmm7: __darwin_mmst_reg,
  pub __fpu_xmm0: __darwin_xmm_reg,
  pub __fpu_xmm1: __darwin_xmm_reg,
  pub __fpu_xmm2: __darwin_xmm_reg,
  pub __fpu_xmm3: __darwin_xmm_reg,
  pub __fpu_xmm4: __darwin_xmm_reg,
  pub __fpu_xmm5: __darwin_xmm_reg,
  pub __fpu_xmm6: __darwin_xmm_reg,
  pub __fpu_xmm7: __darwin_xmm_reg,
  pub __fpu_xmm8: __darwin_xmm_reg,
  pub __fpu_xmm9: __darwin_xmm_reg,
  pub __fpu_xmm10: __darwin_xmm_reg,
  pub __fpu_xmm11: __darwin_xmm_reg,
  pub __fpu_xmm12: __darwin_xmm_reg,
  pub __fpu_xmm13: __darwin_xmm_reg,
  pub __fpu_xmm14: __darwin_xmm_reg,
  pub __fpu_xmm15: __darwin_xmm_reg,
  pub __fpu_rsrv4: [libc::c_char; 96usize],
  pub __fpu_reserved1: libc::c_int,
  pub __avx_reserved1: [libc::c_char; 64usize],
  pub __fpu_ymmh0: __darwin_xmm_reg,
  pub __fpu_ymmh1: __darwin_xmm_reg,
  pub __fpu_ymmh2: __darwin_xmm_reg,
  pub __fpu_ymmh3: __darwin_xmm_reg,
  pub __fpu_ymmh4: __darwin_xmm_reg,
  pub __fpu_ymmh5: __darwin_xmm_reg,
  pub __fpu_ymmh6: __darwin_xmm_reg,
  pub __fpu_ymmh7: __darwin_xmm_reg,
  pub __fpu_ymmh8: __darwin_xmm_reg,
  pub __fpu_ymmh9: __darwin_xmm_reg,
  pub __fpu_ymmh10: __darwin_xmm_reg,
  pub __fpu_ymmh11: __darwin_xmm_reg,
  pub __fpu_ymmh12: __darwin_xmm_reg,
  pub __fpu_ymmh13: __darwin_xmm_reg,
  pub __fpu_ymmh14: __darwin_xmm_reg,
  pub __fpu_ymmh15: __darwin_xmm_reg,
  pub __fpu_k0: __darwin_opmask_reg,
  pub __fpu_k1: __darwin_opmask_reg,
  pub __fpu_k2: __darwin_opmask_reg,
  pub __fpu_k3: __darwin_opmask_reg,
  pub __fpu_k4: __darwin_opmask_reg,
  pub __fpu_k5: __darwin_opmask_reg,
  pub __fpu_k6: __darwin_opmask_reg,
  pub __fpu_k7: __darwin_opmask_reg,
  pub __fpu_zmmh0: __darwin_ymm_reg,
  pub __fpu_zmmh1: __darwin_ymm_reg,
  pub __fpu_zmmh2: __darwin_ymm_reg,
  pub __fpu_zmmh3: __darwin_ymm_reg,
  pub __fpu_zmmh4: __darwin_ymm_reg,
  pub __fpu_zmmh5: __darwin_ymm_reg,
  pub __fpu_zmmh6: __darwin_ymm_reg,
  pub __fpu_zmmh7: __darwin_ymm_reg,
  pub __fpu_zmmh8: __darwin_ymm_reg,
  pub __fpu_zmmh9: __darwin_ymm_reg,
  pub __fpu_zmmh10: __darwin_ymm_reg,
  pub __fpu_zmmh11: __darwin_ymm_reg,
  pub __fpu_zmmh12: __darwin_ymm_reg,
  pub __fpu_zmmh13: __darwin_ymm_reg,
  pub __fpu_zmmh14: __darwin_ymm_reg,
  pub __fpu_zmmh15: __darwin_ymm_reg,
  pub __fpu_zmm16: __darwin_zmm_reg,
  pub __fpu_zmm17: __darwin_zmm_reg,
  pub __fpu_zmm18: __darwin_zmm_reg,
  pub __fpu_zmm19: __darwin_zmm_reg,
  pub __fpu_zmm20: __darwin_zmm_reg,
  pub __fpu_zmm21: __darwin_zmm_reg,
  pub __fpu_zmm22: __darwin_zmm_reg,
  pub __fpu_zmm23: __darwin_zmm_reg,
  pub __fpu_zmm24: __darwin_zmm_reg,
  pub __fpu_zmm25: __darwin_zmm_reg,
  pub __fpu_zmm26: __darwin_zmm_reg,
  pub __fpu_zmm27: __darwin_zmm_reg,
  pub __fpu_zmm28: __darwin_zmm_reg,
  pub __fpu_zmm29: __darwin_zmm_reg,
  pub __fpu_zmm30: __darwin_zmm_reg,
  pub __fpu_zmm31: __darwin_zmm_reg,
}
#[test]
fn bindgen_test_layout___darwin_x86_avx512_state64() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_x86_avx512_state64>(),
    2444usize,
    concat!("Size of: ", stringify!(__darwin_x86_avx512_state64))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_x86_avx512_state64>(),
    4usize,
    concat!("Alignment of ", stringify!(__darwin_x86_avx512_state64))
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_reserved as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_reserved)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_fcw as *const _ as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_fcw)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_fsw as *const _ as usize
    },
    10usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_fsw)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_ftw as *const _ as usize
    },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_ftw)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_rsrv1 as *const _ as usize
    },
    13usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_rsrv1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_fop as *const _ as usize
    },
    14usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_fop)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_ip as *const _ as usize
    },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_ip)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_cs as *const _ as usize
    },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_cs)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_rsrv2 as *const _ as usize
    },
    22usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_rsrv2)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_dp as *const _ as usize
    },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_dp)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_ds as *const _ as usize
    },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_ds)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_rsrv3 as *const _ as usize
    },
    30usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_rsrv3)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_mxcsr as *const _ as usize
    },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_mxcsr)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_mxcsrmask as *const _ as usize
    },
    36usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_mxcsrmask)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_stmm0 as *const _ as usize
    },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_stmm0)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_stmm1 as *const _ as usize
    },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_stmm1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_stmm2 as *const _ as usize
    },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_stmm2)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_stmm3 as *const _ as usize
    },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_stmm3)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_stmm4 as *const _ as usize
    },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_stmm4)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_stmm5 as *const _ as usize
    },
    120usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_stmm5)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_stmm6 as *const _ as usize
    },
    136usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_stmm6)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_stmm7 as *const _ as usize
    },
    152usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_stmm7)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_xmm0 as *const _ as usize
    },
    168usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_xmm0)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_xmm1 as *const _ as usize
    },
    184usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_xmm1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_xmm2 as *const _ as usize
    },
    200usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_xmm2)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_xmm3 as *const _ as usize
    },
    216usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_xmm3)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_xmm4 as *const _ as usize
    },
    232usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_xmm4)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_xmm5 as *const _ as usize
    },
    248usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_xmm5)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_xmm6 as *const _ as usize
    },
    264usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_xmm6)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_xmm7 as *const _ as usize
    },
    280usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_xmm7)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_xmm8 as *const _ as usize
    },
    296usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_xmm8)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_xmm9 as *const _ as usize
    },
    312usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_xmm9)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_xmm10 as *const _ as usize
    },
    328usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_xmm10)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_xmm11 as *const _ as usize
    },
    344usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_xmm11)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_xmm12 as *const _ as usize
    },
    360usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_xmm12)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_xmm13 as *const _ as usize
    },
    376usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_xmm13)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_xmm14 as *const _ as usize
    },
    392usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_xmm14)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_xmm15 as *const _ as usize
    },
    408usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_xmm15)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_rsrv4 as *const _ as usize
    },
    424usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_rsrv4)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_reserved1 as *const _ as usize
    },
    520usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_reserved1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__avx_reserved1 as *const _ as usize
    },
    524usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__avx_reserved1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_ymmh0 as *const _ as usize
    },
    588usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_ymmh0)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_ymmh1 as *const _ as usize
    },
    604usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_ymmh1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_ymmh2 as *const _ as usize
    },
    620usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_ymmh2)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_ymmh3 as *const _ as usize
    },
    636usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_ymmh3)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_ymmh4 as *const _ as usize
    },
    652usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_ymmh4)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_ymmh5 as *const _ as usize
    },
    668usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_ymmh5)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_ymmh6 as *const _ as usize
    },
    684usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_ymmh6)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_ymmh7 as *const _ as usize
    },
    700usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_ymmh7)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_ymmh8 as *const _ as usize
    },
    716usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_ymmh8)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_ymmh9 as *const _ as usize
    },
    732usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_ymmh9)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_ymmh10 as *const _ as usize
    },
    748usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_ymmh10)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_ymmh11 as *const _ as usize
    },
    764usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_ymmh11)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_ymmh12 as *const _ as usize
    },
    780usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_ymmh12)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_ymmh13 as *const _ as usize
    },
    796usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_ymmh13)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_ymmh14 as *const _ as usize
    },
    812usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_ymmh14)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_ymmh15 as *const _ as usize
    },
    828usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_ymmh15)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_k0 as *const _ as usize
    },
    844usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_k0)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_k1 as *const _ as usize
    },
    852usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_k1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_k2 as *const _ as usize
    },
    860usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_k2)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_k3 as *const _ as usize
    },
    868usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_k3)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_k4 as *const _ as usize
    },
    876usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_k4)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_k5 as *const _ as usize
    },
    884usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_k5)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_k6 as *const _ as usize
    },
    892usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_k6)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_k7 as *const _ as usize
    },
    900usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_k7)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmmh0 as *const _ as usize
    },
    908usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmmh0)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmmh1 as *const _ as usize
    },
    940usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmmh1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmmh2 as *const _ as usize
    },
    972usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmmh2)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmmh3 as *const _ as usize
    },
    1004usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmmh3)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmmh4 as *const _ as usize
    },
    1036usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmmh4)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmmh5 as *const _ as usize
    },
    1068usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmmh5)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmmh6 as *const _ as usize
    },
    1100usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmmh6)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmmh7 as *const _ as usize
    },
    1132usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmmh7)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmmh8 as *const _ as usize
    },
    1164usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmmh8)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmmh9 as *const _ as usize
    },
    1196usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmmh9)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmmh10 as *const _ as usize
    },
    1228usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmmh10)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmmh11 as *const _ as usize
    },
    1260usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmmh11)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmmh12 as *const _ as usize
    },
    1292usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmmh12)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmmh13 as *const _ as usize
    },
    1324usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmmh13)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmmh14 as *const _ as usize
    },
    1356usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmmh14)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmmh15 as *const _ as usize
    },
    1388usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmmh15)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmm16 as *const _ as usize
    },
    1420usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmm16)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmm17 as *const _ as usize
    },
    1484usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmm17)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmm18 as *const _ as usize
    },
    1548usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmm18)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmm19 as *const _ as usize
    },
    1612usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmm19)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmm20 as *const _ as usize
    },
    1676usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmm20)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmm21 as *const _ as usize
    },
    1740usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmm21)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmm22 as *const _ as usize
    },
    1804usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmm22)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmm23 as *const _ as usize
    },
    1868usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmm23)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmm24 as *const _ as usize
    },
    1932usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmm24)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmm25 as *const _ as usize
    },
    1996usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmm25)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmm26 as *const _ as usize
    },
    2060usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmm26)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmm27 as *const _ as usize
    },
    2124usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmm27)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmm28 as *const _ as usize
    },
    2188usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmm28)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmm29 as *const _ as usize
    },
    2252usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmm29)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmm30 as *const _ as usize
    },
    2316usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmm30)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_avx512_state64>())).__fpu_zmm31 as *const _ as usize
    },
    2380usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_avx512_state64),
      "::",
      stringify!(__fpu_zmm31)
    )
  );
}
impl Default for __darwin_x86_avx512_state64 {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
impl ::core::fmt::Debug for __darwin_x86_avx512_state64 {
  fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
    write ! ( f , "__darwin_x86_avx512_state64 {{ __fpu_reserved: {:?}, __fpu_fcw: {:?}, __fpu_fsw: {:?}, __fpu_ftw: {:?}, __fpu_rsrv1: {:?}, __fpu_fop: {:?}, __fpu_ip: {:?}, __fpu_cs: {:?}, __fpu_rsrv2: {:?}, __fpu_dp: {:?}, __fpu_ds: {:?}, __fpu_rsrv3: {:?}, __fpu_mxcsr: {:?}, __fpu_mxcsrmask: {:?}, __fpu_stmm0: {:?}, __fpu_stmm1: {:?}, __fpu_stmm2: {:?}, __fpu_stmm3: {:?}, __fpu_stmm4: {:?}, __fpu_stmm5: {:?}, __fpu_stmm6: {:?}, __fpu_stmm7: {:?}, __fpu_xmm0: {:?}, __fpu_xmm1: {:?}, __fpu_xmm2: {:?}, __fpu_xmm3: {:?}, __fpu_xmm4: {:?}, __fpu_xmm5: {:?}, __fpu_xmm6: {:?}, __fpu_xmm7: {:?}, __fpu_xmm8: {:?}, __fpu_xmm9: {:?}, __fpu_xmm10: {:?}, __fpu_xmm11: {:?}, __fpu_xmm12: {:?}, __fpu_xmm13: {:?}, __fpu_xmm14: {:?}, __fpu_xmm15: {:?}, __fpu_rsrv4: [...], __fpu_reserved1: {:?}, __avx_reserved1: [...], __fpu_ymmh0: {:?}, __fpu_ymmh1: {:?}, __fpu_ymmh2: {:?}, __fpu_ymmh3: {:?}, __fpu_ymmh4: {:?}, __fpu_ymmh5: {:?}, __fpu_ymmh6: {:?}, __fpu_ymmh7: {:?}, __fpu_ymmh8: {:?}, __fpu_ymmh9: {:?}, __fpu_ymmh10: {:?}, __fpu_ymmh11: {:?}, __fpu_ymmh12: {:?}, __fpu_ymmh13: {:?}, __fpu_ymmh14: {:?}, __fpu_ymmh15: {:?}, __fpu_k0: {:?}, __fpu_k1: {:?}, __fpu_k2: {:?}, __fpu_k3: {:?}, __fpu_k4: {:?}, __fpu_k5: {:?}, __fpu_k6: {:?}, __fpu_k7: {:?}, __fpu_zmmh0: {:?}, __fpu_zmmh1: {:?}, __fpu_zmmh2: {:?}, __fpu_zmmh3: {:?}, __fpu_zmmh4: {:?}, __fpu_zmmh5: {:?}, __fpu_zmmh6: {:?}, __fpu_zmmh7: {:?}, __fpu_zmmh8: {:?}, __fpu_zmmh9: {:?}, __fpu_zmmh10: {:?}, __fpu_zmmh11: {:?}, __fpu_zmmh12: {:?}, __fpu_zmmh13: {:?}, __fpu_zmmh14: {:?}, __fpu_zmmh15: {:?}, __fpu_zmm16: {:?}, __fpu_zmm17: {:?}, __fpu_zmm18: {:?}, __fpu_zmm19: {:?}, __fpu_zmm20: {:?}, __fpu_zmm21: {:?}, __fpu_zmm22: {:?}, __fpu_zmm23: {:?}, __fpu_zmm24: {:?}, __fpu_zmm25: {:?}, __fpu_zmm26: {:?}, __fpu_zmm27: {:?}, __fpu_zmm28: {:?}, __fpu_zmm29: {:?}, __fpu_zmm30: {:?}, __fpu_zmm31: {:?} }}" , self . __fpu_reserved , self . __fpu_fcw , self . __fpu_fsw , self . __fpu_ftw , self . __fpu_rsrv1 , self . __fpu_fop , self . __fpu_ip , self . __fpu_cs , self . __fpu_rsrv2 , self . __fpu_dp , self . __fpu_ds , self . __fpu_rsrv3 , self . __fpu_mxcsr , self . __fpu_mxcsrmask , self . __fpu_stmm0 , self . __fpu_stmm1 , self . __fpu_stmm2 , self . __fpu_stmm3 , self . __fpu_stmm4 , self . __fpu_stmm5 , self . __fpu_stmm6 , self . __fpu_stmm7 , self . __fpu_xmm0 , self . __fpu_xmm1 , self . __fpu_xmm2 , self . __fpu_xmm3 , self . __fpu_xmm4 , self . __fpu_xmm5 , self . __fpu_xmm6 , self . __fpu_xmm7 , self . __fpu_xmm8 , self . __fpu_xmm9 , self . __fpu_xmm10 , self . __fpu_xmm11 , self . __fpu_xmm12 , self . __fpu_xmm13 , self . __fpu_xmm14 , self . __fpu_xmm15 , self . __fpu_reserved1 , self . __fpu_ymmh0 , self . __fpu_ymmh1 , self . __fpu_ymmh2 , self . __fpu_ymmh3 , self . __fpu_ymmh4 , self . __fpu_ymmh5 , self . __fpu_ymmh6 , self . __fpu_ymmh7 , self . __fpu_ymmh8 , self . __fpu_ymmh9 , self . __fpu_ymmh10 , self . __fpu_ymmh11 , self . __fpu_ymmh12 , self . __fpu_ymmh13 , self . __fpu_ymmh14 , self . __fpu_ymmh15 , self . __fpu_k0 , self . __fpu_k1 , self . __fpu_k2 , self . __fpu_k3 , self . __fpu_k4 , self . __fpu_k5 , self . __fpu_k6 , self . __fpu_k7 , self . __fpu_zmmh0 , self . __fpu_zmmh1 , self . __fpu_zmmh2 , self . __fpu_zmmh3 , self . __fpu_zmmh4 , self . __fpu_zmmh5 , self . __fpu_zmmh6 , self . __fpu_zmmh7 , self . __fpu_zmmh8 , self . __fpu_zmmh9 , self . __fpu_zmmh10 , self . __fpu_zmmh11 , self . __fpu_zmmh12 , self . __fpu_zmmh13 , self . __fpu_zmmh14 , self . __fpu_zmmh15 , self . __fpu_zmm16 , self . __fpu_zmm17 , self . __fpu_zmm18 , self . __fpu_zmm19 , self . __fpu_zmm20 , self . __fpu_zmm21 , self . __fpu_zmm22 , self . __fpu_zmm23 , self . __fpu_zmm24 , self . __fpu_zmm25 , self . __fpu_zmm26 , self . __fpu_zmm27 , self . __fpu_zmm28 , self . __fpu_zmm29 , self . __fpu_zmm30 , self . __fpu_zmm31 )
  }
}
impl ::core::cmp::PartialEq for __darwin_x86_avx512_state64 {
  fn eq(&self, other: &__darwin_x86_avx512_state64) -> bool {
    self.__fpu_reserved == other.__fpu_reserved
      && self.__fpu_fcw == other.__fpu_fcw
      && self.__fpu_fsw == other.__fpu_fsw
      && self.__fpu_ftw == other.__fpu_ftw
      && self.__fpu_rsrv1 == other.__fpu_rsrv1
      && self.__fpu_fop == other.__fpu_fop
      && self.__fpu_ip == other.__fpu_ip
      && self.__fpu_cs == other.__fpu_cs
      && self.__fpu_rsrv2 == other.__fpu_rsrv2
      && self.__fpu_dp == other.__fpu_dp
      && self.__fpu_ds == other.__fpu_ds
      && self.__fpu_rsrv3 == other.__fpu_rsrv3
      && self.__fpu_mxcsr == other.__fpu_mxcsr
      && self.__fpu_mxcsrmask == other.__fpu_mxcsrmask
      && self.__fpu_stmm0 == other.__fpu_stmm0
      && self.__fpu_stmm1 == other.__fpu_stmm1
      && self.__fpu_stmm2 == other.__fpu_stmm2
      && self.__fpu_stmm3 == other.__fpu_stmm3
      && self.__fpu_stmm4 == other.__fpu_stmm4
      && self.__fpu_stmm5 == other.__fpu_stmm5
      && self.__fpu_stmm6 == other.__fpu_stmm6
      && self.__fpu_stmm7 == other.__fpu_stmm7
      && self.__fpu_xmm0 == other.__fpu_xmm0
      && self.__fpu_xmm1 == other.__fpu_xmm1
      && self.__fpu_xmm2 == other.__fpu_xmm2
      && self.__fpu_xmm3 == other.__fpu_xmm3
      && self.__fpu_xmm4 == other.__fpu_xmm4
      && self.__fpu_xmm5 == other.__fpu_xmm5
      && self.__fpu_xmm6 == other.__fpu_xmm6
      && self.__fpu_xmm7 == other.__fpu_xmm7
      && self.__fpu_xmm8 == other.__fpu_xmm8
      && self.__fpu_xmm9 == other.__fpu_xmm9
      && self.__fpu_xmm10 == other.__fpu_xmm10
      && self.__fpu_xmm11 == other.__fpu_xmm11
      && self.__fpu_xmm12 == other.__fpu_xmm12
      && self.__fpu_xmm13 == other.__fpu_xmm13
      && self.__fpu_xmm14 == other.__fpu_xmm14
      && self.__fpu_xmm15 == other.__fpu_xmm15
      && &self.__fpu_rsrv4[..] == &other.__fpu_rsrv4[..]
      && self.__fpu_reserved1 == other.__fpu_reserved1
      && &self.__avx_reserved1[..] == &other.__avx_reserved1[..]
      && self.__fpu_ymmh0 == other.__fpu_ymmh0
      && self.__fpu_ymmh1 == other.__fpu_ymmh1
      && self.__fpu_ymmh2 == other.__fpu_ymmh2
      && self.__fpu_ymmh3 == other.__fpu_ymmh3
      && self.__fpu_ymmh4 == other.__fpu_ymmh4
      && self.__fpu_ymmh5 == other.__fpu_ymmh5
      && self.__fpu_ymmh6 == other.__fpu_ymmh6
      && self.__fpu_ymmh7 == other.__fpu_ymmh7
      && self.__fpu_ymmh8 == other.__fpu_ymmh8
      && self.__fpu_ymmh9 == other.__fpu_ymmh9
      && self.__fpu_ymmh10 == other.__fpu_ymmh10
      && self.__fpu_ymmh11 == other.__fpu_ymmh11
      && self.__fpu_ymmh12 == other.__fpu_ymmh12
      && self.__fpu_ymmh13 == other.__fpu_ymmh13
      && self.__fpu_ymmh14 == other.__fpu_ymmh14
      && self.__fpu_ymmh15 == other.__fpu_ymmh15
      && self.__fpu_k0 == other.__fpu_k0
      && self.__fpu_k1 == other.__fpu_k1
      && self.__fpu_k2 == other.__fpu_k2
      && self.__fpu_k3 == other.__fpu_k3
      && self.__fpu_k4 == other.__fpu_k4
      && self.__fpu_k5 == other.__fpu_k5
      && self.__fpu_k6 == other.__fpu_k6
      && self.__fpu_k7 == other.__fpu_k7
      && self.__fpu_zmmh0 == other.__fpu_zmmh0
      && self.__fpu_zmmh1 == other.__fpu_zmmh1
      && self.__fpu_zmmh2 == other.__fpu_zmmh2
      && self.__fpu_zmmh3 == other.__fpu_zmmh3
      && self.__fpu_zmmh4 == other.__fpu_zmmh4
      && self.__fpu_zmmh5 == other.__fpu_zmmh5
      && self.__fpu_zmmh6 == other.__fpu_zmmh6
      && self.__fpu_zmmh7 == other.__fpu_zmmh7
      && self.__fpu_zmmh8 == other.__fpu_zmmh8
      && self.__fpu_zmmh9 == other.__fpu_zmmh9
      && self.__fpu_zmmh10 == other.__fpu_zmmh10
      && self.__fpu_zmmh11 == other.__fpu_zmmh11
      && self.__fpu_zmmh12 == other.__fpu_zmmh12
      && self.__fpu_zmmh13 == other.__fpu_zmmh13
      && self.__fpu_zmmh14 == other.__fpu_zmmh14
      && self.__fpu_zmmh15 == other.__fpu_zmmh15
      && self.__fpu_zmm16 == other.__fpu_zmm16
      && self.__fpu_zmm17 == other.__fpu_zmm17
      && self.__fpu_zmm18 == other.__fpu_zmm18
      && self.__fpu_zmm19 == other.__fpu_zmm19
      && self.__fpu_zmm20 == other.__fpu_zmm20
      && self.__fpu_zmm21 == other.__fpu_zmm21
      && self.__fpu_zmm22 == other.__fpu_zmm22
      && self.__fpu_zmm23 == other.__fpu_zmm23
      && self.__fpu_zmm24 == other.__fpu_zmm24
      && self.__fpu_zmm25 == other.__fpu_zmm25
      && self.__fpu_zmm26 == other.__fpu_zmm26
      && self.__fpu_zmm27 == other.__fpu_zmm27
      && self.__fpu_zmm28 == other.__fpu_zmm28
      && self.__fpu_zmm29 == other.__fpu_zmm29
      && self.__fpu_zmm30 == other.__fpu_zmm30
      && self.__fpu_zmm31 == other.__fpu_zmm31
  }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct __darwin_x86_exception_state64 {
  pub __trapno: __uint16_t,
  pub __cpu: __uint16_t,
  pub __err: __uint32_t,
  pub __faultvaddr: __uint64_t,
}
#[test]
fn bindgen_test_layout___darwin_x86_exception_state64() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_x86_exception_state64>(),
    16usize,
    concat!("Size of: ", stringify!(__darwin_x86_exception_state64))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_x86_exception_state64>(),
    8usize,
    concat!("Alignment of ", stringify!(__darwin_x86_exception_state64))
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_exception_state64>())).__trapno as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_exception_state64),
      "::",
      stringify!(__trapno)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_exception_state64>())).__cpu as *const _ as usize
    },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_exception_state64),
      "::",
      stringify!(__cpu)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_exception_state64>())).__err as *const _ as usize
    },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_exception_state64),
      "::",
      stringify!(__err)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<__darwin_x86_exception_state64>())).__faultvaddr as *const _ as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_exception_state64),
      "::",
      stringify!(__faultvaddr)
    )
  );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct __darwin_x86_debug_state64 {
  pub __dr0: __uint64_t,
  pub __dr1: __uint64_t,
  pub __dr2: __uint64_t,
  pub __dr3: __uint64_t,
  pub __dr4: __uint64_t,
  pub __dr5: __uint64_t,
  pub __dr6: __uint64_t,
  pub __dr7: __uint64_t,
}
#[test]
fn bindgen_test_layout___darwin_x86_debug_state64() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_x86_debug_state64>(),
    64usize,
    concat!("Size of: ", stringify!(__darwin_x86_debug_state64))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_x86_debug_state64>(),
    8usize,
    concat!("Alignment of ", stringify!(__darwin_x86_debug_state64))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_debug_state64>())).__dr0 as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_debug_state64),
      "::",
      stringify!(__dr0)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_debug_state64>())).__dr1 as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_debug_state64),
      "::",
      stringify!(__dr1)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_debug_state64>())).__dr2 as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_debug_state64),
      "::",
      stringify!(__dr2)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_debug_state64>())).__dr3 as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_debug_state64),
      "::",
      stringify!(__dr3)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_debug_state64>())).__dr4 as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_debug_state64),
      "::",
      stringify!(__dr4)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_debug_state64>())).__dr5 as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_debug_state64),
      "::",
      stringify!(__dr5)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_debug_state64>())).__dr6 as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_debug_state64),
      "::",
      stringify!(__dr6)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_debug_state64>())).__dr7 as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_debug_state64),
      "::",
      stringify!(__dr7)
    )
  );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct __darwin_x86_cpmu_state64 {
  pub __ctrs: [__uint64_t; 16usize],
}
#[test]
fn bindgen_test_layout___darwin_x86_cpmu_state64() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_x86_cpmu_state64>(),
    128usize,
    concat!("Size of: ", stringify!(__darwin_x86_cpmu_state64))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_x86_cpmu_state64>(),
    8usize,
    concat!("Alignment of ", stringify!(__darwin_x86_cpmu_state64))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_x86_cpmu_state64>())).__ctrs as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_x86_cpmu_state64),
      "::",
      stringify!(__ctrs)
    )
  );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __darwin_mcontext32 {
  pub __es: __darwin_i386_exception_state,
  pub __ss: __darwin_i386_thread_state,
  pub __fs: __darwin_i386_float_state,
}
#[test]
fn bindgen_test_layout___darwin_mcontext32() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_mcontext32>(),
    600usize,
    concat!("Size of: ", stringify!(__darwin_mcontext32))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_mcontext32>(),
    4usize,
    concat!("Alignment of ", stringify!(__darwin_mcontext32))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_mcontext32>())).__es as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_mcontext32),
      "::",
      stringify!(__es)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_mcontext32>())).__ss as *const _ as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_mcontext32),
      "::",
      stringify!(__ss)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_mcontext32>())).__fs as *const _ as usize },
    76usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_mcontext32),
      "::",
      stringify!(__fs)
    )
  );
}
impl Default for __darwin_mcontext32 {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
impl ::core::fmt::Debug for __darwin_mcontext32 {
  fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
    write!(
      f,
      "__darwin_mcontext32 {{ __es: {:?}, __ss: {:?}, __fs: {:?} }}",
      self.__es, self.__ss, self.__fs
    )
  }
}
impl ::core::cmp::PartialEq for __darwin_mcontext32 {
  fn eq(&self, other: &__darwin_mcontext32) -> bool {
    self.__es == other.__es && self.__ss == other.__ss && self.__fs == other.__fs
  }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __darwin_mcontext_avx32 {
  pub __es: __darwin_i386_exception_state,
  pub __ss: __darwin_i386_thread_state,
  pub __fs: __darwin_i386_avx_state,
}
#[test]
fn bindgen_test_layout___darwin_mcontext_avx32() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_mcontext_avx32>(),
    792usize,
    concat!("Size of: ", stringify!(__darwin_mcontext_avx32))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_mcontext_avx32>(),
    4usize,
    concat!("Alignment of ", stringify!(__darwin_mcontext_avx32))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_mcontext_avx32>())).__es as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_mcontext_avx32),
      "::",
      stringify!(__es)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_mcontext_avx32>())).__ss as *const _ as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_mcontext_avx32),
      "::",
      stringify!(__ss)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_mcontext_avx32>())).__fs as *const _ as usize },
    76usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_mcontext_avx32),
      "::",
      stringify!(__fs)
    )
  );
}
impl Default for __darwin_mcontext_avx32 {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
impl ::core::fmt::Debug for __darwin_mcontext_avx32 {
  fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
    write!(
      f,
      "__darwin_mcontext_avx32 {{ __es: {:?}, __ss: {:?}, __fs: {:?} }}",
      self.__es, self.__ss, self.__fs
    )
  }
}
impl ::core::cmp::PartialEq for __darwin_mcontext_avx32 {
  fn eq(&self, other: &__darwin_mcontext_avx32) -> bool {
    self.__es == other.__es && self.__ss == other.__ss && self.__fs == other.__fs
  }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __darwin_mcontext_avx512_32 {
  pub __es: __darwin_i386_exception_state,
  pub __ss: __darwin_i386_thread_state,
  pub __fs: __darwin_i386_avx512_state,
}
#[test]
fn bindgen_test_layout___darwin_mcontext_avx512_32() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_mcontext_avx512_32>(),
    1112usize,
    concat!("Size of: ", stringify!(__darwin_mcontext_avx512_32))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_mcontext_avx512_32>(),
    4usize,
    concat!("Alignment of ", stringify!(__darwin_mcontext_avx512_32))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_mcontext_avx512_32>())).__es as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_mcontext_avx512_32),
      "::",
      stringify!(__es)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_mcontext_avx512_32>())).__ss as *const _ as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_mcontext_avx512_32),
      "::",
      stringify!(__ss)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_mcontext_avx512_32>())).__fs as *const _ as usize },
    76usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_mcontext_avx512_32),
      "::",
      stringify!(__fs)
    )
  );
}
impl Default for __darwin_mcontext_avx512_32 {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
impl ::core::fmt::Debug for __darwin_mcontext_avx512_32 {
  fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
    write!(
      f,
      "__darwin_mcontext_avx512_32 {{ __es: {:?}, __ss: {:?}, __fs: {:?} }}",
      self.__es, self.__ss, self.__fs
    )
  }
}
impl ::core::cmp::PartialEq for __darwin_mcontext_avx512_32 {
  fn eq(&self, other: &__darwin_mcontext_avx512_32) -> bool {
    self.__es == other.__es && self.__ss == other.__ss && self.__fs == other.__fs
  }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __darwin_mcontext64 {
  pub __es: __darwin_x86_exception_state64,
  pub __ss: __darwin_x86_thread_state64,
  pub __fs: __darwin_x86_float_state64,
}
#[test]
fn bindgen_test_layout___darwin_mcontext64() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_mcontext64>(),
    712usize,
    concat!("Size of: ", stringify!(__darwin_mcontext64))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_mcontext64>(),
    8usize,
    concat!("Alignment of ", stringify!(__darwin_mcontext64))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_mcontext64>())).__es as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_mcontext64),
      "::",
      stringify!(__es)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_mcontext64>())).__ss as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_mcontext64),
      "::",
      stringify!(__ss)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_mcontext64>())).__fs as *const _ as usize },
    184usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_mcontext64),
      "::",
      stringify!(__fs)
    )
  );
}
impl Default for __darwin_mcontext64 {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
impl ::core::fmt::Debug for __darwin_mcontext64 {
  fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
    write!(
      f,
      "__darwin_mcontext64 {{ __es: {:?}, __ss: {:?}, __fs: {:?} }}",
      self.__es, self.__ss, self.__fs
    )
  }
}
impl ::core::cmp::PartialEq for __darwin_mcontext64 {
  fn eq(&self, other: &__darwin_mcontext64) -> bool {
    self.__es == other.__es && self.__ss == other.__ss && self.__fs == other.__fs
  }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __darwin_mcontext_avx64 {
  pub __es: __darwin_x86_exception_state64,
  pub __ss: __darwin_x86_thread_state64,
  pub __fs: __darwin_x86_avx_state64,
}
#[test]
fn bindgen_test_layout___darwin_mcontext_avx64() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_mcontext_avx64>(),
    1032usize,
    concat!("Size of: ", stringify!(__darwin_mcontext_avx64))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_mcontext_avx64>(),
    8usize,
    concat!("Alignment of ", stringify!(__darwin_mcontext_avx64))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_mcontext_avx64>())).__es as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_mcontext_avx64),
      "::",
      stringify!(__es)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_mcontext_avx64>())).__ss as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_mcontext_avx64),
      "::",
      stringify!(__ss)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_mcontext_avx64>())).__fs as *const _ as usize },
    184usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_mcontext_avx64),
      "::",
      stringify!(__fs)
    )
  );
}
impl Default for __darwin_mcontext_avx64 {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
impl ::core::fmt::Debug for __darwin_mcontext_avx64 {
  fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
    write!(
      f,
      "__darwin_mcontext_avx64 {{ __es: {:?}, __ss: {:?}, __fs: {:?} }}",
      self.__es, self.__ss, self.__fs
    )
  }
}
impl ::core::cmp::PartialEq for __darwin_mcontext_avx64 {
  fn eq(&self, other: &__darwin_mcontext_avx64) -> bool {
    self.__es == other.__es && self.__ss == other.__ss && self.__fs == other.__fs
  }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __darwin_mcontext_avx512_64 {
  pub __es: __darwin_x86_exception_state64,
  pub __ss: __darwin_x86_thread_state64,
  pub __fs: __darwin_x86_avx512_state64,
}
#[test]
fn bindgen_test_layout___darwin_mcontext_avx512_64() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_mcontext_avx512_64>(),
    2632usize,
    concat!("Size of: ", stringify!(__darwin_mcontext_avx512_64))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_mcontext_avx512_64>(),
    8usize,
    concat!("Alignment of ", stringify!(__darwin_mcontext_avx512_64))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_mcontext_avx512_64>())).__es as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_mcontext_avx512_64),
      "::",
      stringify!(__es)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_mcontext_avx512_64>())).__ss as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_mcontext_avx512_64),
      "::",
      stringify!(__ss)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_mcontext_avx512_64>())).__fs as *const _ as usize },
    184usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_mcontext_avx512_64),
      "::",
      stringify!(__fs)
    )
  );
}
impl Default for __darwin_mcontext_avx512_64 {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
impl ::core::fmt::Debug for __darwin_mcontext_avx512_64 {
  fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
    write!(
      f,
      "__darwin_mcontext_avx512_64 {{ __es: {:?}, __ss: {:?}, __fs: {:?} }}",
      self.__es, self.__ss, self.__fs
    )
  }
}
impl ::core::cmp::PartialEq for __darwin_mcontext_avx512_64 {
  fn eq(&self, other: &__darwin_mcontext_avx512_64) -> bool {
    self.__es == other.__es && self.__ss == other.__ss && self.__fs == other.__fs
  }
}
pub type mcontext_t = *mut __darwin_mcontext64;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct __darwin_sigaltstack {
  pub ss_sp: *mut libc::c_void,
  pub ss_size: __darwin_size_t,
  pub ss_flags: libc::c_int,
}
#[test]
fn bindgen_test_layout___darwin_sigaltstack() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_sigaltstack>(),
    24usize,
    concat!("Size of: ", stringify!(__darwin_sigaltstack))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_sigaltstack>(),
    8usize,
    concat!("Alignment of ", stringify!(__darwin_sigaltstack))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_sigaltstack>())).ss_sp as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_sigaltstack),
      "::",
      stringify!(ss_sp)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_sigaltstack>())).ss_size as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_sigaltstack),
      "::",
      stringify!(ss_size)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_sigaltstack>())).ss_flags as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_sigaltstack),
      "::",
      stringify!(ss_flags)
    )
  );
}
impl Default for __darwin_sigaltstack {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
pub type stack_t = __darwin_sigaltstack;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct __darwin_ucontext {
  pub uc_onstack: libc::c_int,
  pub uc_sigmask: __darwin_sigset_t,
  pub uc_stack: __darwin_sigaltstack,
  pub uc_link: *mut __darwin_ucontext,
  pub uc_mcsize: __darwin_size_t,
  pub uc_mcontext: *mut __darwin_mcontext64,
}
#[test]
fn bindgen_test_layout___darwin_ucontext() {
  assert_eq!(
    ::core::mem::size_of::<__darwin_ucontext>(),
    56usize,
    concat!("Size of: ", stringify!(__darwin_ucontext))
  );
  assert_eq!(
    ::core::mem::align_of::<__darwin_ucontext>(),
    8usize,
    concat!("Alignment of ", stringify!(__darwin_ucontext))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_ucontext>())).uc_onstack as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_ucontext),
      "::",
      stringify!(uc_onstack)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_ucontext>())).uc_sigmask as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_ucontext),
      "::",
      stringify!(uc_sigmask)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_ucontext>())).uc_stack as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_ucontext),
      "::",
      stringify!(uc_stack)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_ucontext>())).uc_link as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_ucontext),
      "::",
      stringify!(uc_link)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_ucontext>())).uc_mcsize as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_ucontext),
      "::",
      stringify!(uc_mcsize)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__darwin_ucontext>())).uc_mcontext as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(__darwin_ucontext),
      "::",
      stringify!(uc_mcontext)
    )
  );
}
impl Default for __darwin_ucontext {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
pub type ucontext_t = __darwin_ucontext;
pub type sigset_t = __darwin_sigset_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union sigval {
  pub sival_int: libc::c_int,
  pub sival_ptr: *mut libc::c_void,
  _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_sigval() {
  assert_eq!(
    ::core::mem::size_of::<sigval>(),
    8usize,
    concat!("Size of: ", stringify!(sigval))
  );
  assert_eq!(
    ::core::mem::align_of::<sigval>(),
    8usize,
    concat!("Alignment of ", stringify!(sigval))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<sigval>())).sival_int as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(sigval),
      "::",
      stringify!(sival_int)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<sigval>())).sival_ptr as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(sigval),
      "::",
      stringify!(sival_ptr)
    )
  );
}
impl Default for sigval {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
impl ::core::fmt::Debug for sigval {
  fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
    write!(f, "sigval {{ union }}")
  }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sigevent {
  pub sigev_notify: libc::c_int,
  pub sigev_signo: libc::c_int,
  pub sigev_value: sigval,
  pub sigev_notify_function: ::core::option::Option<unsafe extern "C" fn(arg1: sigval)>,
  pub sigev_notify_attributes: *mut pthread_attr_t,
}
#[test]
fn bindgen_test_layout_sigevent() {
  assert_eq!(
    ::core::mem::size_of::<sigevent>(),
    32usize,
    concat!("Size of: ", stringify!(sigevent))
  );
  assert_eq!(
    ::core::mem::align_of::<sigevent>(),
    8usize,
    concat!("Alignment of ", stringify!(sigevent))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<sigevent>())).sigev_notify as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(sigevent),
      "::",
      stringify!(sigev_notify)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<sigevent>())).sigev_signo as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(sigevent),
      "::",
      stringify!(sigev_signo)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<sigevent>())).sigev_value as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(sigevent),
      "::",
      stringify!(sigev_value)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<sigevent>())).sigev_notify_function as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(sigevent),
      "::",
      stringify!(sigev_notify_function)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<sigevent>())).sigev_notify_attributes as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(sigevent),
      "::",
      stringify!(sigev_notify_attributes)
    )
  );
}
impl Default for sigevent {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
impl ::core::fmt::Debug for sigevent {
  fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
    write ! ( f , "sigevent {{ sigev_notify: {:?}, sigev_signo: {:?}, sigev_value: {:?}, sigev_notify_function: {:?}, sigev_notify_attributes: {:?} }}" , self . sigev_notify , self . sigev_signo , self . sigev_value , self . sigev_notify_function , self . sigev_notify_attributes )
  }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __siginfo {
  pub si_signo: libc::c_int,
  pub si_errno: libc::c_int,
  pub si_code: libc::c_int,
  pub si_pid: pid_t,
  pub si_uid: uid_t,
  pub si_status: libc::c_int,
  pub si_addr: *mut libc::c_void,
  pub si_value: sigval,
  pub si_band: libc::c_long,
  pub __pad: [libc::c_ulong; 7usize],
}
#[test]
fn bindgen_test_layout___siginfo() {
  assert_eq!(
    ::core::mem::size_of::<__siginfo>(),
    104usize,
    concat!("Size of: ", stringify!(__siginfo))
  );
  assert_eq!(
    ::core::mem::align_of::<__siginfo>(),
    8usize,
    concat!("Alignment of ", stringify!(__siginfo))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__siginfo>())).si_signo as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__siginfo),
      "::",
      stringify!(si_signo)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__siginfo>())).si_errno as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(__siginfo),
      "::",
      stringify!(si_errno)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__siginfo>())).si_code as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(__siginfo),
      "::",
      stringify!(si_code)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__siginfo>())).si_pid as *const _ as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(__siginfo),
      "::",
      stringify!(si_pid)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__siginfo>())).si_uid as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(__siginfo),
      "::",
      stringify!(si_uid)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__siginfo>())).si_status as *const _ as usize },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(__siginfo),
      "::",
      stringify!(si_status)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__siginfo>())).si_addr as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(__siginfo),
      "::",
      stringify!(si_addr)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__siginfo>())).si_value as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(__siginfo),
      "::",
      stringify!(si_value)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__siginfo>())).si_band as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(__siginfo),
      "::",
      stringify!(si_band)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__siginfo>())).__pad as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(__siginfo),
      "::",
      stringify!(__pad)
    )
  );
}
impl Default for __siginfo {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
impl ::core::fmt::Debug for __siginfo {
  fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
    write ! ( f , "__siginfo {{ si_signo: {:?}, si_errno: {:?}, si_code: {:?}, si_pid: {:?}, si_uid: {:?}, si_status: {:?}, si_addr: {:?}, si_value: {:?}, si_band: {:?}, __pad: {:?} }}" , self . si_signo , self . si_errno , self . si_code , self . si_pid , self . si_uid , self . si_status , self . si_addr , self . si_value , self . si_band , self . __pad )
  }
}
pub type siginfo_t = __siginfo;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __sigaction_u {
  pub __sa_handler: ::core::option::Option<unsafe extern "C" fn(arg1: libc::c_int)>,
  pub __sa_sigaction: ::core::option::Option<
    unsafe extern "C" fn(arg1: libc::c_int, arg2: *mut __siginfo, arg3: *mut libc::c_void),
  >,
  _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout___sigaction_u() {
  assert_eq!(
    ::core::mem::size_of::<__sigaction_u>(),
    8usize,
    concat!("Size of: ", stringify!(__sigaction_u))
  );
  assert_eq!(
    ::core::mem::align_of::<__sigaction_u>(),
    8usize,
    concat!("Alignment of ", stringify!(__sigaction_u))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__sigaction_u>())).__sa_handler as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__sigaction_u),
      "::",
      stringify!(__sa_handler)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__sigaction_u>())).__sa_sigaction as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__sigaction_u),
      "::",
      stringify!(__sa_sigaction)
    )
  );
}
impl Default for __sigaction_u {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
impl ::core::fmt::Debug for __sigaction_u {
  fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
    write!(f, "__sigaction_u {{ union }}")
  }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __sigaction {
  pub __sigaction_u: __sigaction_u,
  pub sa_tramp: ::core::option::Option<
    unsafe extern "C" fn(
      arg1: *mut libc::c_void,
      arg2: libc::c_int,
      arg3: libc::c_int,
      arg4: *mut siginfo_t,
      arg5: *mut libc::c_void,
    ),
  >,
  pub sa_mask: sigset_t,
  pub sa_flags: libc::c_int,
}
#[test]
fn bindgen_test_layout___sigaction() {
  assert_eq!(
    ::core::mem::size_of::<__sigaction>(),
    24usize,
    concat!("Size of: ", stringify!(__sigaction))
  );
  assert_eq!(
    ::core::mem::align_of::<__sigaction>(),
    8usize,
    concat!("Alignment of ", stringify!(__sigaction))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__sigaction>())).__sigaction_u as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__sigaction),
      "::",
      stringify!(__sigaction_u)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__sigaction>())).sa_tramp as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(__sigaction),
      "::",
      stringify!(sa_tramp)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__sigaction>())).sa_mask as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(__sigaction),
      "::",
      stringify!(sa_mask)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<__sigaction>())).sa_flags as *const _ as usize },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(__sigaction),
      "::",
      stringify!(sa_flags)
    )
  );
}
impl Default for __sigaction {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
impl ::core::fmt::Debug for __sigaction {
  fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
    write!(
      f,
      "__sigaction {{ __sigaction_u: {:?}, sa_tramp: {:?}, sa_mask: {:?}, sa_flags: {:?} }}",
      self.__sigaction_u, self.sa_tramp, self.sa_mask, self.sa_flags
    )
  }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sigaction {
  pub __sigaction_u: __sigaction_u,
  pub sa_mask: sigset_t,
  pub sa_flags: libc::c_int,
}
#[test]
fn bindgen_test_layout_sigaction() {
  assert_eq!(
    ::core::mem::size_of::<sigaction>(),
    16usize,
    concat!("Size of: ", stringify!(sigaction))
  );
  assert_eq!(
    ::core::mem::align_of::<sigaction>(),
    8usize,
    concat!("Alignment of ", stringify!(sigaction))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<sigaction>())).__sigaction_u as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(sigaction),
      "::",
      stringify!(__sigaction_u)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<sigaction>())).sa_mask as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(sigaction),
      "::",
      stringify!(sa_mask)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<sigaction>())).sa_flags as *const _ as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(sigaction),
      "::",
      stringify!(sa_flags)
    )
  );
}
impl Default for sigaction {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
impl ::core::fmt::Debug for sigaction {
  fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
    write!(
      f,
      "sigaction {{ __sigaction_u: {:?}, sa_mask: {:?}, sa_flags: {:?} }}",
      self.__sigaction_u, self.sa_mask, self.sa_flags
    )
  }
}
pub type sig_t = ::core::option::Option<unsafe extern "C" fn(arg1: libc::c_int)>;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct sigvec {
  pub sv_handler: ::core::option::Option<unsafe extern "C" fn(arg1: libc::c_int)>,
  pub sv_mask: libc::c_int,
  pub sv_flags: libc::c_int,
}
#[test]
fn bindgen_test_layout_sigvec() {
  assert_eq!(
    ::core::mem::size_of::<sigvec>(),
    16usize,
    concat!("Size of: ", stringify!(sigvec))
  );
  assert_eq!(
    ::core::mem::align_of::<sigvec>(),
    8usize,
    concat!("Alignment of ", stringify!(sigvec))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<sigvec>())).sv_handler as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(sigvec),
      "::",
      stringify!(sv_handler)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<sigvec>())).sv_mask as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(sigvec),
      "::",
      stringify!(sv_mask)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<sigvec>())).sv_flags as *const _ as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(sigvec),
      "::",
      stringify!(sv_flags)
    )
  );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct sigstack {
  pub ss_sp: *mut libc::c_char,
  pub ss_onstack: libc::c_int,
}
#[test]
fn bindgen_test_layout_sigstack() {
  assert_eq!(
    ::core::mem::size_of::<sigstack>(),
    16usize,
    concat!("Size of: ", stringify!(sigstack))
  );
  assert_eq!(
    ::core::mem::align_of::<sigstack>(),
    8usize,
    concat!("Alignment of ", stringify!(sigstack))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<sigstack>())).ss_sp as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(sigstack),
      "::",
      stringify!(ss_sp)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<sigstack>())).ss_onstack as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(sigstack),
      "::",
      stringify!(ss_onstack)
    )
  );
}
impl Default for sigstack {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
extern "C" {
  #[link_name = "\u{1}_signal"]
  pub fn signal(
    arg1: libc::c_int,
    arg2: ::core::option::Option<unsafe extern "C" fn(arg1: libc::c_int)>,
  ) -> ::core::option::Option<
    unsafe extern "C" fn(
      arg1: libc::c_int,
      arg2: ::core::option::Option<unsafe extern "C" fn(arg1: libc::c_int)>,
    ),
  >;
}
pub type int_least8_t = i8;
pub type int_least16_t = i16;
pub type int_least32_t = i32;
pub type int_least64_t = i64;
pub type uint_least8_t = u8;
pub type uint_least16_t = u16;
pub type uint_least32_t = u32;
pub type uint_least64_t = u64;
pub type int_fast8_t = i8;
pub type int_fast16_t = i16;
pub type int_fast32_t = i32;
pub type int_fast64_t = i64;
pub type uint_fast8_t = u8;
pub type uint_fast16_t = u16;
pub type uint_fast32_t = u32;
pub type uint_fast64_t = u64;
pub type intmax_t = libc::c_long;
pub type uintmax_t = libc::c_ulong;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct timeval {
  pub tv_sec: __darwin_time_t,
  pub tv_usec: __darwin_suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
  assert_eq!(
    ::core::mem::size_of::<timeval>(),
    16usize,
    concat!("Size of: ", stringify!(timeval))
  );
  assert_eq!(
    ::core::mem::align_of::<timeval>(),
    8usize,
    concat!("Alignment of ", stringify!(timeval))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<timeval>())).tv_sec as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(timeval),
      "::",
      stringify!(tv_sec)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<timeval>())).tv_usec as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(timeval),
      "::",
      stringify!(tv_usec)
    )
  );
}
pub type rlim_t = __uint64_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct rusage {
  pub ru_utime: timeval,
  pub ru_stime: timeval,
  pub ru_maxrss: libc::c_long,
  pub ru_ixrss: libc::c_long,
  pub ru_idrss: libc::c_long,
  pub ru_isrss: libc::c_long,
  pub ru_minflt: libc::c_long,
  pub ru_majflt: libc::c_long,
  pub ru_nswap: libc::c_long,
  pub ru_inblock: libc::c_long,
  pub ru_oublock: libc::c_long,
  pub ru_msgsnd: libc::c_long,
  pub ru_msgrcv: libc::c_long,
  pub ru_nsignals: libc::c_long,
  pub ru_nvcsw: libc::c_long,
  pub ru_nivcsw: libc::c_long,
}
#[test]
fn bindgen_test_layout_rusage() {
  assert_eq!(
    ::core::mem::size_of::<rusage>(),
    144usize,
    concat!("Size of: ", stringify!(rusage))
  );
  assert_eq!(
    ::core::mem::align_of::<rusage>(),
    8usize,
    concat!("Alignment of ", stringify!(rusage))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage>())).ru_utime as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage),
      "::",
      stringify!(ru_utime)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage>())).ru_stime as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage),
      "::",
      stringify!(ru_stime)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage>())).ru_maxrss as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage),
      "::",
      stringify!(ru_maxrss)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage>())).ru_ixrss as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage),
      "::",
      stringify!(ru_ixrss)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage>())).ru_idrss as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage),
      "::",
      stringify!(ru_idrss)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage>())).ru_isrss as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage),
      "::",
      stringify!(ru_isrss)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage>())).ru_minflt as *const _ as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage),
      "::",
      stringify!(ru_minflt)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage>())).ru_majflt as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage),
      "::",
      stringify!(ru_majflt)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage>())).ru_nswap as *const _ as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage),
      "::",
      stringify!(ru_nswap)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage>())).ru_inblock as *const _ as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage),
      "::",
      stringify!(ru_inblock)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage>())).ru_oublock as *const _ as usize },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage),
      "::",
      stringify!(ru_oublock)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage>())).ru_msgsnd as *const _ as usize },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage),
      "::",
      stringify!(ru_msgsnd)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage>())).ru_msgrcv as *const _ as usize },
    112usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage),
      "::",
      stringify!(ru_msgrcv)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage>())).ru_nsignals as *const _ as usize },
    120usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage),
      "::",
      stringify!(ru_nsignals)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage>())).ru_nvcsw as *const _ as usize },
    128usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage),
      "::",
      stringify!(ru_nvcsw)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage>())).ru_nivcsw as *const _ as usize },
    136usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage),
      "::",
      stringify!(ru_nivcsw)
    )
  );
}
pub type rusage_info_t = *mut libc::c_void;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct rusage_info_v0 {
  pub ri_uuid: [u8; 16usize],
  pub ri_user_time: u64,
  pub ri_system_time: u64,
  pub ri_pkg_idle_wkups: u64,
  pub ri_interrupt_wkups: u64,
  pub ri_pageins: u64,
  pub ri_wired_size: u64,
  pub ri_resident_size: u64,
  pub ri_phys_footprint: u64,
  pub ri_proc_start_abstime: u64,
  pub ri_proc_exit_abstime: u64,
}
#[test]
fn bindgen_test_layout_rusage_info_v0() {
  assert_eq!(
    ::core::mem::size_of::<rusage_info_v0>(),
    96usize,
    concat!("Size of: ", stringify!(rusage_info_v0))
  );
  assert_eq!(
    ::core::mem::align_of::<rusage_info_v0>(),
    8usize,
    concat!("Alignment of ", stringify!(rusage_info_v0))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v0>())).ri_uuid as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v0),
      "::",
      stringify!(ri_uuid)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v0>())).ri_user_time as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v0),
      "::",
      stringify!(ri_user_time)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v0>())).ri_system_time as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v0),
      "::",
      stringify!(ri_system_time)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v0>())).ri_pkg_idle_wkups as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v0),
      "::",
      stringify!(ri_pkg_idle_wkups)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v0>())).ri_interrupt_wkups as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v0),
      "::",
      stringify!(ri_interrupt_wkups)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v0>())).ri_pageins as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v0),
      "::",
      stringify!(ri_pageins)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v0>())).ri_wired_size as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v0),
      "::",
      stringify!(ri_wired_size)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v0>())).ri_resident_size as *const _ as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v0),
      "::",
      stringify!(ri_resident_size)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v0>())).ri_phys_footprint as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v0),
      "::",
      stringify!(ri_phys_footprint)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v0>())).ri_proc_start_abstime as *const _ as usize
    },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v0),
      "::",
      stringify!(ri_proc_start_abstime)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v0>())).ri_proc_exit_abstime as *const _ as usize
    },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v0),
      "::",
      stringify!(ri_proc_exit_abstime)
    )
  );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct rusage_info_v1 {
  pub ri_uuid: [u8; 16usize],
  pub ri_user_time: u64,
  pub ri_system_time: u64,
  pub ri_pkg_idle_wkups: u64,
  pub ri_interrupt_wkups: u64,
  pub ri_pageins: u64,
  pub ri_wired_size: u64,
  pub ri_resident_size: u64,
  pub ri_phys_footprint: u64,
  pub ri_proc_start_abstime: u64,
  pub ri_proc_exit_abstime: u64,
  pub ri_child_user_time: u64,
  pub ri_child_system_time: u64,
  pub ri_child_pkg_idle_wkups: u64,
  pub ri_child_interrupt_wkups: u64,
  pub ri_child_pageins: u64,
  pub ri_child_elapsed_abstime: u64,
}
#[test]
fn bindgen_test_layout_rusage_info_v1() {
  assert_eq!(
    ::core::mem::size_of::<rusage_info_v1>(),
    144usize,
    concat!("Size of: ", stringify!(rusage_info_v1))
  );
  assert_eq!(
    ::core::mem::align_of::<rusage_info_v1>(),
    8usize,
    concat!("Alignment of ", stringify!(rusage_info_v1))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v1>())).ri_uuid as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v1),
      "::",
      stringify!(ri_uuid)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v1>())).ri_user_time as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v1),
      "::",
      stringify!(ri_user_time)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v1>())).ri_system_time as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v1),
      "::",
      stringify!(ri_system_time)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v1>())).ri_pkg_idle_wkups as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v1),
      "::",
      stringify!(ri_pkg_idle_wkups)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v1>())).ri_interrupt_wkups as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v1),
      "::",
      stringify!(ri_interrupt_wkups)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v1>())).ri_pageins as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v1),
      "::",
      stringify!(ri_pageins)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v1>())).ri_wired_size as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v1),
      "::",
      stringify!(ri_wired_size)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v1>())).ri_resident_size as *const _ as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v1),
      "::",
      stringify!(ri_resident_size)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v1>())).ri_phys_footprint as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v1),
      "::",
      stringify!(ri_phys_footprint)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v1>())).ri_proc_start_abstime as *const _ as usize
    },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v1),
      "::",
      stringify!(ri_proc_start_abstime)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v1>())).ri_proc_exit_abstime as *const _ as usize
    },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v1),
      "::",
      stringify!(ri_proc_exit_abstime)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v1>())).ri_child_user_time as *const _ as usize },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v1),
      "::",
      stringify!(ri_child_user_time)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v1>())).ri_child_system_time as *const _ as usize
    },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v1),
      "::",
      stringify!(ri_child_system_time)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v1>())).ri_child_pkg_idle_wkups as *const _ as usize
    },
    112usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v1),
      "::",
      stringify!(ri_child_pkg_idle_wkups)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v1>())).ri_child_interrupt_wkups as *const _ as usize
    },
    120usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v1),
      "::",
      stringify!(ri_child_interrupt_wkups)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v1>())).ri_child_pageins as *const _ as usize },
    128usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v1),
      "::",
      stringify!(ri_child_pageins)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v1>())).ri_child_elapsed_abstime as *const _ as usize
    },
    136usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v1),
      "::",
      stringify!(ri_child_elapsed_abstime)
    )
  );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct rusage_info_v2 {
  pub ri_uuid: [u8; 16usize],
  pub ri_user_time: u64,
  pub ri_system_time: u64,
  pub ri_pkg_idle_wkups: u64,
  pub ri_interrupt_wkups: u64,
  pub ri_pageins: u64,
  pub ri_wired_size: u64,
  pub ri_resident_size: u64,
  pub ri_phys_footprint: u64,
  pub ri_proc_start_abstime: u64,
  pub ri_proc_exit_abstime: u64,
  pub ri_child_user_time: u64,
  pub ri_child_system_time: u64,
  pub ri_child_pkg_idle_wkups: u64,
  pub ri_child_interrupt_wkups: u64,
  pub ri_child_pageins: u64,
  pub ri_child_elapsed_abstime: u64,
  pub ri_diskio_bytesread: u64,
  pub ri_diskio_byteswritten: u64,
}
#[test]
fn bindgen_test_layout_rusage_info_v2() {
  assert_eq!(
    ::core::mem::size_of::<rusage_info_v2>(),
    160usize,
    concat!("Size of: ", stringify!(rusage_info_v2))
  );
  assert_eq!(
    ::core::mem::align_of::<rusage_info_v2>(),
    8usize,
    concat!("Alignment of ", stringify!(rusage_info_v2))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v2>())).ri_uuid as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v2),
      "::",
      stringify!(ri_uuid)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v2>())).ri_user_time as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v2),
      "::",
      stringify!(ri_user_time)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v2>())).ri_system_time as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v2),
      "::",
      stringify!(ri_system_time)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v2>())).ri_pkg_idle_wkups as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v2),
      "::",
      stringify!(ri_pkg_idle_wkups)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v2>())).ri_interrupt_wkups as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v2),
      "::",
      stringify!(ri_interrupt_wkups)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v2>())).ri_pageins as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v2),
      "::",
      stringify!(ri_pageins)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v2>())).ri_wired_size as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v2),
      "::",
      stringify!(ri_wired_size)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v2>())).ri_resident_size as *const _ as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v2),
      "::",
      stringify!(ri_resident_size)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v2>())).ri_phys_footprint as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v2),
      "::",
      stringify!(ri_phys_footprint)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v2>())).ri_proc_start_abstime as *const _ as usize
    },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v2),
      "::",
      stringify!(ri_proc_start_abstime)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v2>())).ri_proc_exit_abstime as *const _ as usize
    },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v2),
      "::",
      stringify!(ri_proc_exit_abstime)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v2>())).ri_child_user_time as *const _ as usize },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v2),
      "::",
      stringify!(ri_child_user_time)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v2>())).ri_child_system_time as *const _ as usize
    },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v2),
      "::",
      stringify!(ri_child_system_time)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v2>())).ri_child_pkg_idle_wkups as *const _ as usize
    },
    112usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v2),
      "::",
      stringify!(ri_child_pkg_idle_wkups)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v2>())).ri_child_interrupt_wkups as *const _ as usize
    },
    120usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v2),
      "::",
      stringify!(ri_child_interrupt_wkups)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v2>())).ri_child_pageins as *const _ as usize },
    128usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v2),
      "::",
      stringify!(ri_child_pageins)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v2>())).ri_child_elapsed_abstime as *const _ as usize
    },
    136usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v2),
      "::",
      stringify!(ri_child_elapsed_abstime)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v2>())).ri_diskio_bytesread as *const _ as usize },
    144usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v2),
      "::",
      stringify!(ri_diskio_bytesread)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v2>())).ri_diskio_byteswritten as *const _ as usize
    },
    152usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v2),
      "::",
      stringify!(ri_diskio_byteswritten)
    )
  );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct rusage_info_v3 {
  pub ri_uuid: [u8; 16usize],
  pub ri_user_time: u64,
  pub ri_system_time: u64,
  pub ri_pkg_idle_wkups: u64,
  pub ri_interrupt_wkups: u64,
  pub ri_pageins: u64,
  pub ri_wired_size: u64,
  pub ri_resident_size: u64,
  pub ri_phys_footprint: u64,
  pub ri_proc_start_abstime: u64,
  pub ri_proc_exit_abstime: u64,
  pub ri_child_user_time: u64,
  pub ri_child_system_time: u64,
  pub ri_child_pkg_idle_wkups: u64,
  pub ri_child_interrupt_wkups: u64,
  pub ri_child_pageins: u64,
  pub ri_child_elapsed_abstime: u64,
  pub ri_diskio_bytesread: u64,
  pub ri_diskio_byteswritten: u64,
  pub ri_cpu_time_qos_default: u64,
  pub ri_cpu_time_qos_maintenance: u64,
  pub ri_cpu_time_qos_background: u64,
  pub ri_cpu_time_qos_utility: u64,
  pub ri_cpu_time_qos_legacy: u64,
  pub ri_cpu_time_qos_user_initiated: u64,
  pub ri_cpu_time_qos_user_interactive: u64,
  pub ri_billed_system_time: u64,
  pub ri_serviced_system_time: u64,
}
#[test]
fn bindgen_test_layout_rusage_info_v3() {
  assert_eq!(
    ::core::mem::size_of::<rusage_info_v3>(),
    232usize,
    concat!("Size of: ", stringify!(rusage_info_v3))
  );
  assert_eq!(
    ::core::mem::align_of::<rusage_info_v3>(),
    8usize,
    concat!("Alignment of ", stringify!(rusage_info_v3))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v3>())).ri_uuid as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v3),
      "::",
      stringify!(ri_uuid)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v3>())).ri_user_time as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v3),
      "::",
      stringify!(ri_user_time)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v3>())).ri_system_time as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v3),
      "::",
      stringify!(ri_system_time)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v3>())).ri_pkg_idle_wkups as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v3),
      "::",
      stringify!(ri_pkg_idle_wkups)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v3>())).ri_interrupt_wkups as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v3),
      "::",
      stringify!(ri_interrupt_wkups)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v3>())).ri_pageins as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v3),
      "::",
      stringify!(ri_pageins)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v3>())).ri_wired_size as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v3),
      "::",
      stringify!(ri_wired_size)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v3>())).ri_resident_size as *const _ as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v3),
      "::",
      stringify!(ri_resident_size)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v3>())).ri_phys_footprint as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v3),
      "::",
      stringify!(ri_phys_footprint)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v3>())).ri_proc_start_abstime as *const _ as usize
    },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v3),
      "::",
      stringify!(ri_proc_start_abstime)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v3>())).ri_proc_exit_abstime as *const _ as usize
    },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v3),
      "::",
      stringify!(ri_proc_exit_abstime)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v3>())).ri_child_user_time as *const _ as usize },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v3),
      "::",
      stringify!(ri_child_user_time)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v3>())).ri_child_system_time as *const _ as usize
    },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v3),
      "::",
      stringify!(ri_child_system_time)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v3>())).ri_child_pkg_idle_wkups as *const _ as usize
    },
    112usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v3),
      "::",
      stringify!(ri_child_pkg_idle_wkups)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v3>())).ri_child_interrupt_wkups as *const _ as usize
    },
    120usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v3),
      "::",
      stringify!(ri_child_interrupt_wkups)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v3>())).ri_child_pageins as *const _ as usize },
    128usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v3),
      "::",
      stringify!(ri_child_pageins)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v3>())).ri_child_elapsed_abstime as *const _ as usize
    },
    136usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v3),
      "::",
      stringify!(ri_child_elapsed_abstime)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v3>())).ri_diskio_bytesread as *const _ as usize },
    144usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v3),
      "::",
      stringify!(ri_diskio_bytesread)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v3>())).ri_diskio_byteswritten as *const _ as usize
    },
    152usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v3),
      "::",
      stringify!(ri_diskio_byteswritten)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v3>())).ri_cpu_time_qos_default as *const _ as usize
    },
    160usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v3),
      "::",
      stringify!(ri_cpu_time_qos_default)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v3>())).ri_cpu_time_qos_maintenance as *const _ as usize
    },
    168usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v3),
      "::",
      stringify!(ri_cpu_time_qos_maintenance)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v3>())).ri_cpu_time_qos_background as *const _ as usize
    },
    176usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v3),
      "::",
      stringify!(ri_cpu_time_qos_background)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v3>())).ri_cpu_time_qos_utility as *const _ as usize
    },
    184usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v3),
      "::",
      stringify!(ri_cpu_time_qos_utility)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v3>())).ri_cpu_time_qos_legacy as *const _ as usize
    },
    192usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v3),
      "::",
      stringify!(ri_cpu_time_qos_legacy)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v3>())).ri_cpu_time_qos_user_initiated as *const _
        as usize
    },
    200usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v3),
      "::",
      stringify!(ri_cpu_time_qos_user_initiated)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v3>())).ri_cpu_time_qos_user_interactive as *const _
        as usize
    },
    208usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v3),
      "::",
      stringify!(ri_cpu_time_qos_user_interactive)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v3>())).ri_billed_system_time as *const _ as usize
    },
    216usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v3),
      "::",
      stringify!(ri_billed_system_time)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v3>())).ri_serviced_system_time as *const _ as usize
    },
    224usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v3),
      "::",
      stringify!(ri_serviced_system_time)
    )
  );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct rusage_info_v4 {
  pub ri_uuid: [u8; 16usize],
  pub ri_user_time: u64,
  pub ri_system_time: u64,
  pub ri_pkg_idle_wkups: u64,
  pub ri_interrupt_wkups: u64,
  pub ri_pageins: u64,
  pub ri_wired_size: u64,
  pub ri_resident_size: u64,
  pub ri_phys_footprint: u64,
  pub ri_proc_start_abstime: u64,
  pub ri_proc_exit_abstime: u64,
  pub ri_child_user_time: u64,
  pub ri_child_system_time: u64,
  pub ri_child_pkg_idle_wkups: u64,
  pub ri_child_interrupt_wkups: u64,
  pub ri_child_pageins: u64,
  pub ri_child_elapsed_abstime: u64,
  pub ri_diskio_bytesread: u64,
  pub ri_diskio_byteswritten: u64,
  pub ri_cpu_time_qos_default: u64,
  pub ri_cpu_time_qos_maintenance: u64,
  pub ri_cpu_time_qos_background: u64,
  pub ri_cpu_time_qos_utility: u64,
  pub ri_cpu_time_qos_legacy: u64,
  pub ri_cpu_time_qos_user_initiated: u64,
  pub ri_cpu_time_qos_user_interactive: u64,
  pub ri_billed_system_time: u64,
  pub ri_serviced_system_time: u64,
  pub ri_logical_writes: u64,
  pub ri_lifetime_max_phys_footprint: u64,
  pub ri_instructions: u64,
  pub ri_cycles: u64,
  pub ri_billed_energy: u64,
  pub ri_serviced_energy: u64,
  pub ri_unused: [u64; 2usize],
}
#[test]
fn bindgen_test_layout_rusage_info_v4() {
  assert_eq!(
    ::core::mem::size_of::<rusage_info_v4>(),
    296usize,
    concat!("Size of: ", stringify!(rusage_info_v4))
  );
  assert_eq!(
    ::core::mem::align_of::<rusage_info_v4>(),
    8usize,
    concat!("Alignment of ", stringify!(rusage_info_v4))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v4>())).ri_uuid as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_uuid)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v4>())).ri_user_time as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_user_time)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v4>())).ri_system_time as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_system_time)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v4>())).ri_pkg_idle_wkups as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_pkg_idle_wkups)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v4>())).ri_interrupt_wkups as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_interrupt_wkups)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v4>())).ri_pageins as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_pageins)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v4>())).ri_wired_size as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_wired_size)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v4>())).ri_resident_size as *const _ as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_resident_size)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v4>())).ri_phys_footprint as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_phys_footprint)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v4>())).ri_proc_start_abstime as *const _ as usize
    },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_proc_start_abstime)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v4>())).ri_proc_exit_abstime as *const _ as usize
    },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_proc_exit_abstime)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v4>())).ri_child_user_time as *const _ as usize },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_child_user_time)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v4>())).ri_child_system_time as *const _ as usize
    },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_child_system_time)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v4>())).ri_child_pkg_idle_wkups as *const _ as usize
    },
    112usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_child_pkg_idle_wkups)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v4>())).ri_child_interrupt_wkups as *const _ as usize
    },
    120usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_child_interrupt_wkups)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v4>())).ri_child_pageins as *const _ as usize },
    128usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_child_pageins)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v4>())).ri_child_elapsed_abstime as *const _ as usize
    },
    136usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_child_elapsed_abstime)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v4>())).ri_diskio_bytesread as *const _ as usize },
    144usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_diskio_bytesread)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v4>())).ri_diskio_byteswritten as *const _ as usize
    },
    152usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_diskio_byteswritten)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v4>())).ri_cpu_time_qos_default as *const _ as usize
    },
    160usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_cpu_time_qos_default)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v4>())).ri_cpu_time_qos_maintenance as *const _ as usize
    },
    168usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_cpu_time_qos_maintenance)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v4>())).ri_cpu_time_qos_background as *const _ as usize
    },
    176usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_cpu_time_qos_background)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v4>())).ri_cpu_time_qos_utility as *const _ as usize
    },
    184usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_cpu_time_qos_utility)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v4>())).ri_cpu_time_qos_legacy as *const _ as usize
    },
    192usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_cpu_time_qos_legacy)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v4>())).ri_cpu_time_qos_user_initiated as *const _
        as usize
    },
    200usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_cpu_time_qos_user_initiated)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v4>())).ri_cpu_time_qos_user_interactive as *const _
        as usize
    },
    208usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_cpu_time_qos_user_interactive)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v4>())).ri_billed_system_time as *const _ as usize
    },
    216usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_billed_system_time)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v4>())).ri_serviced_system_time as *const _ as usize
    },
    224usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_serviced_system_time)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v4>())).ri_logical_writes as *const _ as usize },
    232usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_logical_writes)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<rusage_info_v4>())).ri_lifetime_max_phys_footprint as *const _
        as usize
    },
    240usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_lifetime_max_phys_footprint)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v4>())).ri_instructions as *const _ as usize },
    248usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_instructions)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v4>())).ri_cycles as *const _ as usize },
    256usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_cycles)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v4>())).ri_billed_energy as *const _ as usize },
    264usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_billed_energy)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v4>())).ri_serviced_energy as *const _ as usize },
    272usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_serviced_energy)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rusage_info_v4>())).ri_unused as *const _ as usize },
    280usize,
    concat!(
      "Offset of field: ",
      stringify!(rusage_info_v4),
      "::",
      stringify!(ri_unused)
    )
  );
}
pub type rusage_info_current = rusage_info_v4;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct rlimit {
  pub rlim_cur: rlim_t,
  pub rlim_max: rlim_t,
}
#[test]
fn bindgen_test_layout_rlimit() {
  assert_eq!(
    ::core::mem::size_of::<rlimit>(),
    16usize,
    concat!("Size of: ", stringify!(rlimit))
  );
  assert_eq!(
    ::core::mem::align_of::<rlimit>(),
    8usize,
    concat!("Alignment of ", stringify!(rlimit))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rlimit>())).rlim_cur as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(rlimit),
      "::",
      stringify!(rlim_cur)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<rlimit>())).rlim_max as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(rlimit),
      "::",
      stringify!(rlim_max)
    )
  );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct proc_rlimit_control_wakeupmon {
  pub wm_flags: u32,
  pub wm_rate: i32,
}
#[test]
fn bindgen_test_layout_proc_rlimit_control_wakeupmon() {
  assert_eq!(
    ::core::mem::size_of::<proc_rlimit_control_wakeupmon>(),
    8usize,
    concat!("Size of: ", stringify!(proc_rlimit_control_wakeupmon))
  );
  assert_eq!(
    ::core::mem::align_of::<proc_rlimit_control_wakeupmon>(),
    4usize,
    concat!("Alignment of ", stringify!(proc_rlimit_control_wakeupmon))
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<proc_rlimit_control_wakeupmon>())).wm_flags as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(proc_rlimit_control_wakeupmon),
      "::",
      stringify!(wm_flags)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::core::ptr::null::<proc_rlimit_control_wakeupmon>())).wm_rate as *const _ as usize
    },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(proc_rlimit_control_wakeupmon),
      "::",
      stringify!(wm_rate)
    )
  );
}
extern "C" {
  #[link_name = "\u{1}_getpriority"]
  pub fn getpriority(arg1: libc::c_int, arg2: id_t) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_getiopolicy_np"]
  pub fn getiopolicy_np(arg1: libc::c_int, arg2: libc::c_int) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_getrlimit"]
  pub fn getrlimit(arg1: libc::c_int, arg2: *mut rlimit) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_getrusage"]
  pub fn getrusage(arg1: libc::c_int, arg2: *mut rusage) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_setpriority"]
  pub fn setpriority(arg1: libc::c_int, arg2: id_t, arg3: libc::c_int) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_setiopolicy_np"]
  pub fn setiopolicy_np(arg1: libc::c_int, arg2: libc::c_int, arg3: libc::c_int) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_setrlimit"]
  pub fn setrlimit(arg1: libc::c_int, arg2: *const rlimit) -> libc::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union wait {
  pub w_status: libc::c_int,
  pub w_T: wait__bindgen_ty_1,
  pub w_S: wait__bindgen_ty_2,
  _bindgen_union_align: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct wait__bindgen_ty_1 {
  pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u16>,
}
#[test]
fn bindgen_test_layout_wait__bindgen_ty_1() {
  assert_eq!(
    ::core::mem::size_of::<wait__bindgen_ty_1>(),
    4usize,
    concat!("Size of: ", stringify!(wait__bindgen_ty_1))
  );
  assert_eq!(
    ::core::mem::align_of::<wait__bindgen_ty_1>(),
    4usize,
    concat!("Alignment of ", stringify!(wait__bindgen_ty_1))
  );
}
impl wait__bindgen_ty_1 {
  #[inline]
  pub fn w_Termsig(&self) -> libc::c_uint {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 7u8) as u32) }
  }
  #[inline]
  pub fn set_w_Termsig(&mut self, val: libc::c_uint) {
    unsafe {
      let val: u32 = ::core::mem::transmute(val);
      self._bitfield_1.set(0usize, 7u8, val as u64)
    }
  }
  #[inline]
  pub fn w_Coredump(&self) -> libc::c_uint {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_w_Coredump(&mut self, val: libc::c_uint) {
    unsafe {
      let val: u32 = ::core::mem::transmute(val);
      self._bitfield_1.set(7usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn w_Retcode(&self) -> libc::c_uint {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 8u8) as u32) }
  }
  #[inline]
  pub fn set_w_Retcode(&mut self, val: libc::c_uint) {
    unsafe {
      let val: u32 = ::core::mem::transmute(val);
      self._bitfield_1.set(8usize, 8u8, val as u64)
    }
  }
  #[inline]
  pub fn w_Filler(&self) -> libc::c_uint {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 16u8) as u32) }
  }
  #[inline]
  pub fn set_w_Filler(&mut self, val: libc::c_uint) {
    unsafe {
      let val: u32 = ::core::mem::transmute(val);
      self._bitfield_1.set(16usize, 16u8, val as u64)
    }
  }
  #[inline]
  pub fn new_bitfield_1(
    w_Termsig: libc::c_uint,
    w_Coredump: libc::c_uint,
    w_Retcode: libc::c_uint,
    w_Filler: libc::c_uint,
  ) -> __BindgenBitfieldUnit<[u8; 4usize], u16> {
    let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u16> = Default::default();
    __bindgen_bitfield_unit.set(0usize, 7u8, {
      let w_Termsig: u32 = unsafe { ::core::mem::transmute(w_Termsig) };
      w_Termsig as u64
    });
    __bindgen_bitfield_unit.set(7usize, 1u8, {
      let w_Coredump: u32 = unsafe { ::core::mem::transmute(w_Coredump) };
      w_Coredump as u64
    });
    __bindgen_bitfield_unit.set(8usize, 8u8, {
      let w_Retcode: u32 = unsafe { ::core::mem::transmute(w_Retcode) };
      w_Retcode as u64
    });
    __bindgen_bitfield_unit.set(16usize, 16u8, {
      let w_Filler: u32 = unsafe { ::core::mem::transmute(w_Filler) };
      w_Filler as u64
    });
    __bindgen_bitfield_unit
  }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct wait__bindgen_ty_2 {
  pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u16>,
}
#[test]
fn bindgen_test_layout_wait__bindgen_ty_2() {
  assert_eq!(
    ::core::mem::size_of::<wait__bindgen_ty_2>(),
    4usize,
    concat!("Size of: ", stringify!(wait__bindgen_ty_2))
  );
  assert_eq!(
    ::core::mem::align_of::<wait__bindgen_ty_2>(),
    4usize,
    concat!("Alignment of ", stringify!(wait__bindgen_ty_2))
  );
}
impl wait__bindgen_ty_2 {
  #[inline]
  pub fn w_Stopval(&self) -> libc::c_uint {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
  }
  #[inline]
  pub fn set_w_Stopval(&mut self, val: libc::c_uint) {
    unsafe {
      let val: u32 = ::core::mem::transmute(val);
      self._bitfield_1.set(0usize, 8u8, val as u64)
    }
  }
  #[inline]
  pub fn w_Stopsig(&self) -> libc::c_uint {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 8u8) as u32) }
  }
  #[inline]
  pub fn set_w_Stopsig(&mut self, val: libc::c_uint) {
    unsafe {
      let val: u32 = ::core::mem::transmute(val);
      self._bitfield_1.set(8usize, 8u8, val as u64)
    }
  }
  #[inline]
  pub fn w_Filler(&self) -> libc::c_uint {
    unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 16u8) as u32) }
  }
  #[inline]
  pub fn set_w_Filler(&mut self, val: libc::c_uint) {
    unsafe {
      let val: u32 = ::core::mem::transmute(val);
      self._bitfield_1.set(16usize, 16u8, val as u64)
    }
  }
  #[inline]
  pub fn new_bitfield_1(
    w_Stopval: libc::c_uint,
    w_Stopsig: libc::c_uint,
    w_Filler: libc::c_uint,
  ) -> __BindgenBitfieldUnit<[u8; 4usize], u16> {
    let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u16> = Default::default();
    __bindgen_bitfield_unit.set(0usize, 8u8, {
      let w_Stopval: u32 = unsafe { ::core::mem::transmute(w_Stopval) };
      w_Stopval as u64
    });
    __bindgen_bitfield_unit.set(8usize, 8u8, {
      let w_Stopsig: u32 = unsafe { ::core::mem::transmute(w_Stopsig) };
      w_Stopsig as u64
    });
    __bindgen_bitfield_unit.set(16usize, 16u8, {
      let w_Filler: u32 = unsafe { ::core::mem::transmute(w_Filler) };
      w_Filler as u64
    });
    __bindgen_bitfield_unit
  }
}
#[test]
fn bindgen_test_layout_wait() {
  assert_eq!(
    ::core::mem::size_of::<wait>(),
    4usize,
    concat!("Size of: ", stringify!(wait))
  );
  assert_eq!(
    ::core::mem::align_of::<wait>(),
    4usize,
    concat!("Alignment of ", stringify!(wait))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<wait>())).w_status as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(wait),
      "::",
      stringify!(w_status)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<wait>())).w_T as *const _ as usize },
    0usize,
    concat!("Offset of field: ", stringify!(wait), "::", stringify!(w_T))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<wait>())).w_S as *const _ as usize },
    0usize,
    concat!("Offset of field: ", stringify!(wait), "::", stringify!(w_S))
  );
}
impl Default for wait {
  fn default() -> Self {
    unsafe { ::core::mem::zeroed() }
  }
}
impl ::core::fmt::Debug for wait {
  fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
    write!(f, "wait {{ union }}")
  }
}
extern "C" {
  #[link_name = "\u{1}_wait"]
  pub fn wait(arg1: *mut libc::c_int) -> pid_t;
}
extern "C" {
  #[link_name = "\u{1}_waitpid"]
  pub fn waitpid(arg1: pid_t, arg2: *mut libc::c_int, arg3: libc::c_int) -> pid_t;
}
extern "C" {
  #[link_name = "\u{1}_waitid"]
  pub fn waitid(
    arg1: idtype_t::Type,
    arg2: id_t,
    arg3: *mut siginfo_t,
    arg4: libc::c_int,
  ) -> libc::c_int;
}
extern "C" {
  #[link_name = "\u{1}_wait3"]
  pub fn wait3(arg1: *mut libc::c_int, arg2: libc::c_int, arg3: *mut rusage) -> pid_t;
}
extern "C" {
  #[link_name = "\u{1}_wait4"]
  pub fn wait4(arg1: pid_t, arg2: *mut libc::c_int, arg3: libc::c_int, arg4: *mut rusage) -> pid_t;
}
extern "C" {
  #[link_name = "\u{1}_alloca"]
  pub fn alloca(arg1: libc::c_ulong) -> *mut libc::c_void;
}
pub type ct_rune_t = __darwin_ct_rune_t;
pub type rune_t = __darwin_rune_t;
pub type wchar_t = __darwin_wchar_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct div_t {
  pub quot: libc::c_int,
  pub rem: libc::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
  assert_eq!(
    ::core::mem::size_of::<div_t>(),
    8usize,
    concat!("Size of: ", stringify!(div_t))
  );
  assert_eq!(
    ::core::mem::align_of::<div_t>(),
    4usize,
    concat!("Alignment of ", stringify!(div_t))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<div_t>())).quot as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(div_t),
      "::",
      stringify!(quot)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<div_t>())).rem as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(div_t),
      "::",
      stringify!(rem)
    )
  );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct ldiv_t {
  pub quot: libc::c_long,
  pub rem: libc::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
  assert_eq!(
    ::core::mem::size_of::<ldiv_t>(),
    16usize,
    concat!("Size of: ", stringify!(ldiv_t))
  );
  assert_eq!(
    ::core::mem::align_of::<ldiv_t>(),
    8usize,
    concat!("Alignment of ", stringify!(ldiv_t))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<ldiv_t>())).quot as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(ldiv_t),
      "::",
      stringify!(quot)
    )
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<ldiv_t>())).rem as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(ldiv_t),
      "::",
      stringify!(rem)
    )
  );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct lldiv_t {
  pub quot: libc::c_longlong,
  pub rem: libc::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
  assert_eq!(
    ::core::mem::size_of::<lldiv_t>(),
    16usize,
    concat!("Size of: ", stringify!(lldiv_t))
  );
  assert_eq!(
    ::core::mem::align_of::<lldiv_t>(),
    8usize,
    concat!("Alignment of ", stringify!(lldiv_t))
  );
  assert_eq!(
    unsafe { &(*(::core::ptr::null::<lldiv_t>())).quot as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(lldiv_t),
      "::",
      stringify!(quot)
    )
  );
  assert_eq!(
